Repository: fisharebest/webtrees
Catalog: modules_v3/facebook/language/*.po
Languages: nb

source: Facebook usernames can only contain alphanumeric characters (A-Z, 0-9) or a period
nb: Facebook brukernavn kan kun bestå av av bokstaver (A-Z), tall (0-9) og et punktum

source: App ID:
nb: Applikasjons-ID:

source: NOTE: New user registration is disabled in Site configuration so only existing users will be able to login.
nb: VIKTIG: Nye brukerregistreringer er avslått i nettstedkonfigurasjonen slik at kun eksisterende brukere kan logge inn.

source: Require verified Facebook accounts
nb: Krev bekreftet Facebook-konto

source: Only disable for testing
nb: Slå av kun for testing

source: Hide regular log-in and registration forms
nb: Skjul ordinær innlogging og registreringsskjema

source: Save
nb: Lagre

source: Linked users
nb: Knyttede brukere

source: Associate a webtrees user with a Facebook account.
nb: Knytt en webtrees-bruker med en Facebook-konto

source: webtrees Username
nb: webtrees brukernavn

source: Real name
nb: Virkelig navn

source: Facebook Account
nb: Facebook-konto

source: Unlink
nb: Fjern knytning

source: Add
nb: Legg til

source: Pre-approve users
nb: Forhåndsgodkjente brukere

source: If you know a user's Facebook username but they don't have an account in webtrees, you can pre-approve one so they can login immediately the first time they visit.
nb: Hvis du kjenner Facebook-brukernavnet til en person som ikke har konto i webtrees kan du forhåndsgodkjenne dem slik at de kan logge inn umiddelbart ved første besøk.

source: Import from your Facebook friends
nb: Importer fra dine Facebook-venner

source: Default individual
nb: Standardperson

source: Individual record
nb: Personoppføring

source: Role
nb: Rolle

source: Allow users to login with Facebook.
nb: Tillat brukere å logge inn med Facebook

source: Visitor
nb: Gjest

source: Member
nb: Medlem

source: Editor
nb: Redigerer

source: Manager
nb: Administrator

source: Settings saved
nb: Innstillingene er lagret

source: User %1$s linked to Facebook user %2$s
nb: Bruker %1$s koblet til Facebook bruker %2$s

source: The user could not be linked
nb: Brukeren kunne ikke kobles

source: User unlinked
nb: Kobling til bruker fjernet

source: The link could not be deleted
nb: Knytningen kunne ikke slettes

source: Pre-approved user "%s" added
nb: Forhåndsgodkjent bruker "%s" lagt til

source: Changes to pre-approved users saved
nb: Endring av forhåndsgodkjent bruker er lagret

source: Pre-approved user "%s" deleted
nb: Forhåndsgodkjent bruker "%s" er slettet

source: The pre-approved user "%s" could not be deleted
nb: Forhåndsgodkjent bruker "%s" kunne ikke slettes

source: Missing Facebook username
nb: Mangler Facebook brukernavn

source: User is already registered
nb: Bruker er allerede registrert

source: Facebook logins have not been setup by the administrator.
nb: Facbookinnlogging er ikke konfigurert av administrator

source: You must allow access to your Facebook account in order to login with Facebook.
nb: Du må gi tilgang til din Facebook-konto for å kunne logge inn med Facebook

source: An error occurred trying to log you in with Facebook.
nb: En feil oppsto når du forsøkte å logge inn med Facebook

source: This form has expired. Try again.
nb: Skjemaet har utløpt. Forsøk igjen

source: Your Facebook code is invalid. This can happen if you hit back in your browser after login or if Facebook logins have been setup incorrectly by the administrator.
nb: Facebook-koden din er ugyldig. Dette kan skje hvis du bruker tilbake-knappen i nettleseren etter innlogging eller hvis Facebookinnlogging er feil satt opp av administrator

source: Could not fetch your information from Facebook. Please try again.
nb: Kunne ikke hente informasjon fra Facebook. Vennligst forsøk igjen.

source: The state does not match. You may been tricked to load this page.
nb: Tilstanden matcher ikke. Kan kan ha bliltt lurt til å laste denne siden.

source: Users successfully imported from Facebook
nb: Vellykket import av brukere fra Facebook

source: You must <a href='%s'>login to the site via Facebook</a> in order to import friends from Facebook
nb: Du må <a href='%s'> logge inn med Facebook</a> for å kunne importere venner fra Facebook

source: Could not fetch your friends from Facebook.
nb: Kunne ikke hente vennene dine fra Facebook.

source: No friend data
nb: Ingen vennedata

source: Only verified Facebook accounts are authorized. Please verify your account on Facebook and then try again
nb: Kun bekreftede Facebook-konti er autorisert. Vennligst bekreft din konto på Facebook og forsøk igjen

source: This account has not been verified. Please check your email for a verification message.
nb: Denne kontoen er ikke bekreftet. Vennligst sjekk din epostkonto og se etter bekreftelse.

source: This account has not been approved. Please wait for an administrator to approve it.
nb: Denne kontoen er ikke godkjent enda. Vennligst vent på godkjennelse fra administrator.

source: The administrator has disabled registrations.
nb: Administratoren har slått av registreriinger.

source: There was an error verifying your account. Contact the site administrator if you are unable to access the site.
nb: Det oppsto en feil ved verifisering av din konto. Kontakt administratoren for nettstedet hvis du ikke kankomme inn på siden.

source: Unable to create your account. Please try again.
nb: Kunne ikke opprette kontoen. Vennligst forsøk igjen.

source: Back
nb: Tilbake

source: Find an individual
nb: Søk etter person

source: Login with Facebook
nb: Logg inn med Facebook
