Repository: fisharebest/webtrees
Catalog: modules_v3/blog/language/po files/*.po
Languages: de

source: View archive
de: Archiv ansehen

source: To reduce the height of the News block, the administrator has hidden some articles. You can reveal these hidden articles by clicking the <strong>View archive</strong> link.
de: Um die Höhe der News-Block zu reduzieren, hat der Administrator einige Artikel versteckt. Sie können diese versteckten Artikel enthüllen, indem Sie auf den Link <strong>Archiv ansehen</strong>.

source: Limit
de: Grenzwert

source: Enter the limiting value here. If you have opted to limit the News article display according to age, any article older than the number of days entered here will be hidden from view. If you have opted to limit the News article display by number, only the specified number of recent articles, ordered by age, will be shown. The remaining articles will be hidden from view. Zeros entered here will disable the limit, causing all News articles to be shown.
de: Geben Sie hier den Grenzwert. Wenn Sie entschieden haben, um die News-Artikel-Anzeige nach Alter zu begrenzen, werden alle Artikel, die älter sind als die Anzahl der Tage, die hier eingegebene im Verborgenen. Wenn Sie entschieden haben, um die News-Artikel-Anzeige nach der Anzahl zu begrenzen, wird nur die angegebene Anzahl von aktuelle Artikel, geordnet nach Alter angezeigt. Die übrigen Artikel werden ausgeblendet werden. Nullen, die hier eingegebene sperrt das Limit, verursachen alle News-Artikel angezeigt werden.

source: Limit display by
de: Limit-Anzeige von

source: You can limit the number of News articles displayed, thereby reducing the height of the GEDCOM News block.<br><br>This option determines whether any limits should be applied or whether the limit should be according to the age of the article or according to the number of articles.
de: Sie können die Anzahl der dargestellten Notizen beschränken, so dass der GEDCOM Neuigkeiten Block nicht zu hoch wird.<br><br>Diese Option bestimmt ob überhaupt Beschränkungen belegt sind, oder, ob diese Beschränkungen das Alter oder die Anzahl der Notizen berücksichtigen.

source: Add an article
de: Hinzufügen eines Artikels

source: Edit this article
de: Dieser Artikel bearbeiten

source: Delete this article
de: Löschen Sie in diesem Artikel

source: News and Journal
de: News und Journal

source: Site and personal journal
de: Website und persönliches Tagebuch

source: %%s using %s
de: %%s mit %s

source: There are no articles available
de: Es sind keine Artikel verfügbar

source: Hide archive
de: Archiv ausblenden

source: Article last modified
de: Artikel zuletzt
