<?php
$lang['L_HELP_DB']="Αυτή είναι μια λίστα με Β.Δεδομένων";
$lang['L_HELP_PRAEFIX']="Το πρόθεμα είναι ένα αλφαριθμητικό στην αρχή του ονόματος πίνακα, που λειτουργεί σαν φίλτρο.";
$lang['L_HELP_ZIP']="Συμπίεση με GZip - προτεινόμενη κατάσταση 'ενεργό'";
$lang['L_HELP_MEMORYLIMIT']="Το μέγιστο μέγεθος μνήμης σε Bytes για το script
0 = ανενεργό";
$lang['L_MEMORY_LIMIT']="Οριο μνήμης";
$lang['L_HELP_AD1']="Αν ενεργοποιηθεί, τα αντίγραφα ασφαλείας θα διαγράφονται αυτόματα.";
$lang['L_HELP_AD3']="Ο μέγιστος αριθμός των αρχείων αντιγράφων ασφαλείας (για αυτόματη διαγραφή)
0 = ανενεργό";
$lang['L_HELP_LANG']="επιλέξτε τη γλώσσα σας";
$lang['L_HELP_EMPTY_DB_BEFORE_RESTORE']="Για να εξαφανίσετε άχρηστα δεδομένα επιλέξτε το άδειασμα της Β.Δεδομένων πριν την επαναφορά";
$lang['L_HELP_CRONEXTENDER']="Η κατάληξη του Perl scripts, προεπιλογή είναι '.pl'";
$lang['L_HELP_CRONSAVEPATH']="Το όνομα του αρχείου ρύθμισης για το Perl script";
$lang['L_HELP_CRONPRINTOUT']="Αν απενεργοποιηθεί δε θα προβάλλεται έξοδος στην οθόνη.
Είναι ανεξάρτητο από την έξοδο στο αρχείο καταγραφών.";
$lang['L_HELP_CRONSAMEDB']="Χρήση ίδιας Β.Δεδομένων στο Cron job όπως ρυθμίστηκε στη Β.Δεδομένων?";
$lang['L_HELP_CRONDBINDEX']="επιλέξτε τη Β.Δεδομένων για το Cron job";
$lang['L_HELP_FTPTRANSFER']="αν είναι ενεργό, το αρχείο θα αποστέλεται με FTP.";
$lang['L_HELP_FTPSERVER']="Διεύθυνση του διακομιστή FTP";
$lang['L_HELP_FTPPORT']="Θύρα του διακομιστή FTP, προεπιλογή: 21";
$lang['L_HELP_FTPUSER']="Δώστε όνομα χρήστη για το FTP";
$lang['L_HELP_FTPPASS']="Δώστε κωδικό για το FTP";
$lang['L_HELP_FTPDIR']="Που βρίσκεται ο κατάλογος φόρτωσης? δώστε διαδρομή!";
$lang['L_HELP_SPEED']="Ελάχιστη και μέγιστη ταχύτητα, προεπιλογή είναι 50 εως 5000";
$lang['L_SPEED']="Ελεγχος ταχύτητας";
$lang['L_HELP_CRONEXECPATH']="Η τοποθεσία των Perl scripts.
 Σημείο εκκίνησης είναι η διεύθυνση HTTP (όπως η διευθύνσεις στον πλοηγό)
Επιτρεπόμενα είναι εισαγωγές απόλυτες ή σχετικές.";
$lang['L_CRON_EXECPATH']="Διαδρομή των Perl scripts";
$lang['L_HELP_CRONCOMPLETELOG']="Οταν ενεργοποιηθεί, η πλήρης έξοδος γράφεται στο complete_log-file.
Είναι ανεξάρτητο από την προβολή κειμένου";
$lang['L_HELP_FTP_MODE']="Οταν συμβούν προβλήματα κατά την μεταφορά μέσω FTP, δοκιμάστε τη χρήση passive mode.


";


?>