Repository: fisharebest/webtrees
Catalog: modules_v3/fancy_privacy_check/language/*.po
Languages: nl

source: <dt>Dead</dt><dd>Used when a person is clearly marked as dead by the inclusion of a death record with a date or date range.</dd>
nl: <dt>Overleden</dt><dd>Wanneer er een overlijdensdatum of -datumbereik bekend is, wordt een persoon als overleden aangemerkt.</dd>

source: <dt>Living</dt><dd>If there is no record of a death and no other related facts that imply death, then the person is assumed to be living.</dd>
nl: <dt>Levend</dt><dd>Wanneer er geen overlijdensrecord is aangemaakt en er geen andere factoren bekend zijn die impliceren dat de persoon is overleden, veronderstellen we dat de persoon nog leeft.</dd>

source: <dt>Presumed dead</dt><dd>This is set when a person either has a death recorded but with no date, or has no death record but <b>webtrees</b> has calculated that the person can reasonably be expected to be dead.</dd>
nl: <dt>Waarschijnlijk overleden</dt><dd>Deze omschrijving wordt gebruikt wanneer een persoon geen overlijdensrecord heeft of een overlijdensrecord zonder datum, maar <b>webtrees</b> heeft berekend dat we redelijkerwijs kunnen aannemen dat deze persoon is overleden.</dd>

source: <p>The age at which a person is assumed to be dead is set at %s years.</p>
nl: <p>De leeftijd waarop een persoon geacht wordt te zijn overleden is ingesteld op %s jaar.</p>

source: <p>There are three possible indicators of privacy status: Dead, Presumed dead, and Living.</p><p>If <u>either of the first two</u> are set, then the person will be displayed in accordance with the family tree and site privacy settings.</p>
nl: <p>Er zijn drie situaties mogelijk om de privacy status aan te geven: overleden, waarschijnlijk overleden en levend.</p><p>Als <u>één van de eerste twee situaties</u> van toepassing is, wordt de persoon getoond in overeenstemming met ingestelde privacy instellingen voor deze stamboom.</p>

source: A child with a birth date of %s suggests this person was born at least 15 years earlier than that.
nl: Een kind met een geboortedatum van %s geeft aan dat deze persoon tenminste 15 jaar eerder geboren is.

source: A grandchild with a birth date of %s suggests this person was born at least 30 years earlier than that.
nl: Een kleinkind met een geboortedatum van %s geeft aan dat deze persoon tenminste 30 jaar eerder geboren is.

source: A marriage with a date of %s suggests they were born at least 10 years earlier than that.
nl: Een huwelijk met een datum van %s geeft aan dat deze persoon tenminste 10 jaar eerder geboren is.

source: A parent with a birth date of %s is more than 45 years older than this person.
nl: Een ouder met een geboortedatum van %s is meer dan 45 jaar ouder dan deze persoon.

source: A sidebar tool to show the privacy status of an individual.
nl: Een zijpanneel dat de privacy status van een persoon toont.

source: A spouse with a date of %s is more than 40 years older than this person.
nl: Een partner met een geboortedatum van %s is meer dan 40 jaar ouder dan deze persoon.

source: An estimated death date has been calculated as %s
nl: De geschatte overlijdensdatum is: %s

source: An event occurred in this person's life more than %s years ago<br> %s
nl: Tijdens het leven van deze persoon vond een gebeurtenis meer dan %s jaar geleden plaats:<br> %s

source: Death is recorded with an unknown date.
nl: Het overlijden is geregistreerd met een onbekende datum.

source: Death recorded as %s
nl: Het overlijden is geregisteerd als: %s

source: Presumed dead
nl: Waarschijnlijk overleden
