Repository: fisharebest/webtrees
Catalog: modules_v3/justlight_theme_options/language/*.po
Languages: tr

source: <p>Click a row, then drag-and-drop to re-order the topmenu items. Then click the 'save' button.</p>
tr: <p>Satıra tıklayın, daha sonra topmenu ögelerini sürükleyip bırakarak yenıden sıralayın. Değişiklikleri kaydetmek için save/kaydet butonuna basın.</p>

source: <p>If this option is set the Media Menu will be moved to the topmenu. The names of first level media folders will appear as submenu of the new Media Menu.</p><p>Warning: these menu links are not translated automatically. If you want your menus to be translated you will have to do it manually with the instructions in the webrees WIKI.</p>
tr: <p>Bu seçenek seçilirse Medya menüsün üst menüye taşınacaktır. Birinci seviye medya klasörleri yeni Medya Menüsü nün alt menüsü olarak görünecek</p><p> Uyarı: Bu menü bağlantıları otomatik olarak tercüme edilmez. Eğer menüleri tercüme etmek istiyorsanız, webrees WIKI talimatlararı yardımıyla el ile yapmalısınız.</p>

source: <p>If you set this option the results on the media list page will include subfolders.</p>
tr: <p>Bu seçeneği seçtiğinizde medya listesi sayfasında alt klasörleri de listelenecek.</p>

source: <p>The default media folder will be used as link on the main media menu icon. If you click on this icon the medialist page for this folder appears.</p>
tr: <p>Medya menu ikonu link olarak varsayılan medya klasörü kullanılacaktır. Bu simgeye tıkladığınızda, bu klasör için medya listesi sayfası görünür.</p>

source: Choose a default media folder
tr: Varsayılan medya klasörü seçin

source: Choose a folder as default for the main menu link
tr: Ana menü bağlantısı için varsayılan olarak bir klasör seçin

source: Include the reports topmenu in the compact 'View' topmenu?
tr: Raporlar üst menüsünü 'Görünüm' üst menüsüne dahil et?

source: JustLight Theme Options
tr: JustLight Tema Seçenekleri

source: Media menu in topmenu
tr: Üst menüdeki medya menüsü

source: Options for the JustLight theme
tr: JustLight tema seçenekleri

source: Set options for the JustLight theme within the admin interface
tr: Yönetici arayüzü içinde JustLight tema seçeneklerini ayarlama

source: Sort Topmenu items
tr: Üst menü ögelerini sırala

source: Sorting the topmenu
tr: Üst menü sıralama

source: Subfolders
tr: Alt klasörler

source: The settings will be reset to default. Are you sure you want to do this?
tr: Varsayılan ayarlara dönmek istediğinizden eminmisiniz?

source: Use a compact menu?
tr: Kompakt menüyü kullan?
