Repository: fisharebest/webtrees
Catalog: modules_v3/wooc_singlepage_pedigree/language/*.po
Languages: pl

source: Pedigree - single page
pl: Rodowód jednostronicowy

source: Print a pedigree chart on a single page.
pl: Raport o przodkach danej osoby w formie jednostronicowego drzewa.

source: Compress
pl: Kompresja

source: full
pl: pełna

source: medium
pl: średnia

source: Show siblings
pl: Pokaż rodzeństwo

source: Show ID numbers next to names
pl: Pokaż identyfikatory obok nazwisk

source: see person %s
pl: zobacz osobę %s

source: See person
pl: Zobacz osobę

source: %1$s: %2$d Generation Pedigree Chart
pl: %1$s: %2$d-pokoleniowy diagram rodowy

source: Style of boxes
pl: Styl ramek

source: Normal
pl: Zwykłe

source: Enhanced
pl: Ozdobne

source: Line thickness
pl: Grubość linii

source: Show empty boxes
pl: Pokaż puste ramki
