Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Markdown is a simple system of formatting, used on websites such as Wikipedia. It uses unobtrusive punctuation characters to create headings and sub-headings, bold and italic text, lists, tables, etc.
cy: System syml o fformatio yw Markdown, sy'n cael ei ddefnyddio ar wefannau fel Wikipedia. Mae'n defnyddio nodau atalnodi anymwthiol i greu penawdau ac is-benawdau, testun trwm ac italig, rhestrau, tablau, ac ati.
hy: Markdown-ը ֆորմատավորման պարզ համակարգ է, որն օգտագործվում է այնպիսի կայքերում, ինչպիսին է Վիքիպեդիան։ Այն օգտագործում է աննկատ կետադրական նիշեր՝ վերնագրեր և ենթավերնագրեր, թավ և շեղ տեքստեր, ցուցակներ, աղյուսակներ և այլն ստեղծելու համար:
ko: Markdown은 Wikipedia와 같은 웹 사이트에서 사용되는 간단한 형식 지정 시스템입니다. 눈에 잘 띄지 않는 구두점 문자를 사용하여 제목과 부제목, 굵게 및 기울임꼴 텍스트, 목록, 표 등을 만듭니다.
ne: मार्कडाउन विकिपिडिया जस्ता वेबसाइटहरूमा प्रयोग गरिने ढाँचाको सरल प्रणाली हो। यसले शीर्षकहरू र उप-शीर्षकहरू, बोल्ड र इटालिक पाठ, सूचीहरू, तालिकाहरू, इत्यादि सिर्जना गर्न अबाधित विराम चिन्हहरू प्रयोग गर्दछ।
sl: Markdown je preprost sistem oblikovanja, ki ga uporabljajo spletišča, kot je Wikipedija. Uporablja nevsiljive ločilne znake za ustvarjanje naslovov in podnaslovov, krepkega in poševnega besedila, seznamov, tabel itd.

source: Allow users to see raw GEDCOM records
cy: Caniatáu i ddefnyddwyr weld cofnodion GEDCOM bras
hy: Թույլ տվեք օգտվողներին տեսնել չմշակված GEDCOM գրառումները
ko: 사용자가 raw GEDCOM 레코드를 볼 수 있도록 허용
ne: प्रयोगकर्ताहरूलाई कच्चा GEDCOM रेकर्डहरू हेर्न अनुमति दिनुहोस्
sl: Dovoli uporabnikom ogled neobdelanih zapisov GEDCOM

source: Setting this to <b>Yes</b> will place links on individuals, sources, and families to let users bring up another window containing the raw data taken right out of the GEDCOM file.
cy: Bydd gosod hyn i <b>Iawn</b> yn gosod dolenni ar unigolion, ffynonellau a theuluoedd i adael i ddefnyddwyr agor ffenestr arall sy'n cynnwys y data crai a gymerwyd o'r ffeil GEDCOM.
hy: Սահմանելով սա <b>Այո</b>-ը, հղումներ կտեղադրվեն անհատների, աղբյուրների և ընտանիքների վրա, որոնք թույլ կտան օգտատերերին բացել մեկ այլ պատուհան, որը պարունակում է անմիջապես GEDCOM ֆայլից վերցված չմշակված տվյալները:
ko: <b> 네 </b>로 설정하면 개인, 소스 및 가족이사용자가 취한 원시 데이터가 포함 된 다른 창을 가져올 수 있도록Gedcom 파일에서 바로 밖으로 나옵니다.
ne: यसलाई <b>हो</b> मा सेट गर्नाले प्रयोगकर्ताहरूलाई GEDCOM फाइलबाट सिधै लिइएको कच्चा डाटा समावेश गर्ने अर्को विन्डो ल्याउन अनुमति दिन व्यक्तिहरू, स्रोतहरू र परिवारहरूमा लिङ्कहरू राख्नेछ।
sl: Če to možnost nastavite na <b>Da</b>, bodo povezave do oseb, virov in družin nastavljene tako, da bodo uporabnikom omogočile dostop do novega okna s surovimi podatki, vzetimi neposredno iz datoteke GEDCOM.

source: Many genealogy programs create GEDCOM files with custom tags, and webtrees understands most of them. When unrecognized tags are found, this option lets you choose whether to ignore them or display a warning message.
cy: Mae llawer o raglenni achau yn creu ffeiliau GEDCOM gyda thagiau wedi'u teilwra, ac mae webtrees yn deall y rhan fwyaf ohonyn nhw. Pan mae'n darganfod tagiau heb eu adnabod, mae'r opsiwn hwn yn caniatáu i chi ddewis p'un ai i'w hanwybyddu neu ddangos neges rhybudd.
hy: Շատ ծագումնաբանական ծրագրեր ստեղծում են GEDCOM ֆայլեր հատուկ պիտակներով, և webtrees-ը հասկանում է դրանցից շատերը: Երբ հայտնաբերվում են չճանաչված պիտակներ, այս տարբերակը թույլ է տալիս ընտրել՝ անտեսե՞լ դրանք, թե՞ ցուցադրել նախազգուշական հաղորդագրություն:
ko: 많은 계보 프로그램은 사용자 정의 태그가 있는 GEDCOM 파일을 생성하고 웹트리는 대부분을 이해합니다. 인식할 수 없는 태그가 발견되면 이 옵션을 사용하여 태그를 무시할지 또는 경고 메시지를 표시할지 선택할 수 있습니다.
ne: धेरै वंशावली कार्यक्रमहरूले अनुकूलन ट्यागहरूका साथ GEDCOM फाइलहरू सिर्जना गर्दछ, र वेबट्रीहरूले तीमध्ये धेरैलाई बुझ्छन्। जब अपरिचित ट्यागहरू फेला पर्छन्, यो विकल्पले तपाईंलाई बेवास्ता गर्ने वा चेतावनी सन्देश प्रदर्शन गर्ने छनौट गर्न दिन्छ।
sl: Številni rodoslovni programi ustvarijo lastne oznake GEDCOM in webtrees jih lahko večino razume. Če webtrees naleti na neznano oznako, vam ta možnost omogoča, da napako zanemari, ali pa prikaže sporočilo z opozorilom.

source: Some pages can display the number of times that they have been visited.
cy: Gall rhai tudalennau ddangos y nifer o weithiau yr ymwelwyd â hwy.
hy: Որոշ էջեր կարող են ցույց տալ, թե քանի անգամ են այցելել:
ko: 일부 페이지는 방문한 횟수를 표시 할 수 있습니다.
ne: केही पृष्ठहरूले तिनीहरूले भ्रमण गरेको संख्या देखाउन सक्छ।
sl: Nekatere strani lahko prikažejo, kolikokrat so bile obiskane.

source: Edit preferences
cy: Golygu dewisiadau
hy: Խմբագրել նախապատվությունները
ko: 환경설정 편집
ne: प्राथमिकताहरू सम्पादन गर्नुहोस्
sl: Uredi nastavitve

source: Facts for individual records
cy: Ffeithiau ar gyfer cofnodion unigol
hy: Փաստեր անհատական գրառումների համար
ko: 인물 기록에 대한 정보
ne: व्यक्तिगत रेकर्डका लागि तथ्यहरू
sl: Dejstva za osebne zapise

source: Facts for new individuals
cy: Ffeithiau ar gyfer unigolion newydd
hy: Փաստեր նոր անհատների համար
ko: 새로운 인물에 대한 정보
ne: नयाँ व्यक्तिहरूको लागि तथ्य
sl: Dejstva za nove osebe

source: Quick individual facts
cy: Ffeithiau unigolion cyflym
hy: Արագ անհատական փաստեր
ko: 빠른 인물 정보
ne: द्रुत व्यक्तिगत तथ्यहरू
sl: Hitra dejstva o osebi

source: The most common individual facts and events are listed separately, so that they can be added more easily.
cy: Mae'r ffeithiau a'r digwyddiadau unigol mwyaf cyffredin yn cael eu rhestru ar wahân, fel y mae modd eu hychwanegu'n haws.
hy: Ամենատարածված անհատական փաստերն ու իրադարձությունները թվարկված են առանձին, որպեսզի դրանք ավելի հեշտ ավելացվեն:
ko: 가장 일반적인 개별 정보와 이벤트는 별도로 나열되므로 더 쉽게 추가 할 수 있습니다.
ne: सबैभन्दा सामान्य व्यक्तिगत तथ्य र घटनाहरू अलग सूचीबद्ध छन्, ताकि तिनीहरू थप सजिलै थप्न सकिन्छ।
sl: Najpogostejša osebna dejstva in dogodki so navedeni ločeno, da jih je lažje dodati.

source: Facts for family records
cy: Ffeithiau ar gyfer cofnodion teulu
hy: Փաստեր ընտանեկան գրառումների համար
ko: 가족 기록에 대한 정보
ne: पारिवारिक अभिलेखका लागि तथ्यहरू
sl: Dejstva za družinske zapise

source: Facts for new families
cy: Ffeithiau ar gyfer teuluoedd newydd
hy: Փաստեր նորաստեղծ ընտանիքների համար
ko: 새로운 가족들에 대한 정보
ne: नयाँ परिवारका लागि तथ्यहरू
sl: Dejstva za nove družine

source: Quick family facts
cy: Ffeithiau teulu cyflym
hy: Արագ ընտանեկան փաստեր
ko: 빠른 가족 정보
ne: द्रुत पारिवारिक तथ्यहरू
sl: Hitra dejstva o družini

source: The most common family facts and events are listed separately, so that they can be added more easily.
cy: Mae'r ffeithiau a'r digwyddiadau teuluol mwyaf cyffredin yn cael eu rhestru ar wahân, fel bod modd eu hychwanegu'n haws.
hy: Ամենատարածված ընտանեկան փաստերն ու իրադարձությունները թվարկված են առանձին, որպեսզի դրանք ավելի հեշտ ավելացվեն:
ko: 가장 일반적인 가족 정보와 이벤트는 별도로 나열되므로 더 쉽게 추가 할 수 있습니다.
ne: सबै भन्दा साधारण पारिवारिक तथ्य र घटनाहरू अलग सूचीबद्ध छन्, ताकि तिनीहरूलाई थप सजिलै थप्न सकिन्छ।
sl: Najpogostejša družinska dejstva in dogodki so navedeni ločeno, da jih je lažje dodati.

source: Other preferences
cy: Dewisiadau eraill
hy: Այլ նախասիրություններ
ko: 기타 환경설정
ne: अन्य प्राथमिकताहरू
sl: Druge nastavitve

source: Surname tradition
cy: Traddodiad cyfenwau
hy: Ազգանունի ավանդույթ
ko: 가문이름 전통
ne: उपनाम परम्परा
sl: Tradicija priimka

source: When you add a new family member, a default surname can be provided. This surname will depend on the local tradition.
cy: Pan fyddwch yn ychwanegu aelod newydd o'r teulu, y mae modd darparu cyfenw rhagosodedig. Bydd y cyfenw hwn yn dibynnu ar y traddodiad lleol.
hy: Երբ դուք ավելացնում եք ընտանիքի նոր անդամ, կարող է տրվել կանխադրված ազգանուն: Այս ազգանունը կախված կլինի տեղական ավանդույթից։
ko: 새 가족 구성원을 추가 할 때 기본 가문이름을 제공 할 수 있습니다. 이 가문이름은 지역 전통에 따라 다릅니다.
ne: तपाईंले परिवारको नयाँ सदस्य थप्दा, पूर्वनिर्धारित उपनाम प्रदान गर्न सकिन्छ। यो उपनाम स्थानीय परम्परा मा निर्भर हुनेछ।
sl: Ko dodate novega družinskega člana, lahko določite privzeti priimek. Ta priimek bo odvisen od lokalne tradicije.

source: Keep the existing “last change” information
cy: Cadw'r wybodaeth “newid diwethaf” bresennol
hy: Պահպանեք գոյություն ունեցող «վերջին փոփոխության» տեղեկատվությունը
ko: 기존 "마지막 변경" 정보 유지
ne: अवस्थित "अन्तिम परिवर्तन" जानकारी राख्नुहोस्
sl: Obdrži obstoječi podatek o “zadnji spremembi”

source: When a record is edited, the user and timestamp are recorded. Sometimes it is desirable to keep the existing “last change” information, for example when making minor corrections to someone else’s data. This option controls whether this feature is selected by default.
cy: Pan fydd cofnod yn cael ei olygu, mae'r defnyddiwr a'r stamp amser yn cael ei gofnodi. Weithiau mae'n ddymunol cadw'r wybodaeth “newid olaf” bresennol, er enghraifft wrth wneud mân gywiriadau i ddata rhywun arall. Mae'r opsiwn hwn yn rheoli a yw'r nodwedd hon yn cael ei dewis fel rhagosodiad.
hy: Երբ գրառումը խմբագրվում է, օգտագործողը և ժամադրոշմը գրանցվում են: Երբեմն ցանկալի է պահպանել գոյություն ունեցող «վերջին փոփոխության» տեղեկատվությունը, օրինակ՝ ուրիշի տվյալների աննշան ուղղումներ կատարելիս: Այս ընտրանքը վերահսկում է, թե արդյոք այս ֆունկցիան ընտրված է լռելյայնորեն:
ko: 레코드가 편집되면 사용자 및 타임 스탬프가 기록됩니다. 예를 들어 다른 사람의 데이터를 약간 수정하는 경우와 같이 기존의 “마지막 변경”정보를 유지하는 것이 바람직 할 수 있습니다. 이 옵션은이 기능이 기본적으로 선택되는지 여부를 제어합니다.
ne: जब रेकर्ड सम्पादन गरिन्छ, प्रयोगकर्ता र टाइमस्ट्याम्प रेकर्ड गरिन्छ। कहिलेकाहीँ यो अवस्थित "अन्तिम परिवर्तन" जानकारी राख्न वांछनीय छ, उदाहरणका लागि अरू कसैको डेटामा सानो सुधार गर्दा। यो विकल्पले यो सुविधालाई पूर्वनिर्धारित रूपमा चयन गरेको छ कि छैन नियन्त्रण गर्छ।
sl: Ko je zapis urejen, se zabeležita uporabnik in časovni žig. Včasih je zaželeno ohraniti obstoječe podatke o “zadnji spremembi”, na primer pri manjših popravkih podatkov nekoga drugega. Ta možnost nadzoruje, ali je ta funkcija privzeto izbrana.

source: Apply these preferences to all family trees
cy: Gosod y dewisiadau hyn i bob cart achau
hy: Կիրառեք այս նախապատվությունները բոլոր տոհմածառերին
ko: 이 환경설정을 모든 가계도에 적용
ne: यी प्राथमिकताहरू सबै पारिवारिक वृक्षहरूमा लागू गर्नुहोस्
sl: Uporabi nastavitve za vsa družinska drevesa

source: Apply these preferences to new family trees
cy: Gosod y dewisiadau hyn i gartiau achau newydd
hy: Կիրառեք այս նախապատվությունները նոր տոհմածառերի վրա
ko: 이 환경설정을 모든 가계도에 적용
ne: नयाँ पारिवारिक वृक्षहरूमा यी प्राथमिकताहरू लागू गर्नुहोस्
sl: Uporabi nastavitve za nova družinska drevesa

source: Show the family tree
cy: Dangos y cart achau
hy: Ցույց տալ տոհմածառը
ko: 가계도 표시
ne: वंशवृक्ष देखाउनुहोस्
sl: Prikaži družinsko drevo

source: visitors
cy: ymwelwyr
hy: այցելուներ
ko: 방문자
ne: आगन्तुकहरू
sl: obiskovalci

source: members
cy: aelodau
hy: անդամներ
ko: 회원
sl: člani

source: Enabling this option will force all visitors to sign in before they can view any data on the website.
cy: Bydd galluogi'r opsiwn hwn yn gorfodi pob ymwelydd i fewngofnodi cyn y gallan nhw weld unrhyw ddata ar y wefan.
hy: Այս ընտրանքի ակտիվացումը բոլոր այցելուներին կստիպի մուտք գործել՝ նախքան կայքի որևէ տվյալ դիտելը:
ko: 이 옵션을 활성화하면 모든 방문자가 웹사이트에서 데이터를 표시 하기전에 로그인해야 합니다.
ne: यो विकल्प सक्षम गर्नाले सबै आगन्तुकहरूलाई वेबसाइटमा कुनै पनि डेटा हेर्न सक्नु अघि साइन इन गर्न बाध्य पार्छ।
sl: Omogočanje te možnosti bo prisililo vse obiskovalce, da se prijavijo, preden bodo lahko dostopali do podatkov na spletišču.

source: Show dead individuals
cy: Dangos unigolion marw
hy: Ցույց տալ մահացած անձանց
ko: 사망한 인물 표시
ne: मृत व्यक्तिहरू देखाउनुहोस्
sl: Prikaži mrtve osebe

source: Set the privacy access level for all dead individuals.
cy: Gosod y lefel mynediad preifatrwydd ar gyfer pob unigolyn marw.
hy: Սահմանեք գաղտնիության հասանելիության մակարդակը բոլոր մահացած անձանց համար:
ko: 모든 사망한 인물의 개인 정보 보호 액세스 수준을 설정하십시오.
ne: सबै मृत व्यक्तिहरूको लागि गोपनीयता पहुँच स्तर सेट गर्नुहोस्।
sl: Nastavi raven dostopa zasebnosti za vse mrtve osebe.

source: Age at which to assume an individual is dead
cy: Oed i dybio bod unigolyn yn farw
hy: Տարիքը, երբ կարելի է ենթադրել, որ անհատը մահացել է
ko: 사망 한 것으로 추정되는 연령
ne: एक व्यक्तिको मृत्यु भएको मान्ने उमेर
sl: Starost pri kateri lahko predvidevamo, da je oseba mrtva

source: If this individual has any events other than death, burial, or cremation more recent than this number of years, they are considered to be “alive”. Children’s birth dates are considered to be such events for this purpose.
cy: Os oes gan yr unigolyn hwn unrhyw ddigwyddiadau heblaw marwolaeth, claddu neu amlosgiad yn fwy diweddar na'r nifer hon o flynyddoedd, maen nhw'n cael eu hystyried yn “fyw”. Mae dyddiadau geni plant yn cael eu hystyried yn ddigwyddiadau o'r fath at y diben hwn.
hy: Եթե այս անձը մահից, թաղումից կամ դիակիզումից բացի այլ իրադարձություններ ունի այս թվից ավելի վերջին, ապա նա համարվում է «կենդանի»: Այդ նպատակով երեխաների ծննդյան տարեթվերը համարվում են նման իրադարձություններ:
ko: 이 인물이 이 년 수보다 최근에 사망, 매장 또는 화장 이외의 다른 사건이 있는 경우 "살아 있는" 것으로 간주됩니다. 이러한 목적을 위해 자녀들의 생일은 그러한 이벤트로 간주됩니다.
ne: यदि यो व्यक्तिको मृत्यु, दफन, वा दाहसंस्कार बाहेक अन्य कुनै घटनाहरू छन् भने यो संख्या भन्दा धेरै वर्षहरू छन्, तिनीहरूलाई "जीवित" मानिन्छ। बालबालिकाको जन्म मितिलाई यस उद्देश्यका लागि यस्ता घटनाहरू मानिन्छ।
sl: Če je pri tej osebi prišlo do kakršnih koli drugih dogodkov, razen smrti, pokopa ali upepelitve, ki so bili pred tem številom let, se šteje, da je “živa”. Za ta namen se kot taki dogodki štejejo datumi rojstva otrok.

source: Show living individuals
cy: Dangos unigolion byw
hy: Ցույց տալ կենդանի անհատներին
ko: 살아있는 인물 표시
ne: बाँचिरहेका व्यक्तिहरू देखाउनुहोस्
sl: Prikaži žive osebe

source: If you show living individuals to visitors, all other privacy restrictions are ignored. Do this only if all the data in your tree is public.
cy: Os ydych chi'n dangos unigolion byw i ymwelwyr, bydd yr holl gyfyngiadau preifatrwydd eraill yn cael eu hanwybyddu. Gwnewch hyn dim ond os yw'r holl ddata yn eich cart achau'n gyhoeddus.
hy: Եթե այցելուներին ցույց եք տալիս կենդանի անհատներին, գաղտնիության մնացած բոլոր սահմանափակումներն անտեսվում են: Դա արեք միայն այն դեպքում, եթե ձեր ծառի բոլոր տվյալները հրապարակային են:
ko: 방문자에게 살아있는 인물을 표시하는 경우 다른 모든 개인 정보 제한은 무시됩니다. 가계도의 모든 데이터가 공개된 경우에만 이 작업을 수행하십시오.
ne: यदि तपाइँ आगन्तुकहरूलाई जीवित व्यक्तिहरू देखाउनुहुन्छ भने, अन्य सबै गोपनीयता प्रतिबन्धहरूलाई बेवास्ता गरिन्छ। यदि तपाइँको रूख मा सबै डाटा सार्वजनिक छ भने मात्र यो गर्नुहोस्।
sl: Če obiskovalcem pokažete žive osebe, se vse druge omejitve zasebnosti prezrejo. To storite le, če so vsi podatki v vašem drevesu javni.

source: Extend privacy to dead individuals
cy: Estyn preifatrwydd i unigolion marw
hy: Ընդլայնել գաղտնիությունը մահացած անձանց վրա
ko: 사생활 보호를 죽은 인물까지 확대
ne: मृत व्यक्तिहरूलाई गोपनीयता विस्तार गर्नुहोस्
sl: Razširi zasebnost na pokojne osebe

source: born in the last %1$s years or died in the last %2$s years
cy: a anwyd yn ystod y %1$s mlynedd diwethaf neu a fu farw yn ystod y %2$s blynedd diwethaf
hy: ծնվել է վերջին %1$s տարում կամ մահացել վերջին %2$s տարում
ko: 지난 %1$s년에 출생 또는 지난 %2$s년에 사망
ne: पछिल्लो %1$s वर्षमा जन्मेको वा पछिल्लो %2$s वर्षमा मृत्यु भएको
sl: Rojeni v zadnjih %1$s letih ali umrli v zadnjih %2$s letih

source: In some countries, privacy laws apply not only to living individuals, but also to those who have died recently. This option will allow you to extend the privacy rules for living individuals to those who were born or died within a specified number of years. Leave these values empty to disable this feature.
cy: Mewn rhai gwledydd, mae deddfau preifatrwydd yn berthnasol nid yn unig i unigolion byw, ond hefyd i'r rhai sydd wedi marw yn ddiweddar. Bydd yr opsiwn hwn yn caniatáu i chi ymestyn y rheolau preifatrwydd ar gyfer unigolion byw i'r rhai a anwyd neu a fu farw o fewn nifer benodol o flynyddoedd. Gadewch y gwerthoedd hyn yn wag i analluogi'r nodwedd hon.
hy: Որոշ երկրներում գաղտնիության մասին օրենքները կիրառվում են ոչ միայն կենդանի անհատների, այլև վերջերս մահացածների նկատմամբ: Այս տարբերակը թույլ կտա ձեզ ընդլայնել կենդանի անհատների գաղտնիության կանոնները նրանց վրա, ովքեր ծնվել կամ մահացել են որոշակի տարիների ընթացքում: Թողեք այս արժեքները դատարկ՝ այս գործառույթն անջատելու համար:
ko: 일부 국가에서는 개인정보 보호법이 살아있는 개인뿐만 아니라 최근에 사망한 개인에게도 적용됩니다. 이 옵션을 사용하면 살아있는 개인에 대한 개인 정보 보호 규칙을 지정된 년 내에 태어나거나 사망한 사람들까지 확장할 수 있습니다. 이 기능을 비활성화하려면 이 값을 비워 둡니다.
ne: केही देशहरूमा, गोपनीयता कानून जीवित व्यक्तिहरूमा मात्र लागू हुँदैन, तर हालै मरेकाहरूलाई पनि लागू हुन्छ। यो विकल्पले तपाईंलाई जीवित व्यक्तिहरूको लागि गोपनीयता नियमहरू विस्तार गर्न अनुमति दिनेछ जो निर्दिष्ट वर्षहरूमा जन्मेका वा मरेका थिए। यो सुविधा असक्षम गर्न यी मानहरू खाली छोड्नुहोस्।
sl: V nekaterih državah zakoni o zasebnosti ne veljajo le za žive osebe, temveč tudi za tiste, ki so nedavno umrle. Ta možnost vam omogoča, da pravila o zasebnosti za žive osebe razširite tudi na tiste, ki so se rodile ali umrle v določenem številu let. Če želite to funkcijo onemogočiti, pustite te vrednosti prazne.

source: Show names of private individuals
cy: Dangos enwau unigolion preifat
hy: Ցույց տալ մասնավոր անձանց անունները
ko: 개인정보보호 인물의 이름 표시
ne: प्राइभेट व्यक्तिहरूको नाम देखाउनुहोस्
sl: Prikaži imena zasebnih oseb

source: managers
cy: rheolwyr
hy: մենեջերներ
ko: 관리자
sl: upravitelji

source: This option will show the names (but no other details) of private individuals. Individuals are private if they are still alive or if a privacy restriction has been added to their individual record. To hide a specific name, add a privacy restriction to that name record.
cy: Bydd yr opsiwn hwn yn dangos enwau (ond dim manylion eraill) unigolion preifat. Mae unigolion yn breifat os ydyn nhw'n dal yn fyw neu os yw cyfyngiad preifatrwydd wedi'i ychwanegu at eu cofnod unigol. I guddio enw penodol, ychwanegwch gyfyngiad preifatrwydd at y cofnod enw hwnnw.
hy: Այս տարբերակը ցույց կտա մասնավոր անձանց անունները (բայց ոչ այլ մանրամասներ): Անհատները մասնավոր են, եթե նրանք դեռ ողջ են կամ եթե գաղտնիության սահմանափակում է ավելացվել նրանց անհատական գրառումներին: Կոնկրետ անունը թաքցնելու համար ավելացրեք գաղտնիության սահմանափակում այդ անվանագրում:
ko: 이 옵션은 인물의 이름 (다른 세부 사항은 아님)을 표시합니다. 인물이 아직 살아 있거나 개인 기록에 개인 정보 제한이 추가 된 경우의 인물입니다. 특정 이름을 숨기려면 해당 이름 레코드에 개인 정보 제한을 추가하십시오.
ne: यो विकल्पले निजी व्यक्तिहरूको नाम (तर कुनै अन्य विवरणहरू) देखाउनेछ। व्यक्तिहरू निजी हुन्छन् यदि तिनीहरू अझै जीवित छन् वा यदि तिनीहरूको व्यक्तिगत रेकर्डमा गोपनीयता प्रतिबन्ध थपिएको छ भने। कुनै खास नाम लुकाउन, त्यो नाम रेकर्डमा गोपनीयता प्रतिबन्ध थप्नुहोस्।
sl: Ta možnost bo prikazala imena (vendar ne drugih podrobnosti) zasebnih oseb. Osebe so zasebne, če so še žive ali če je bila njihovemu osebnemu zapisu dodana omejitev zasebnosti. Če želite skriti določeno ime, dodajte omejitev zasebnosti temu zapisu imena.

source: Show private relationships
cy: Dangos perthnasoedd preifat
hy: Ցույց տալ անձնական հարաբերությունները
ko: 사적인 관계 표시
ne: व्यक्तिगत सम्बन्धहरू देखाउनुहोस्
sl: Prikaži zasebna sorodstvena razmerja

source: This option will retain family links in private records. This means that you will see empty “private” boxes on the pedigree chart and on other charts with private individuals.
cy: Bydd yr opsiwn hwn yn cadw cysylltiadau teuluol mewn cofnodion preifat. Mae hyn yn golygu y byddwch yn gweld blychau “preifat” gwag ar y siart tras ac ar siartiau eraill gydag unigolion preifat.
hy: Այս տարբերակը կպահի ընտանեկան կապերը մասնավոր գրառումներում: Սա նշանակում է, որ դուք կտեսնեք դատարկ «մասնավոր» տուփեր տոհմային աղյուսակում և այլ գծապատկերներում մասնավոր անձանց հետ:
ko: 이 옵션은 가족 기록을 개인 기록으로 유지합니다. 이는 가계도 및 인물이 있는 다른 차트에 빈 “비공개”상자가 표시됨을 의미합니다.
ne: यो विकल्पले निजी रेकर्डहरूमा पारिवारिक लिङ्कहरू राख्नेछ। यसको मतलब तपाईंले पेडिग्री चार्टमा र निजी व्यक्तिहरूसँग अन्य चार्टहरूमा खाली "निजी" बाकसहरू देख्नुहुनेछ।
sl: Ta možnost bo ohranila družinske povezave v zasebnih zapisih. To pomeni, da boste na rodovniku in drugih diagramih z zasebnimi osebami videli prazna “zasebna” polja.

source: Privacy restrictions
cy: Cyfyngiadau preifatrwydd
hy: Գաղտնիության սահմանափակումներ
ko: 개인 정보 보호 제한 사항
ne: गोपनीयता प्रतिबन्धहरू
sl: Omejitve zasebnosti

source: You can set the access for a specific record, fact, or event by adding a restriction to it. If a record, fact, or event does not have a restriction, the following default restrictions will be used.
cy: Gallwch osod y mynediad ar gyfer cofnod, ffaith neu ddigwyddiad penodol trwy ychwanegu cyfyngiad ato. Os nad oes cyfyngiad ar gofnod, ffaith, neu ddigwyddiad, bydd y cyfyngiadau rhagosodedig canlynol yn cael eu defnyddio.
hy: Դուք կարող եք սահմանել մուտքը որոշակի ռեկորդի, փաստի կամ իրադարձության համար՝ դրան սահմանափակում ավելացնելով: Եթե գրառումը, փաստը կամ իրադարձությունը սահմանափակում չունենա, կօգտագործվեն հետևյալ լռելյայն սահմանափակումները:
ko: 제한을 추가하여 특정 레코드, 정보 또는 이벤트에 대한 액세스를 설정할 수 있습니다. 레코드, 정보 또는 이벤트에 제한이 없는 경우 다음 기본 제한이 사용됩니다.
ne: तपाइँ कुनै विशेष रेकर्ड, तथ्य वा घटनाको लागि यसमा प्रतिबन्ध थपेर पहुँच सेट गर्न सक्नुहुन्छ। यदि रेकर्ड, तथ्य वा घटनामा प्रतिबन्ध छैन भने, निम्न पूर्वनिर्धारित प्रतिबन्धहरू प्रयोग गरिनेछन्।
sl: Dostop do določenega zapisa, dejstva ali dogodka lahko nastavite tako, da mu dodate omejitev. Če zapis, dejstvo ali dogodek nima omejitve, bodo uporabljene naslednje privzete omejitve.

source: All records
cy: Pob cofnod
hy: Բոլոր գրառումները
ko: 모든 레코드
ne: सबै रेकर्डहरू
sl: Vsi zapisi

source: Privacy restrictions - these apply to records and facts that do not contain a GEDCOM RESN tag
cy: Cyfyngiadau preifatrwydd - mae'r rhain yn berthnasol i gofnodion a ffeithiau nad ydynt yn cynnwys tag GEDCOM RESN
hy: Գաղտնիության սահմանափակումներ. դրանք վերաբերում են գրառումներին և փաստերին, որոնք չեն պարունակում GEDCOM RESN պիտակ
ko: 개인정보 보호정책 - GEDCOM RESN 태그가 포함되지 않은 기록 및 사실에 적용됩니다
ne: गोपनीयता प्रतिबन्धहरू - यी रेकर्डहरू र तथ्यहरूमा लागू हुन्छन् जसमा GEDCOM RESN ट्याग समावेश छैन
sl: Omejitve zasebnosti - nanašajo se na zapise in dejstva, ki ne vsebujejo oznake GEDCOM RESN

source: Fact or event
cy: Ffaith neu ddigwyddiad
hy: Փաստ կամ իրադարձություն
ko: 정보 또는 이벤트
ne: तथ्य वा घटना
sl: Dejstvo ali dogodek

source: add
cy: ychwanegu
hy: ավելացնել
ko: 추가
ne: थप्नुहोस्
sl: Dodaj

source: This record does not exist.
cy: Nid yw'r cofnod hwn yn bodoli.
hy: Այս գրառումը գոյություն չունի։
ko: 존재하지 않는 레코드입니다.
ne: यो रेकर्ड अवस्थित छैन।
sl: Ta zapis ne obstaja.

source: You can renumber the records in a family tree, so that these internal reference numbers are not duplicated in any other family tree.
cy: Gallwch ail-rifo'r cofnodion mewn cart achau, fel nad yw'r cyfeirnodau mewnol hyn yn cael eu dyblygu mewn unrhyw gart achau arall.
hy: Դուք կարող եք վերահամարակալել տոհմածառի գրառումները, որպեսզի այս ներքին հղման համարները չկրկնվեն որևէ այլ տոհմածառում:
ko: 가계도에서 레코드의 번호를 다시 매길 수 있으므로 이러한 내부 참조 번호가 다른 가계도에서 중복되지 않습니다.
ne: तपाईंले पारिवारिक रूखमा रेकर्डहरू पुन: नम्बर गर्न सक्नुहुन्छ, ताकि यी आन्तरिक सन्दर्भ नम्बरहरू कुनै अन्य पारिवारिक रूखमा नक्कल नहोस्।
sl: Zapise v družinskem drevesu lahko preštevilčite tako, da se notranje referenčne številke ne podvojijo v nobenem drugem družinskem drevesu.

source: This family tree has %s record which uses the same “XREF” as another family tree.
cy: Mae gan y cart achau hwn %s gofnod sy'n defnyddio'r un "XREF" â chart achau arall.
hy: Այս տոհմածառն ունի %s գրառում, որն օգտագործում է նույն «XREF»-ը որպես մեկ այլ տոհմածառ:
ko: 이 가계도에는 다른 가계도와 동일한 “XREF”를 사용하는 %s 레코드가 있습니다.
ne: यो पारिवारिक रूखसँग %s रेकर्ड छ जसले अर्को पारिवारिक रूखको रूपमा उही "XREF" प्रयोग गर्दछ।
sl: To družinsko drevo ima %s zapis, ki uporablja isti “XREF” kot drugo družinsko drevo.

source: You can renumber this family tree.
cy: Gallwch ail-rifo'r cart achau hwn.
hy: Դուք կարող եք վերահամարակալել այս տոհմածառը:
ko: 이 가계도의 번호를 다시 지정할 수 있습니다.
ne: तपाईं यो परिवार रूख पुन: नम्बर गर्न सक्नुहुन्छ।
sl: To družinsko drevo lahko preštevilčite.

source: Include associates
cy: Cynnwys gymdeithion
hy: Ներառեք գործընկերներին
ko: 동료 포함
ne: सहयोगीहरू समावेश गर्नुहोस्
sl: Vključi sodelavce

source: Include aliases
cy: Cynnwys enwau eraill
hy: Ներառեք փոխանունները
ko: 별칭 포함
ne: उपनामहरू समावेश गर्नुहोस्
sl: Vključi vzdevke

source: update
cy: diweddaru
hy: թարմացնել
ko: 업데이트
ne: अपडेट
sl: Posodobi
