Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

# father’s parent’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 증조부모/진증조부모
sl: pradedek/prababica

# father’s parent’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조부/대고모/진외종조부/진외존이모
sl: prastric/prateta

# father’s parent’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 대고모/진외존이모
sl: prateta

# father’s sister’s child
source: first cousin
cy: cefnder/cyfnither cyntaf
hy: առաջին զարմիկ
ko: 고종형제자매(고종사촌)
ne: पहिलो कजिन
sl: bratranec/sestrična

# father’s sister’s daughter
source: first cousin
cy: cyfnither gyntaf
hy: առաջին զարմիկ
ko: 고종자매(고종사촌)
ne: पहिलो कजिन
sl: sestrična

# father’s sister’s husband
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 고모부
sl: stric

# father’s sister’s son
source: first cousin
cy: cefnder cyntaf
hy: առաջին զարմիկ
ko: 고종형제(고종사촌)
ne: पहिलो कजिन
sl: bratranec

# father’s wife’s child
source: step-sibling
cy: llys-frawd neu llys-chwaer
hy: խորթ եղբայր
sl: polbrat/polsestra

# father’s wife’s daughter
source: step-sister
cy: llys-chwaer
hy: խորթ քույր
sl: polsestra

# father’s wife’s son
source: step-brother
cy: llys-frawd
hy: խորթ եղբայր
sl: polbrat

# husband’s brother’s wife
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 동서
sl: svakinja

# husband’s sister’s husband
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 시매부( 媤妹夫)
ne: ज्वाइँ
sl: svak

# husband’s sibling’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 시조카-시질(媤姪)/시질녀(媤姪女)/시생질(媤甥姪)/시생질녀(媤甥姪女)
sl: nečak/nečakinja

# husband’s sister’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 시조카-시생질(媤甥姪)/시생질녀(媤甥姪女)
sl: nečak/nečakinja

# husband’s brother’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 시조카-시질(媤姪)/시질녀(媤姪女)
sl: nečak/nečakinja

# husband’s sibling’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 시조카-시질녀(媤姪女)/시생질녀(媤甥姪女)
sl: nečakinja

# husband’s sister’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 시조카-시생질녀(媤甥姪女)
sl: nečakinja

# husband’s brother’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 시조카-시질녀(媤姪女)
sl: nečakinja

# husband’s sibling’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 시조카-질/생질
sl: nečak

# husband’s sister’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 시조카-시생질
sl: nečak

# husband’s brother’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 시조카- 시질(媤姪)
sl: nečak

# mother’s brother’s child
source: first cousin
cy: cefnder/cyfnither cyntaf
hy: առաջին զարմիկ
ko: 외종형제자매(외사촌)
ne: पहिलो कजिन
sl: bratranec/sestrična

# mother’s brother’s daughter
source: first cousin
cy: cyfnither gyntaf
hy: առաջին զարմիկ
ko: 외종자매(외사촌)
ne: पहिलो कजिन
sl: sestrična

# mother’s brother’s son
source: first cousin
cy: cefnder cyntaf
hy: առաջին զարմիկ
ko: 외종형제(외사촌)
ne: पहिलो कजिन
sl: bratranec

# mother’s brother’s wife
source: aunt
cy: modryb
hy: մորաքույր
ko: 외숙모
ne: माइजु
sl: teta

# mother’s father’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외종조부
sl: prastric

# mother’s father’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 외증조부
sl: pradedek

# mother’s father’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 외증조모
sl: prababica

# mother’s father’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 외증조부모
sl: pradedek/prababica

# mother’s father’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 외종조/외존고모
sl: prastric/prateta

# mother’s father’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외존고모
sl: prateta

# mother’s husband’s child
source: step-sibling
cy: llys-frawd neu llys-chwaer
hy: խորթ եղբայր
sl: polbrat/polsestra

# mother’s husband’s daughter
source: step-sister
cy: llys-chwaer
hy: խորթ քույր
sl: polsestra

# mother’s husband’s son
source: step-brother
cy: llys-frawd
hy: խորթ եղբայր
sl: polbrat

# mother’s mother’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외외종조부
sl: prastric

# mother’s mother’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 외외증조부
sl: pradedek

# mother’s mother’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 외외증조모
sl: prababica

# mother’s mother’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 외외증조부모
sl: pradedek/prababica

# mother’s mother’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 외외종조부/외외존이모
sl: prastric/prateta

# mother’s mother’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외외존이모
sl: prateta

# mother’s parent’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외종조부/외외종조부
sl: prastric

# mother’s parent’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 외증조부/외외증조부
sl: pradedek

# mother’s parent’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 외증조모/외외증조모
sl: prababica

# mother’s parent’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 외증조부모/외외증조부모
sl: pradedek/prababica

# mother’s parent’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조부/진외존고모/외외종조부/외외존이모
sl: prastric/prateta

# mother’s parent’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외존고모/외외존이모
sl: prateta

# mother’s sister’s child
source: first cousin
cy: cefnder/cyfnither cyntaf
hy: առաջին զարմիկ
ko: 이종형제자매(이종사촌)
ne: पहिलो कजिन
sl: bratranec/sestrična

# mother’s sister’s daughter
source: first cousin
cy: cyfnither gyntaf
hy: առաջին զարմիկ
ko: 이종자매(이종사촌)
ne: पहिलो कजिन
sl: sestrična

# mother’s sister’s husband
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 이모부
sl: stric

# mother’s sister’s son
source: first cousin
cy: cefnder cyntaf
hy: առաջին զարմիկ
ko: 이종형제(이종사촌)
ne: पहिलो कजिन
sl: bratranec

# parent’s brother’s wife
source: aunt
cy: modryb
hy: մորաքույր
ko: 숙모(외숙모)
ne: काकी/ठूलीआमा
sl: teta

# parent’s father’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 종조부/외종조부
sl: prastric

# parent’s father’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 증조부/외증조부
sl: pradedek

# parent’s father’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 증조모/외증조모
sl: prababica

# parent’s father’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 증조부모/외증조부모
sl: pradedek/prababica

# parent’s father’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조부/대고모/진외종조부/진외존고모
sl: prastric/prateta

# parent’s father’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 대고모(大姑母)/진외존이모(陳外尊姨母)
sl: prateta

# parent’s mother’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 진외종조부/외외종조부
sl: prastric

# parent’s mother’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 진외증조부/외외증조부
sl: pradedek

# parent’s mother’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 진외증조모/외외증조모
sl: prababica

# parent’s mother’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 진외증조부모/외외증조부모
sl: pradedek/prababica

# parent’s mother’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조부/진외존이모/외외종조부/외외존이모
sl: prastric/prateta

# parent’s mother’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외존고모(外尊姑母)/외외존이모(外外尊姨母)
sl: prateta

# parent’s parent’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 종조부/진외종조부/외종조부/외외종조부
sl: prastric

# parent’s parent’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 증조부/진외증조부/외증조부/진외증조부
sl: pradedek

# parent’s parent’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 증조모/진외증조모/외증조모/외외증조모
sl: prababica

# parent’s parent’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 증조부모/진외증조부모/외증조부모/외외증조부모
sl: pradedek/prababica

# parent’s parent’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조부/대고모/진외종조부/진외존고모/외종조부/외존고모/외외종조부/외외존이모
sl: prastric/prateta

# parent’s parent’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 대고모(大姑母)/진외존이모(陳外尊姨母)/외존고모(外尊姑母)/외외존이모(外外尊姨母)
sl: prateta

# parent’s sister’s husband
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 고모부/이모부
ne: काका
sl: stric

# parent’s spouse’s child
source: step-sibling
cy: llys-frawd neu llys-chwaer
hy: խորթ եղբայր
sl: polbrat/polsestra

# parent’s spouse’s daughter
source: step-sister
cy: llys-chwaer
hy: խորթ քույր
sl: polsestra

# parent’s spouse’s son
source: step-brother
cy: llys-frawd
hy: խորթ եղբայր
sl: polbrat

# sibling’s child’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)/이손(離孫)
sl: pranečak/pranečakinja

# sibling’s child’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)/이손녀(離孫女)
sl: pranečakinja

# sibling’s child’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)/이손자(離孫子)
sl: pranečak

# sibling’s daughter’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)/이손(離孫)
sl: pranečak/pranečakinja

# sibling’s daughter’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)/이손녀(離孫女)
sl: pranečakinja

# sibling’s daughter’s husband
source: nephew-in-law
cy: nai yng nghyfraith
hy: զարմիկ
ko: 조카사위-질서(姪婿),생질서(甥姪婿)
sl: nečakinjin mož

# sibling’s daughter’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)/이손자(離孫子)
sl: pranečak

# sibling’s son’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)/이손(離孫)
sl: pranečak/pranečakinja

# sibling’s son’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)/이손녀(離孫女)
sl: pranečakinja

# sibling’s son’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)/이손자(離孫子)
sl: pranečak

# sibling’s son’s wife
source: niece-in-law
cy: nith yng nghyfraith
hy: զարմուհին
ko: 조카며느리-질부(姪婦)/생질부(甥姪婦)
sl: nečakova žena

# (a man’s) sister’s child’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a woman’s) sister’s child’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a man’s) sister’s child’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# (a woman’s) sister’s child’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# (a man’s) sister’s child’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# (a woman’s) sister’s child’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# (a man’s) sister’s daughter’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a woman’s) sister’s daughter’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a man’s) sister’s daughter’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# (a woman’s) sister’s daughter’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# sisters’s daughter’s husband
source: nephew-in-law
cy: nai yng nghyfraith
hy: զարմիկ
ko: 조카사위-생질서(甥姪婿)
sl: nečakinjin mož

# (a man’s) sister’s daughter’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# (a woman’s) sister’s daughter’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# sister’s husband’s brother
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 사돈(査頓)총각
ne: ज्वाइँ
sl: svak

# sister’s husband’s sibling
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 매제/매형/처형/처제
ne: ज्वाइँ
sl: svak/svakinja

# sister’s husband’s sister
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 사돈(査頓) 처녀
sl: svakinja

# (a man’s) sister’s son’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a woman’s) sister’s son’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 이손(離孫)
sl: pranečak/pranečakinja

# (a man’s) sister’s son’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# (a woman’s) sister’s son’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 이손녀(離孫女)
sl: pranečakinja

# (a man’s) sister’s son’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# (a woman’s) sister’s son’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 이손자(離孫子)
sl: pranečak

# sisters’s son’s wife
source: niece-in-law
cy: nith yng nghyfraith
hy: զարմուհին
ko: 조카사위-질서(姪壻)
sl: nečakova žena

# son’s child’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 증손/진외증손
sl: pravnuk/pravnukinja

# son’s child’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 증손녀/진외증손녀
sl: pravnukinja

# son’s child’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 증손자/진외증손자
sl: pravnuk

# son’s daughter’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 진외증손
sl: pravnuk/pravnukinja

# son’s daughter’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 진외증손녀
sl: pravnukinja

# son’s daughter’s husband
source: granddaughter’s husband
cy: gŵr y gorwyres
hy: թոռնուհու ամուսինը
ko: 손녀사위-손서(孫壻)
ne: नातिनीको श्रीमान्
sl: vnukinjin mož

# son’s daughter’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 진외증손자(진외曾孫子)
sl: pravnuk

# son’s son’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 증손
sl: pravnuk/pravnukinja

# son’s son’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 증손녀
sl: pravnukinja

# son’s son’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 증손자(曾孫子)
sl: pravnuk

# son’s son’s wife
source: grandson’s wife
cy: gwraig yr ŵyr
hy: թոռան կինը
ko: 손자며느리-손부(孫婦)
ne: नातिनी बुहारी
sl: vnukova žena

# son’s wife’s father
source: daughter-in-law’s father
cy: tad y ferch-yng-nghyfraith
hy: հարսի հայրը
ko: 바깥 사돈(査頓)
ne: सम्धी
sl: snahin oče

# son’s wife’s mother
source: daughter-in-law’s mother
cy: mam y ferch-yng-nghyfraith
hy: հարսի մայրը
ko: 안 사돈(査頓)
ne: सम्धिनी
sl: snahina mati

# son’s wife’s parent
source: daughter-in-law’s parent
cy: rhiant y ferch-yng-nghyfraith
hy: հարսի ծնողը
ko: 사돈(査頓)
ne: सम्धी/सम्धिनी
sl: snahin starš

# wife’s brother’s wife
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 처남댁
sl: svakinja

# wife’s sister’s husband
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 동서
ne: ज्वाइँ
sl: svak

# wife’s sibling’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 처조카-처질(妻姪)/처질녀(妻姪女)/처생질(妻甥姪)/처생질녀(妻甥姪女)
sl: nečak/nečakinja

# wife’s sister’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 처조카-처생질(妻甥姪)/처생질녀(妻甥姪女)
sl: nečak/nečakinja

# wife’s brother’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 처조카-처질(妻姪)/질녀(妻姪女)
sl: nečak/nečakinja

# wife’s sibling’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 처조카-처질녀(妻姪女)/처생질녀(妻甥姪女)
sl: nečakinja

# wife’s sister’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 처조카-처생질(妻甥姪)/처생질녀(妻甥姪女)
sl: nečakinja

# wife’s brother’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 처조카-처질녀(妻姪女)
sl: nečakinja

# wife’s sibling’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 처조카-처질(妻姪)/생질(妻甥姪)
sl: nečak

# wife’s sister’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 처조카-처생질(妻甥姪)
sl: nečak

# wife’s brother’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 처조카-처질(妻姪)
sl: nečak

# father’s father’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 종증조모
sl: prateta

# father’s father’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조모/대고모부
sl: prastric/prateta

# father’s father’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 대고모부(大姑母夫)
sl: prastric

# father’s mother’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 진외종조모
sl: prateta

# father’s mother’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조모/진외존이모부
sl: prastric/prateta

# father’s mother’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 진외존이모부
sl: prastric

# father’s parent’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 종조모/진외종조모
sl: prateta

# father’s parent’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조모/대고모부/진외종조모/진외존이모부
sl: prastric/prateta

# father’s parent’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 대고모부/진외존이모부
sl: prastric

# mother’s father’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외종조모
sl: prateta

# mother’s father’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 외종조모/외존고모부
sl: prastric/prateta

# mother’s father’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외존고모부
sl: prastric

# mother’s mother’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외외종조모
sl: prateta

# mother’s mother’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 외외종조모/외외존이모부
sl: prastric/prateta

# mother’s mother’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외외존이모부
sl: prastric

# mother’s parent’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외종조모/외외종조모
sl: prateta

# mother’s parent’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조모/진외존고모부/외외종조모/외외존이모부
sl: prastric/prateta

# mother’s parent’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 외존고모부/외외존이모부
sl: prastric

# parent’s father’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 종조모/외종조모
sl: prateta

# parent’s father’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조모/대고모부/진외종조모/진외존고모부
sl: prastric/prateta

# parent’s father’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 대고모부/외존고모부
sl: prastric

# parent’s mother’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 외외종조모(外外從祖母),외종조모(外從祖母)
sl: prateta

# parent’s mother’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조모/진외존고모부/외외종조모/외외존이모부
sl: prastric/prateta

# parent’s mother’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 진외존이모부/외외존이모부
sl: prastric

# parent’s parent’s brother’s wife
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 종조모(從祖母)/진외종조모(陳外從祖母)/외종조모(外從祖母)/외외종조모(外外從祖母)
sl: prateta

# parent’s parent’s sibling’s spouse
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조모/대고모부/진외종조모/진외존고모부/외종조모/외존고모부/외외종조모/외외존이모부
sl: prastric/prateta

# parent’s parent’s sister’s husband
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 대고모부/진외존이모부/외존고모부/외외존이모부
sl: prastric

# father’s father’s brother’s daughter
source: first cousin once removed ascending
cy: y cefnder cyntaf unwaith ei symud yn esgyn
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 당고모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# father’s father’s brother’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 당숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# father’s father’s brother’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 당숙/당고모
ne: पहिलो कजिन एक पटक आरोहण हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# father’s father’s sister’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 내종고모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# father’s father’s sister’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 내종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# father’s father’s sister’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 내종숙/내종고모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# father’s mother’s brother’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외종고모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# father’s mother’s brother’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# father’s mother’s brother’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외종고모/진외종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# father’s mother’s sister’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외이종고모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# father’s mother’s sister’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외이종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# father’s mother’s sister’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 진외이종고모/진외이종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# mother’s father’s brother’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# mother’s father’s brother’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# mother’s father’s brother’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외종이모,외종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# mother’s father’s sister’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외내종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# mother’s father’s sister’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외내종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče
