Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: This is a link to your own record in the family tree. If this is the wrong individual, contact an administrator.
cy: Dyma ddolen i'ch cofnod eich hun yn y cart achau. Os mai hwn yw'r unigolyn anghywir, cysylltwch â gweinyddwr.
hy: Սա հղում է տոհմածառի ձեր սեփական գրառումին: Եթե սա սխալ անձնավորություն է, դիմեք ադմինիստրատորին:
ko: 이것은 가계도에서 자신의 기록에 대한 링크입니다. 인물이 잘못된 경우 관리자에게 문의하십시오.
ne: यो पारिवारिक रूखमा तपाईंको आफ्नै रेकर्डको लिङ्क हो। यदि यो गलत व्यक्ति हो भने, प्रशासकलाई सम्पर्क गर्नुहोस्।
sl: To je povezava do vašega zapisa v družinskem drevesu. Če gre za napačno osebo, se obrnite na skrbnika.

source: Leave the password blank if you want to keep the current password.
cy: Gadewch y cyfrinair yn wag os ydych am gadw'r cyfrinair cyfredol.
hy: Գաղտնաբառը դատարկ թողեք, եթե ցանկանում եք պահպանել ընթացիկ գաղտնաբառը:
ko: 현재 암호를 유지하려면 암호를 공백으로 두십시오.
ne: यदि तपाइँ हालको पासवर्ड राख्न चाहनुहुन्छ भने पासवर्ड खाली छोड्नुहोस्।
sl: Pustite polje za geslo prazno, če želite ohraniti trenutno geslo.

source: Contact method
cy: Dull cyswllt
hy: Կոնտակտային մեթոդ
ko: 연락 방법
ne: सम्पर्क विधि
sl: Kontaktna metoda

source: Delete your account
cy: Dileu eich cyfrif
hy: Ջնջել ձեր հաշիվը
ko: 계정 삭제
ne: आफ्नो खाता मेटाउनुहोस्
sl: Izbriši svoj račun

source: Drag the blocks to change their position.
cy: Llusgwch y blociau i newid eu safle.
hy: Քաշեք բլոկները՝ փոխելու իրենց դիրքը:
ko: 블록을 끌어 위치를 변경합니다.
ne: तिनीहरूको स्थिति परिवर्तन गर्न ब्लकहरू तान्नुहोस्।
sl: Povlecite bloke na njihov nov položaj.

source: Add more blocks from the following list.
cy: Ychwanegwch fwy o flociau o'r rhestr ganlynol.
hy: Ավելացրեք ավելի շատ բլոկներ հետևյալ ցուցակից:
ko: 다음 목록에서 더 많은 블록을 추가합니다.
ne: निम्न सूचीबाट थप ब्लकहरू थप्नुहोस्।
sl: Dodaj več blokov iz spodnjega seznama.

source: Restore the default block layout
cy: Adfer cynllun y bloc rhagosodedig
hy: Վերականգնել բլոկի լռելյայն դասավորությունը
ko: 기본 블록 레이아웃을 복원하십시오
ne: पूर्वनिर्धारित ब्लक लेआउट पुनर्स्थापित गर्नुहोस्
sl: Obnovi privzeto postavitev blokov

source: Add a fact
cy: Ychwanegu ffaith
hy: Ավելացնել փաստ
ko: 정보 추가
ne: तथ्य थप्नुहोस्
sl: Dodaj dejstvo

source: Son
cy: Mab
hy: Որդի
ko: 아들
ne: छोरा
sl: Sin

source: Daughter
cy: Merch
hy: Դուստր
ko: 딸
ne: छोरी
sl: Hči

source: Edit with all GEDCOM tags
hy: Խմբագրել բոլոր GEDCOM պիտակներով
ko: 모든 GEDCOM 태그로 편집
ne: सबै GEDCOM ट्यागहरूसँग सम्पादन गर्नुहोस्

source: Copy
cy: Copïo
hy: Պատճենել
ko: 복사
ne: प्रतिलिपि गर्नुहोस्
sl: Kopiraj

source: Are you sure you want to delete the link to “%s”?
cy: Ydych chi'n siŵr eich bod chi am ddileu'r ddolen i “%s”?
hy: Իսկապե՞ս ուզում եք ջնջել «%s»-ի հղումը?
ko: "%s"에 대한 링크를 삭제하시겠습니까?
ne: के तपाइँ यो “%s” लिंक मेटाउन रेडी हुनुहुन्छ ?
sl: Ste prepričani, da želite izbrisati povezavo do “%s”?

source: Unlink
cy: Datgysylltu
hy: Չեղարկել կապը
ko: 링크 해제
ne: अनलिंक गर्नुहोस्
sl: Prekini povezavo

source: Select a date
cy: Dewis dyddiad
hy: Ընտրեք ամսաթիվ
ko: 날짜 선택
ne: मिति चयन गर्नुहोस्
sl: Izberi datum

source: Edit the name
cy: Golygu'r enw
hy: Խմբագրել անունը
ko: 이름 수정
ne: नाम सच्याउनुहोस्
sl: Uredi ime

source: Find a special character
cy: Canfod nod arbennig
hy: Գտեք հատուկ կերպար
ko: 특별한 캐릭터 찾기
ne: स्पेसल क्यारेक्टर खोज्नुहोस्
sl: Najdi posebni znak

source: A child may have more than one set of parents. The relationship between the child and the parents can be biological, legal, or based on local culture and tradition. If no pedigree is specified, then a biological relationship will be assumed.
cy: Gall fod gan blentyn fwy nag un set o rieni. Gall y berthynas rhwng y plentyn a'r rhieni fod yn fiolegol, yn gyfreithiol, neu'n seiliedig ar ddiwylliant a thraddodiad lleol. Os nad oes tras yn cael ei nodi, yna rhagdybir perthynas fiolegol.
hy: Երեխան կարող է ունենալ մեկից ավելի ծնողներ: Երեխայի և ծնողների հարաբերությունները կարող են լինել կենսաբանական, օրինական կամ հիմնված տեղական մշակույթի և ավանդույթի վրա: Եթե տոհմային չնշված լինի, ապա կենթադրվի կենսաբանական հարաբերություն:
ko: 자녀는 둘 이상의 부모 세트를 가질 수 있습니다. 자녀와 부모 사이의 관계는 생물학적, 법적 또는 현지 문화와 전통을 기반으로 할 수 있습니다. 가계도가 지정되지 않으면 생물학적 관계가 가정됩니다.
ne: एउटा बच्चाको अभिभावकको एक भन्दा बढी सेट हुन सक्छ। बच्चा र आमाबाबुबीचको सम्बन्ध जैविक, कानुनी, वा स्थानीय संस्कृति र परम्परामा आधारित हुन सक्छ। यदि कुनै वंशावलीमा निर्दिष्ट गरिएको छैन भने, जैविक सम्बन्ध मानिनेछ।
sl: Otrok ima lahko več kot en par staršev. Sorodstveno razmerje med otrokom in starši je lahko biološko, pravno ali pa temelji na lokalni kulturi in tradiciji. Če sorodstveno razmerje ni navedeno, se domneva, da gre za biološko razmerje.

source: go to new individual
cy: mynd at unigolyn newydd
hy: գնալ նոր անհատի
ko: 새로운 인물로 이동
ne: नयाँ व्यक्तिमा जानुहोस्
sl: pojdi k novi osebi

source: This page allows you to bypass the usual forms, and edit the underlying data directly. It is an advanced option, and you should not use it unless you understand the GEDCOM format. If you make a mistake here, it can be difficult to fix.
cy: Mae'r dudalen hon yn caniatáu i chi osgoi'r ffurflenni arferol, a golygu'r data sylfaenol yn uniongyrchol. Mae'n opsiwn uwch, ac ni ddylech ei ddefnyddio oni bai eich bod yn deall fformat GEDCOM. Os gwnewch gamgymeriad yma, gall fod yn anodd ei drwsio.
hy: Այս էջը թույլ է տալիս շրջանցել սովորական ձևերը և ուղղակիորեն խմբագրել հիմքում ընկած տվյալները: Դա առաջադեմ տարբերակ է, և դուք չպետք է օգտագործեք այն, քանի դեռ չեք հասկանում GEDCOM ձևաչափը: Եթե այստեղ սխալ եք թույլ տալիս, ապա այն կարող է դժվար լինել ուղղել:
ko: 이 페이지에서는 일반적인 양식을 무시하고 기본 데이터를 직접 편집 할 수 있습니다. 고급 옵션이며 GEDCOM 형식을 이해하지 않으면 사용하지 마십시오. 여기에서 실수하면 수정하기가 어려울 수 있습니다.
ne: यो पृष्ठले तपाईंलाई सामान्य फारमहरू बाइपास गर्न, र अन्तर्निहित डाटा सीधा सम्पादन गर्न अनुमति दिन्छ। यो एक उन्नत विकल्प हो, र तपाईंले GEDCOM ढाँचा नबुझेसम्म यसलाई प्रयोग गर्नु हुँदैन। यदि तपाईंले यहाँ गल्ती गर्नुभयो भने, यसलाई ठीक गर्न गाह्रो हुन सक्छ।
sl: Ta stran vam omogoča, da se izognete običajnim obrazcem in neposredno uredite osnovne podatke. Gre za napredno možnost in je ne smete uporabljati, če ne razumete formata GEDCOM. Če tukaj naredite napako, jo je težko popraviti.

source: You can download a copy of the GEDCOM specification from %s.
cy: Gallwch lawrlwytho copi o fanyleb GEDCOM o %s.
hy: Դուք կարող եք ներբեռնել GEDCOM բնութագրի պատճենը %s-ից:
ko: %s에서 GEDCOM 사양 사본을 다운로드 할 수 있습니다.
ne: तपाईंले %s बाट GEDCOM विनिर्देशको प्रतिलिपि डाउनलोड गर्न सक्नुहुन्छ।
sl: Kopijo specifikacije GEDCOM lahko prenesete iz %s.

source: sort by date of birth
cy: trefnu yn ôl dyddiad geni
hy: տեսակավորել ըստ ծննդյան ամսաթվի
ko: 출생일순으로 정렬
sl: razvrsti po datumu rojstva

source: Spouses
cy: Priod
hy: Ամուսիններ
ko: 배우자
ne: जोडीहरू
sl: Zakonci

source: When an individual has more than one spouse, you should sort the families in date order.
cy: Pan fydd gan unigolyn fwy nag un priod, dylech ddidoli'r teuluoedd yn nhrefn eu dyddiad.
hy: Երբ անհատն ունի մեկից ավելի ամուսին, դուք պետք է դասավորեք ընտանիքները ըստ ամսաթվերի:
ko: 인물에 배우자가 둘 이상 있으면 가족을 날짜 순서대로 정렬해야합니다.
ne: जब एक व्यक्तिको एक भन्दा बढी पति/पत्नी हुन्छन्, तपाईंले परिवारहरूलाई मिति क्रममा क्रमबद्ध गर्नुपर्छ।
sl: Če ima oseba več kot enega zakonca, morate družine razvrstiti po datumu.

source: sort by date of marriage
cy: trefnu yn ôl dyddiad priodi
hy: տեսակավորել ըստ ամուսնության ամսաթվի
ko: 결혼날짜 순으로 정렬
sl: razvrsti po datumu poroke

source: An individual can have more than one set of parents. For example, birth and adopted.
hy: Անհատը կարող է ունենալ մեկից ավելի ծնողներ: Օրինակ՝ ծնունդը և որդեգրումը։
ko: 인물은 둘 이상의 부모 세트를 가질 수 있습니다. 예를 들어, 출생 및 입양.
ne: एक व्यक्तिमा एक भन्दा बढी अभिभावकहरू हुन सक्छन्। उदाहरणका लागि, जन्म र ग्रहण ।

source: The first family in the list will be used in charts, lists, reports, etc.
cy: Bydd y teulu cyntaf ar y rhestr yn cael ei ddefnyddio mewn siartiau, rhestrau, adroddiadau, ac ati.
hy: Ցանկի առաջին ընտանիքը կօգտագործվի գծապատկերներում, ցուցակներում, հաշվետվություններում և այլն:
ko: 목록의 첫 번째 가족은 차트, 목록, 보고서 등에 사용됩니다.
ne: सूचीमा पहिलो परिवार चार्ट, सूची, रिपोर्ट, आदि मा प्रयोग गरिनेछ।
sl: Prva družina na seznamu bo uporabljena v diagramih, seznamih, poročilih itd.

source: Hello %s…
cy: Helo %s…
hy: Բարև %s…
ko: 안녕하세요 %s님…
ne: नमस्कार %s…
sl: Živjo %s …

source: The administrator at the webtrees site %s has approved your application for an account. You may now sign in by accessing the following link: %s
cy: Mae'r gweinyddwr ar wefan webtrees %s wedi cymeradwyo'ch cais am gyfrif. Gallwch nawr fewngofnodi trwy ddilyn y ddolen ganlynol: %s
hy: %s webtrees կայքի ադմինիստրատորը հաստատել է ձեր դիմումը հաշվի համար: Այժմ կարող եք մուտք գործել՝ մուտք գործելով հետևյալ հղումը՝ %s
ko: 웹 트리 사이트 %s의 관리자가 귀하의 계정 신청을 승인했습니다. 다음 링크에 액세스하여 로그인 할 수 있습니다 : %s
ne: Webtrees साइट %s मा प्रशासकले खाताको लागि तपाइँको आवेदन स्वीकृत गरेको छ। तपाइँ अब निम्न लिङ्कमा पहुँच गरेर साइन इन गर्न सक्नुहुन्छ: %s
sl: Skrbnik rodoslovnega spletišča %s je odobril vašo vlogo za uporabniški račun. Zdaj se lahko prijavite s klikom na naslednjo povezavo: %s

source: You sent the following message to a webtrees user:
cy: Fe wnaethoch chi anfon y neges ganlynol at ddefnyddiwr webtrees:
hy: Դուք ուղարկել եք հետևյալ հաղորդագրությունը webtrees-ի օգտատիրոջը:
ko: 웹 트리 사용자에게 다음 메시지를 보냈습니다:
ne: तपाईंले वेबट्री प्रयोगकर्तालाई निम्न सन्देश पठाउनुभयो:
sl: Uporabniku webtrees ste poslali naslednje sporočilo:

source: This message was sent while viewing the following URL:
cy: Anfonwyd y neges hon wrth edrych ar yr URL canlynol:
hy: Այս հաղորդագրությունն ուղարկվել է հետևյալ URL-ը դիտելիս.
ko: 이 메시지는 다음 URL을 보면서 전송되었습니다:
ne: यो सन्देश निम्न URL हेर्दा पठाइएको थियो:
sl: To sporočilo je bilo poslano med gledanjem naslednjega URL:

source: %s sent you the following message.
cy: Anfonodd %s y neges ganlynol atoch.
hy: %s-ը ձեզ ուղարկել է հետևյալ հաղորդագրությունը.
ko: %s 가 다음 메시지를 보냈습니다.
ne: %s ले तपाईंलाई निम्न सन्देश पठाउनुभयो।
sl: Oseba %s vam je poslala sporočilo.

source: To set a new password, follow this link.
cy: I osod cyfrinair newydd, dilynwch y ddolen hon.
hy: Նոր գաղտնաբառ սահմանելու համար անցեք այս հղմանը:
ko: 새 비밀번호를 설정하려면이 링크를 따르십시오.
ne: नयाँ पासवर्ड सेट गर्न, यो लिङ्क पछ्याउनुहोस्।
sl: Za nastavitev novega gesla sledite povezavi.

source: If you did not request a new password, please ignore this message.
cy: Os na wnaethoch ofyn am gyfrinair newydd, anwybyddwch y neges hon.
hy: Եթե դուք չեք խնդրել նոր գաղտնաբառ, խնդրում ենք անտեսել այս հաղորդագրությունը:
ko: 새 비밀번호를 요청하지 않은 경우 이 메시지를 무시하십시오.
ne: यदि तपाईंले नयाँ पासवर्ड अनुरोध गर्नुभएको छैन भने, कृपया यो सन्देशलाई बेवास्ता गर्नुहोस्।
sl: Spreglejte sporočilo, če niste zahtevali novega gesla.

source: Hello administrator…
cy: Helo weinyddwr…
hy: Բարև ադմինիստրատոր…
ko: 안녕하세요 관리자님…
ne: नमस्ते एडमिन…
sl: Živjo skrbnik …

source: A prospective user has registered with webtrees at %s.
cy: Mae darpar ddefnyddiwr wedi cofrestru gyda webtrees yn %s.
hy: Հնարավոր օգտվողը գրանցվել է webtrees-ում %s-ում:
ko: 사용자가 %s 에서 Webtree에 등록했습니다.
ne: सम्भावित प्रयोगकर्ताले %s मा webtrees सँग दर्ता गरेको छ।
sl: Potencialni uporabnik se je registriral pri webtrees na %s.

source: Comments
cy: Nodiadau
hy: Մեկնաբանություններ
ko: 답변
ne: टिप्पणीहरू
sl: Komentarji

source: The user has been sent an email with the information necessary to confirm the access request.
cy: Anfonwyd e-bost at y defnyddiwr gyda'r manylion angenrheidiol i gadarnhau'r cais mynediad.
hy: Օգտագործողին ուղարկվել է էլեկտրոնային նամակ՝ մուտքի հարցումը հաստատելու համար անհրաժեշտ տեղեկություններով:
ko: 사용자에게 액세스 요청을 확인하는 데 필요한 정보가 포함 된 이메일이 발송되었습니다.
ne: प्रयोगकर्तालाई पहुँच अनुरोध पुष्टि गर्न आवश्यक जानकारीको साथ ईमेल पठाइएको छ।
sl: Uporabniku je bila poslana e-pošta s podatki, potrebnimi za potrditev zahteve za dostop.

source: You will be informed by email when this prospective user has confirmed the request. You can then complete the process by activating the username. The new user will not be able to sign in until you activate the account.
cy: Cewch eich hysbysu trwy e-bost pan fydd y darpar ddefnyddiwr hwn wedi cadarnhau'r cais. Yna gallwch gwblhau'r broses trwy weithredu'r enw defnyddiwr. Ni fydd y defnyddiwr newydd yn gallu mewngofnodi nes i chi weithredu'r cyfrif.
hy: Դուք էլփոստով կտեղեկացվեք, երբ այս ապագա օգտվողը հաստատի հարցումը: Այնուհետև կարող եք ավարտել գործընթացը՝ ակտիվացնելով օգտվողի անունը: Նոր օգտվողը չի կարողանա մուտք գործել, քանի դեռ չեք ակտիվացնել հաշիվը:
ko: 이 예상 사용자가 요청을 확인하면 이메일로 알려드립니다. 그런 다음 사용자 이름을 활성화하여 프로세스를 완료 할 수 있습니다. 새 사용자는 계정을 활성화 할 때까지 로그인 할 수 없습니다.
ne: यो सम्भावित प्रयोगकर्ताले अनुरोध पुष्टि गरेपछि तपाईंलाई इमेलद्वारा सूचित गरिनेछ। त्यसपछि तपाइँ प्रयोगकर्ता नाम सक्रिय गरेर प्रक्रिया पूरा गर्न सक्नुहुन्छ। तपाईंले खाता सक्रिय नगरेसम्म नयाँ प्रयोगकर्ताले साइन इन गर्न सक्षम हुने छैन।
sl: Ko bo ta potencialni uporabnik potrdil zahtevo, boste obveščeni po e-pošti. Postopek lahko nato dokončate z aktivacijo uporabniškega imena. Novi uporabnik se ne bo mogel prijaviti, dokler ne aktivirate uporabniškega računa.

source: You (or someone claiming to be you) has requested an account at %1$s using the email address %2$s.
cy: Rydych chi (neu rywun sy'n honni mai chi yw chi) wedi gofyn am gyfrif yn %1$s gan ddefnyddio'r cyfeiriad e-bost %2$s.
hy: Դուք (կամ ինչ-որ մեկը, որը պնդում է, որ դուք եք) հաշիվ եք խնդրել %1$s-ում՝ օգտագործելով %2$s էլ.
ko: 귀하 (또는 귀하를 주장하는 사람)가 이메일 주소 %2$s을 사용하여 %1$s에 계정을 요청했습니다.
ne: तपाईंले (वा आफू भएको दाबी गर्ने कसैले) इमेल ठेगाना %2$s प्रयोग गरेर %1$s मा खाता अनुरोध गर्नुभएको छ।
sl: Vi (ali nekdo, ki se izdaja za vas) je zahteval račun pri %1$s z uporabo e-poštnega naslova %2$s.

source: Follow this link to verify your email address.
cy: Dilynwch y ddolen hon i wirio'ch cyfeiriad e-bost.
hy: Հետևեք այս հղմանը ձեր էլ.փոստի հասցեն հաստատելու համար:
ko: 이 링크를 따라 이메일 주소를 확인하십시오.
ne: आफ्नो इमेल ठेगाना प्रमाणित गर्न यो लिङ्कमा जानुहोस् ।
sl: Kliknite na povezavo za potrditev e-poštnega naslova.

source: If you didn’t request an account, you can just delete this message.
cy: Os na wnaethoch ofyn am gyfrif, gallwch ddileu'r neges hon.
hy: Եթե դուք հաշիվ չեք խնդրել, կարող եք պարզապես ջնջել այս հաղորդագրությունը:
ko: 계정을 요청하지 않았다면 이 메시지를 삭제하면 됩니다.
ne: यदि तपाईंले खाता अनुरोध गर्नुभएको छैन भने, तपाईंले यो सन्देश मेटाउन सक्नुहुन्छ।
sl: Izbrišite sporočilo, če niste zahtevali uporabniškega računa.

source: A new user (%1$s) has requested an account (%2$s) and verified an email address (%3$s).
cy: Mae defnyddiwr newydd (%1$s) wedi gofyn am gyfrif (%2$s) ac wedi gwirio cyfeiriad e-bost (%3$s).
hy: Նոր օգտվողը (%1$s) հաշիվ է խնդրել (%2$s) և հաստատել էլփոստի հասցեն (%3$s):
ko: 새 사용자 (%1$s)가 계정 (%2$s)을 요청하고 이메일 주소 (%3$s)를 확인했습니다.
ne: नयाँ प्रयोगकर्ता (%1$s) ले एउटा खाता (%2$s) अनुरोध गरेको छ र इमेल ठेगाना (%3$s) प्रमाणित गरेको छ।
sl: Nov uporabnik (%1$s) je zahteval račun (%2$s) in potrdil e-poštni naslov (%3$s).

source: You need to review the account details.
cy: Mae angen i chi adolygu manylion y cyfrif.
hy: Դուք պետք է վերանայեք հաշվի մանրամասները:
ko: 계정 정보를 검토해야합니다.
ne: तपाईंले खाता विवरणहरू समीक्षा गर्न आवश्यक छ।
sl: Pregledati morate podatke o uporabniškem računu.

source: Set the status to “approved”.
cy: Gosodwch y statws i “gymeradwy”.
hy: Կարգավիճակը դրեք «հաստատված»:
ko: 상태를 "승인"으로 설정하십시오..
ne: स्थिति "स्वीकृत" मा सेट गर्नुहोस्।
sl: Nastavi stanje na “odobreno”.

source: Set the access level for each tree.
cy: Gosod y lefel mynediad ar gyfer pob cart achau.
hy: Սահմանեք մուտքի մակարդակը յուրաքանչյուր ծառի համար:
ko: 각 트리의 액세스 수준을 설정하십시오.
ne: प्रत्येक रूखको लागि पहुँच स्तर सेट गर्नुहोस्।
sl: Nastavi raven dostopa za vsako drevo.

source: Link the user account to an individual.
cy: Cysylltwch y cyfrif defnyddiwr ag unigolyn.
hy: Օգտատիրոջ հաշիվը կապեք անհատի հետ:
ko: 사용자 계정을 인물에 연결합니다.
ne: प्रयोगकर्ता खातालाई व्यक्तिसँग लिङ्क गर्नुहोस्।
sl: Povezovanje uporabniškega računa z osebo.

source: Oops! The webserver is unable to connect to the database server. It could be busy, undergoing maintenance, or simply broken. You should <a href="index.php">try again</a> in a few minutes or contact the website administrator.
cy: Wps! Nid yw'r gweinydd gwe yn gallu cysylltu â gweinydd y gronfa ddata. Gallai fod yn brysur, yn cael ei gynnal a'i gadw, neu wedi torri. Dylech <a href="index.php">roi cynnig arall arni</a> mewn ychydig funudau neu gysylltu â gweinyddwr y wefan.
hy: Վա՜յ Վեբսերվերը չի կարողանում միանալ տվյալների բազայի սերվերին: Այն կարող է զբաղված լինել, տեխնիկական սպասարկում կամ պարզապես կոտրվել: Դուք պետք է <a href="index.php">փորձեք նորից</a> մի քանի րոպեից կամ կապվեք կայքի ադմինիստրատորի հետ:
ko: ! 웹 서버가 데이터베이스 서버에 연결할 수 없습니다. 사용 중이거나 유지 관리 중이거나 단순히 고장난 것일 수 있습니다. 몇 분 후에 <a href="index.php">다시 시도</a>하거나 웹사이트 관리자에게 문의하십시오.
ne: उफ्! वेबसर्भर डाटाबेस सर्भरमा जडान गर्न असमर्थ छ। यो व्यस्त हुन सक्छ, मर्मतसम्भार भइरहेको, वा केवल भाँचिएको हुन सक्छ। तपाईंले केही मिनेटमा <a href="index.php">फेरि प्रयास गर्नुपर्छ</a> वा वेबसाइट प्रशासकलाई सम्पर्क गर्नुहोस्।
sl: Spletni strežnik se ne more povezati s strežnikom podatkovne baze. Morda je zaseden, v vzdrževanju ali pa preprosto pokvarjen. Čez nekaj minut <a href="index.php">poskusite znova</a> ali se obrnite na skrbnika spletišča.

source: If you are the website administrator, you should check that:
cy: Os mai chi yw gweinyddwr y wefan, dylech wirio:
hy: Եթե դուք կայքի ադմինիստրատորն եք, ապա պետք է ստուգեք, որ:
ko: 웹 사이트 관리자인 경우 다음을 확인해야 합니다:
ne: यदि तपाईं वेबसाइट प्रशासक हुनुहुन्छ भने, तपाईंले जाँच गर्नुपर्छ:
sl: Če ste skrbnik spletišča, morate preveriti naslednje:

source: the database connection settings in the file “/data/config.ini.php” are still correct
cy: fod gosodiadau cysylltiad y gronfa ddata yn y ffeil “/data/config.ini.php” yn dal yn iawn
hy: տվյալների բազայի միացման կարգավորումները «/data/config.ini.php» ֆայլում դեռ ճիշտ են
ko: ￦"/data/config.ini.php￦" 파일의 데이터베이스 연결 설정이 여전히 정확합니다
sl: nastavitve povezave s podatkovno bazo v datoteki “/data/config.ini.php” so še vedno pravilne

source: the folder “/data” and the file “/data/config.ini.php” have access permissions that allow the webserver to read them
cy: fod gan y ffolder “/data” a’r ffeil “/data/config.ini.php” ganiatâd mynediad sy’n caniatáu i’r gweinydd gwe eu darllen
hy: «/data» թղթապանակը և «/data/config.ini.php» ֆայլն ունեն մուտքի թույլտվություններ, որոնք թույլ են տալիս վեբսերվերին կարդալ դրանք
ko: ￦"/data￦" 폴더와 ￦"/data/config.ini.php￦" 파일에는 웹 서버가 읽을 수 있는 액세스 권한이 있습니다
sl: mapa “/data” in datoteka “/data/config.ini.php” imata dovoljenje za dostop, ki spletnemu strežniku omogočajo branje

source: you can connect to the database using other applications, such as phpmyadmin
cy: y gallwch gysylltu â'r gronfa ddata gan ddefnyddio rhaglenni eraill, fel phpmyadmin
hy: դուք կարող եք միանալ տվյալների բազային՝ օգտագործելով այլ հավելվածներ, օրինակ՝ phpmyadmin
ko: phpmyadmin과 같은 다른 응용 프로그램을 사용하여 데이터베이스에 연결할 수 있습니다
ne: तपाईं अन्य अनुप्रयोगहरू प्रयोग गरेर डाटाबेसमा जडान गर्न सक्नुहुन्छ, जस्तै phpmyadmin
sl: s podatkovno bazo se lahko povežete z drugimi aplikacijami, kot je phpmyadmin

source: If you cannot resolve the problem yourself, you can ask for help on the forums at <a href="https://webtrees.net">webtrees.net</a>.
cy: Os na allwch ddatrys y broblem eich hun, gallwch ofyn am help ar y fforymau yn <a href="https://webtrees.net">webtrees.net</a> .
hy: Եթե դուք ինքներդ չեք կարող լուծել խնդիրը, կարող եք օգնություն խնդրել <a href="https://webtrees.net">webtrees.net</a> ֆորումներում:
ko: 스스로 문제를 해결할 수 없는 경우 <a href="https://webtrees.net">webtrees.net</a> 포럼에서 도움을 요청할 수 있습니다.
ne: यदि तपाइँ आफैले समस्या समाधान गर्न सक्नुहुन्न भने, तपाइँ फोरमहरूमा मद्दत माग्न सक्नुहुन्छ <a href="https://webtrees.net">webtrees.net</a>।
sl: Če težave ne morete odpraviti sami, lahko zaprosite za pomoč na forumih na <a href="https://webtrees.net">webtrees.net</a>.

source: An unexpected database error occurred.
cy: Digwyddodd gwall annisgwyl mewn cronfa ddata.
hy: Տվյալների բազայի անսպասելի սխալ տեղի ունեցավ:
ko: 예기치 않은 데이터베이스 오류가 발생했습니다.
ne: एउटा अनपेक्षित डाटाबेस त्रुटि भयो।
sl: Nepričakovana napaka podatkovne baze.

source: The webtrees developers would be very interested to learn about this error. If you contact them, they will help you resolve the problem.
cy: Byddai gan y datblygwyr gwefannau ddiddordeb mawr mewn dysgu am y gwall hwn. Os byddwch chi'n cysylltu â nhw, byddan nhw'n eich helpu i ddatrys y broblem.
hy: Webtrees-ի մշակողները շատ հետաքրքրված կլինեն իմանալ այս սխալի մասին: Եթե դիմեք նրանց, նրանք կօգնեն ձեզ լուծել խնդիրը:
ko: webtrees 개발자는 오류에 대해 매우 관심이 있습니다. 연락하면 문제 해결에 도움이됩니다.
ne: Webtrees विकासकर्ताहरू यस त्रुटिको बारेमा जान्न धेरै इच्छुक हुनेछन्। यदि तपाईंले तिनीहरूलाई सम्पर्क गर्नुभयो भने, तिनीहरूले तपाईंलाई समस्या समाधान गर्न मद्दत गर्नेछन्।
sl: Razvijalce webtrees zelo zanimajo informacije o tej napaki. Če se obrnete nanje, vam bodo pomagali rešiti težavo.

source: This user account does not have access to any tree.
cy: Nid oes gan y cyfrif defnyddiwr hwn fynediad i unrhyw gart achau.
hy: Այս օգտվողի հաշիվը մուտք չունի որևէ ծառի:
ko: 이 사용자 계정은 어떤 가계도에도 액세스 할 수 없습니다.
ne: यो प्रयोगकर्ता खातासँग कुनै पनि रूखमा पहुँच छैन।
sl: Ta uporabniški račun nima dostopa do nobenega družinskega drevesa.

source: (on the date of death)
cy: (ar ddyddiad y farwolaeth)
hy: (մահվան օրը)
ko: (사망 날짜)
ne: (मृत्यु मितिमा)
sl: (na dan smrti)

source: (%s after death)
cy: (%s ar ôl marwolaeth)
hy: (%s մահից հետո)
ko: (%s 사망 이후)
ne: (%s मृत्यु पछि)
sl: (%s po smrti)

source: Mother’s age
cy: Oed y fam
hy: մոր տարիքը
ko: 어머니의 나이
ne: आमाको उमेर
sl: Starost matere

source: Father’s age
cy: Oed y tad
hy: Հոր տարիքը
ko: 아버지의 나이
ne: बुवाकाे उमेर
sl: Starost očeta

source: Parent’s age
cy: Oed y rhiant
hy: Ծնողի տարիքը
ko: 부모의 나이
ne: अविभावकको उमेर
sl: Starost starša

source: %s child
cy: %s plant
hy: %s երեխա
ko: %s 자녀들
ne: %s बच्चा
sl: %s otrok

source: Add a media object
cy: Ychwanegu gwrthrych cyfryngau
hy: Ավելացնել մեդիա օբյեկտ
ko: 새로운 미디어 개체를 추가
ne: मिडिया वस्तु थप्नुहोस्
sl: Dodaj medijski predmet

source: Deleting the family will unlink all of the individuals from each other but will leave the individuals in place. Are you sure you want to delete this family?
cy: Bydd dileu'r teulu'n datgysylltu'r holl unigolion oddi wrth ei gilydd ond yn gadael yr unigolion yn eu lle. Ydych chi'n siŵr eich bod chi am ddileu'r teulu hwn?
hy: Ընտանիքը ջնջելու դեպքում բոլոր անհատները կհեռացվեն միմյանցից, սակայն անհատները կթողնեն իրենց տեղում: Իսկապե՞ս ուզում եք ջնջել այս ընտանիքը?
ko: 가족을 삭제하면 모든 이 서로 연결이 끊어 지지만 인물은 그대로 유지됩니다. 이 가족을 삭제 하시겠습니까?
ne: परिवार मेटाउँदा सबै व्यक्तिहरू एकअर्काबाट अनलिंक हुन्छन् । तर व्यक्तिहरूलाई खाली ठाउँमा छोड्नेछ। के तपाईं यो परिवार मेटाउन निश्चित हुनुहुन्छ ?
sl: Z izbrisom družine se bodo izbrisale povezave med osebami, le-te pa bodo ostale na svojem mestu. Ali res želite izbrisati to družino?

# You should review the deletion and then accept or reject it.
source: accept
cy: derbyn
hy: ընդունել
ko: 동의
ne: स्वीकार गर्नुहोस्
sl: sprejmi

# You should review the deletion and then accept or reject it.
source: reject
cy: gwrthod
hy: մերժել
ko: 거부
ne: अस्वीकार
sl: zavrni

source: This family has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r teulu hwn wedi'i ddileu. Dylech adolygu'r dileu ac yna %1$s neu %2$s.
hy: Այս ընտանիքը ջնջվել է: Դուք պետք է վերանայեք ջնջումը, այնուհետև %1$s կամ %2$s այն:
ko: 이 가족은 삭제되었습니다. 삭제를 검토 한 다음 %1$s 또는 %2$s 해야합니다.
ne: यो परिवार मेटाइएको छ। तपाईंले मेटाउने समीक्षा र त्यसपछि %1$s वा %2$s यसलाई समीक्षा गर्नुपर्छ।
sl: Ta družina je izbrisana. Preglejte izbris in ga nato %1$s ali %2$s.

source: This family has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r teulu hwn wedi'i ddileu. Bydd angen i'r cymedrolwr adolygu'r dileu.
hy: Այս ընտանիքը ջնջվել է: Ջնջումը պետք է վերանայվի մոդերատորի կողմից:
ko: 이 가족은 삭제되었습니다. 중재자가 삭제를 검토해야합니다.
ne: यो परिवार मेटाइएको छ। मेटाउने कार्यलाई मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta družina je izbrisana. Izbris mora pregledati moderator.
