Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: This is the list of GEDCOM facts that your users can add to repositories. You can modify this list by removing or adding fact names, even custom ones, as necessary. Fact names that appear in this list must not also appear in the “Unique repository facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu at ystorfeydd. Gallwch addasu'r rhestr hon trwy ddileu neu ychwanegu enwau ffeithiau, hyd yn oed rhai arferol, yn ôl yr angen. Ni ddylai enwau ffeithiau sy'n ymddangos yn y rhestr hon hefyd ymddangos yn y rhestr “Ffeithiau ystorfa unigryw”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki dodajo v skladišča. Ta seznam lahko po potrebi spremenite tako, da odstranite ali dodate imena dejstev, tudi po meri. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Edinstvena dejstva skladišča”.

source: This is the list of GEDCOM facts that your users can add to sources. You can modify this list by removing or adding fact names, even custom ones, as necessary. Fact names that appear in this list must not also appear in the “Unique source facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu at ffynonellau. Gallwch addasu'r rhestr hon trwy ddileu neu ychwanegu enwau ffeithiau, hyd yn oed rhai arferol, yn ôl yr angen. Ni ddylai enwau ffeithiau sy'n ymddangos yn y rhestr hon hefyd ymddangos yn y rhestr “Ffeithiau ffynhonnell unigryw”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki dodajo virom. Ta seznam lahko spremenite tako, da po potrebi odstranite ali dodate imena dejstev, tudi po meri. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Edinstvena dejstva virov”.

source: This is the list of GEDCOM facts that your users can only add once to families. For example, if MARR is in this list, users will not be able to add more than one MARR record to a family. Fact names that appear in this list must not also appear in the “All family facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr ddim ond eu hychwanegu unwaith deuluoedd. Er enghraifft, os yw MARR ar y rhestr hon, ni fydd defnyddwyr yn gallu ychwanegu mwy nag un cofnod MARR at deulu. Rhaid i enwau ffeithiau sy'n ymddangos ar y rhestr hon beidio hefyd ag ymddangos yn y rhestr “Pob ffaith deuluol”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki družinam dodajo le enkrat. Če je na primer MARR na tem seznamu, uporabniki družini ne bodo mogli dodati več kot enega zapisa MARR. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Vsa družinska dejstva”.

source: This is the list of GEDCOM facts that your users can only add once to individuals. For example, if BIRT is in this list, users will not be able to add more than one BIRT record to an individual. Fact names that appear in this list must not also appear in the “All individual facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu unwaith yn unig at unigolion. Er enghraifft, os yw BIRT ar y rhestr hon, fydd defnyddwyr ddim yn gallu yn gallu ychwanegu mwy nag un cofnod BIRT at unigolyn. Rhaid i enwau ffeithiau sy'n ymddangos ar y rhestr hon beidio ag ymddangos yn y rhestr "Pob ffaith unigol".
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki osebam dodajo samo enkrat. Če je na primer BIRT na tem seznamu, uporabniki osebi ne bodo mogli dodati več kot enega zapisa BIRT. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Vsa osebna dejstva”.

source: This is the list of GEDCOM facts that your users can only add once to repositories. For example, if NAME is in this list, users will not be able to add more than one NAME record to a repository. Fact names that appear in this list must not also appear in the “All repository facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu unwaith yn unig at ystorfeydd. Er enghraifft, os yw NAME yn y rhestr hon, ni fydd defnyddwyr yn gallu ychwanegu mwy nag un cofnod NAME i gadwrfa. Ni ddylai enwau ffeithiau sy'n ymddangos yn y rhestr hon hefyd ymddangos yn y rhestr “Pob ffaith ystorfa”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki v skladišča dodajo le enkrat. Če je na primer NAME na tem seznamu, uporabniki ne bodo mogli v skladišče dodati več kot enega zapisa NAME. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Vsa dejstva skladišča”.

source: This is the list of GEDCOM facts that your users can only add once to sources. For example, if TITL is in this list, users will not be able to add more than one TITL record to a source. Fact names that appear in this list must not also appear in the “All source facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu unwaith yn unig at ffynonellau. Er enghraifft, os yw TITL yn y rhestr hon, ni fydd defnyddwyr yn gallu ychwanegu mwy nag un cofnod TITL at ffynhonnell. Ni ddylai enwau ffeithiau sy'n ymddangos yn y rhestr hon hefyd ymddangos yn y rhestr “Holl ffeithiau ffynhonnell”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki dodajo virom le enkrat. Če je na primer TITL na tem seznamu, uporabniki ne bodo mogli dodati več kot enega zapisa TITL viru. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Vsa dejstva vira”.

source: This repository has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r storfan hon wedi'i dileu. Bydd angen i gymedrolwr adolygu'r dilead.
sl: To skladišče je izbrisano. Izbris mora pregledati moderator.

source: This repository has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r storfan hon wedi'i dileu. Dylech adolygu'r dileu ac yna %1$s neu %2$s ef.
sl: To skladišče je izbrisano. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This repository has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r storfan hon wedi'i golygu. Mae angen i safonwr adolygu'r newidiadau.
sl: To skladišče je urejeno. Spremembe mora pregledati moderator.

source: This repository has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r storfan hon wedi'i golygu. Dylech adolygu'r newidiadau ac yna %1$s neu %2$s nhw.
sl: To skladišče je urejeno. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This should be a comma or space separated list of facts, in addition to birth and death, that you want to appear in chart boxes such as the pedigree chart. This list requires you to use fact tags as defined in the GEDCOM 5.5.1 standard. For example, if you wanted the occupation to show up in the box, you would add “OCCU” to this field.
cy: Dylai hon fod yn rhestr o ffeithiau sydd wedi'u gwahanu gan goma neu fwlch, yn ogystal â genedigaeth a marwolaeth, rydych am iddyn nhw ymddangos mewn blychau siart fel y siart tras. Mae'r rhestr hon yn gofyn i chi ddefnyddio tagiau ffeithiau fel y rhai wedi'u diffinio yn safon GEDCOM 5.5.1. Er enghraifft, petaech am i'r alwedigaeth ymddangos yn y blwch, byddech yn ychwanegu “OCCU” i'r maes hwn.
sl: To naj bo seznam dejstev, ločenih z vejicami ali presledki, ki jih poleg rojstva in smrti želite prikazati v poljih diagrama, kot je na primer rodovnik. Ta seznam zahteva uporabo oznak dejstev, kot so opredeljene v standardu GEDCOM 5.5.1. Če želite na primer, da se poklic prikaže v polju, v to polje dodate »OCCU«.

source: This source has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r ffynhonnell hon wedi'i dileu. Bydd angen i gymedrolwr adolygu'r dilead.
sl: Ta vir je izbrisan. Izbris mora pregledati moderator.

source: This source has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r ffynhonnell hon wedi'i dileu. Dylech adolygu'r dileu ac yna ei %1$s neu %2$s ef.
sl: Ta vir je izbrisan. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This source has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r ffynhonnell hon wedi'i golygu. Mae angen i gymedrolwr adolygu'r newidiadau.
sl: Ta vir je urejen. Spremembe mora pregledati moderator.

source: This source has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r ffynhonnell hon wedi'i golygu. Dylech adolygu'r newidiadau ac yna %1$s neu %2$s nhw.
sl: Ta vir je urejen. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This type of link is not allowed here.
cy: Nid oes caniatâd i'r math hwn o ddolen yma.
sl: Ta vrsta povezave tukaj ni dovoljena.

# GENITIVE
source: Tishrei
ne: तिश्री
sl: tišri

# INSTRUMENTAL
source: Tishrei
ne: तिश्री
sl: tišri

# LOCATIVE
source: Tishrei
ne: तिश्री
sl: tišri

source: Title in Hebrew
cy: Teitl yn Hebraeg
sl: Naziv v hebrejščini

source: To reduce the size of the download, you can compress the data into a .ZIP file. You will need to uncompress the .ZIP file before you can use it.
cy: Er mwyn lleihau maint y llwytho i lawr, gallwch gywasgu'r data i ffeil .ZIP. Bydd angen i chi ddatgywasgu'r ffeil .ZIP cyn y gallwch ei defnyddio.
sl: Če želite zmanjšati velikost prenosa, lahko podatke stisnete v datoteko .ZIP. Pred uporabo boste morali datoteko .ZIP razširiti.

source: To tell search engines that sitemaps are available, you can use the following links.
cy: I ddweud wrth beiriannau chwilio bod mapiau gwefan ar gael, gallwch ddefnyddio'r dolenni canlynol.
ko: 검색 엔진에 사이트 맵을 사용할 수 있도록하려면 다음 링크를 사용하십시오.
sl: Če želite iskalnikom sporočiti, da so zemljevidi spletišča na voljo, lahko uporabite naslednje povezave.

source: Tuxtla Gutierrez, Mexico
cy: Tuxtla Gutierrez, Mecsico
sl: Tuxtla Gutierrez, Mehika

source: Unique family facts
cy: Ffeithiau teulu unigryw
sl: Edinstvena družinska dejstva

source: Unique individual facts
cy: Ffeithiau unigol unigryw
sl: Edinstvena osebna dejstva

source: Unique repository facts
cy: Ffeithiau ystorfa unigryw
sl: Edinstvena dejstva skladišča

source: Unique source facts
cy: Ffeithiau ffynhonnell unigryw
sl: Edinstvena dejstva vira

# unknown gender
source: Unknown
cy: Anhysbys
ko: 알 수 없음
sl: Neznano

source: Use full source citations
cy: Defnyddio ddyfyniadau ffynhonnell lawn
sl: Uporabi polne vire citiranja

source: Use silhouette images when no highlighted image for that individual has been specified. The images used are specific to the gender of the individual in question.
cy: Defnyddiwch ddelweddau silwét pan nad oes delwedd wedi'i hamlygu ar gyfer yr unigolyn hwnnw. Mae'r delweddau sy'n cael eu defnyddio'n benodol i ryw'r unigolyn dan sylw.
ko: 해당 인물에 대해 강조 표시된 이미지가 지정되지 않은 경우 실루엣 이미지를 사용하십시오. 사용 된 이미지는 해당 인물의 성별에 따라 다릅니다.
sl: Uporabite slike silhuet, kadar za to osebo ni določena nobena označena slika. Uporabljene slike so specifične za spol dane osebe.

source: Use the GeoNames database for autocomplete on places
cy: Defnyddiwch gronfa ddata GeoNames ar gyfer awtolenwi ar leoedd
sl: Za samodejno dokončanje imen krajev uporabite podatkovno bazo GeoNames

source: Use this image for charts and on the individual’s page.
cy: Defnyddiwch y ddelwedd hon ar gyfer siartiau ac ar dudalen yr unigolyn.
sl: To sliko uporabite za diagrame in na osebni strani.

source: View
cy: Gweld
sl: Poglej

source: When adding new close relatives, you can add source citations to the records (individual and family) or to the facts and events (birth, marriage, and death). This option controls whether records or facts will be selected by default.
cy: Wrth ychwanegu perthnasau agos newydd, gallwch ychwanegu dyfyniadau ffynhonnell at y cofnodion (unigolyn a theulu) neu at y ffeithiau a'r digwyddiadau (genedigaeth, priodas a marwolaeth). Mae'r opsiwn hwn yn rheoli a fydd cofnodion neu ffeithiau'n cael eu dewis yn rhagosodedig.
sl: Pri dodajanju novih bližnjih sorodnikov lahko dodate vire zapisom (osebam in družinam) ali dejstvom in dogodkom (rojstvu, poroki in smrti). Ta možnost nadzoruje, ali bodo zapisi oziroma dejstva privzeto izbrani.

source: Wife’s maiden surname becomes new given name
cy: Mae cyfenw cyn priodi gwraig yn dod yn enw newydd
sl: Ženin dekliški priimek postane novo ime

source: Wife’s surname replaced by husband’s surname
cy: Disodlwyd cyfenw gwraig gan gyfenw ei gŵr
sl: Ženin priimek zamenjan z moževim priimkom

source: Yes
cy: Iawn
sl: Da

source: You can make it easier to search for married women by recording their married name. However not all women take their husband’s surname, so beware of introducing incorrect information into your database.
cy: Gallwch ei gwneud yn haws i chwilio am fenywod priod drwy gofnodi eu henw priod. Fodd bynnag, nid yw pob merch yn cymryd cyfenw ei gŵr, felly byddwch yn ofalus rhag cyflwyno gwybodaeth anghywir i’ch cronfa ddata.
sl: Iskanje poročenih žensk lahko olajšate tako, da zabeležite njihov zakonski priimek. Vendar pa vse ženske ne prevzamejo moževega priimka, zato bodite previdni pri vnosu napačnih podatkov v svojo podatkovno bazo.

source: Your user account does not have “automatically accept changes” enabled. You will only be able to change one record at a time.
cy: Nid oes gan eich cyfrif defnyddiwr y nodwedd “derbyn newidiadau yn awtomatig” wedi'i alluogi. Dim ond un cofnod y byddwch yn gallu ei newid ar y tro.
sl: Vaš uporabniški račun nima omogočenega “samodejnega sprejemanja sprememb”. Naenkrat boste lahko spreminjali samo en zapis.

# FEMALE
source: adopted name
cy: enw mabwysiedig
sl: posvojeno ime

# MALE
source: adopted name
cy: enw mabwysiedig
sl: posvojeno ime

source: adoption
cy: mabwysiadu
sl: posvojitev

# FEMALE
source: also known as
cy: hefyd yn hysbys fel
sl: znana tudi kot

# MALE
source: also known as
cy: hefyd yn hysbys fel
sl: znan tudi kot

source: always
cy: bob tro
sl: vedno

source: birth
cy: geni
sl: rojstvo

# FEMALE
source: birth name
cy: enw geni
sl: rojstno ime

# MALE
source: birth name
cy: enw geni
sl: rojstno ime

source: burial
cy: claddu
sl: pogreb

source: by
cy: gan
sl: od

source: census added
cy: ychwanegwyd y cyfrifiad
sl: dodan popis prebivalcev

# FEMALE
source: change of name
cy: newid enw
sl: sprememba imena

# MALE
source: change of name
cy: newid enw
sl: sprememba imena

source: death
cy: marwolaeth
sl: smrt

# FEMALE
source: estate name
cy: enw ystad
sl: hišno ime

# MALE
source: estate name
cy: enw ystad
sl: hišno ime

source: gender
cy: rhyw
ko: 성별
sl: Spol

source: hh:mm or hh:mm:ss
cy: aa:mm neu aa:mm:ee
sl: hh:mm ali hh:mm:ss

# FEMALE
source: immigration name
cy: enw mewnfudo
sl: ime po priselitvi

# MALE
source: immigration name
cy: enw mewnfudo
sl: ime po priselitvi

source: marriage
cy: priodas
sl: poroka

# FEMALE
source: married name
cy: enw priod
sl: poročno ime

# MALE
source: married name
cy: enw priod
sl: poročno ime

source: never
cy: byth
sl: nikoli

# FEMALE
source: religious name
cy: enw crefyddol
sl: versko ime

# MALE
source: religious name
cy: enw crefyddol
sl: versko ime

source: webtrees uses UTF-8 encoding for accented letters, special characters and non-Latin scripts. If you want to use this GEDCOM file with genealogy software that does not support UTF-8, then you can create it using ISO-8859-1 encoding.
cy: mae webtrees yn defnyddio amgodio UTF-8 ar gyfer llythrennau acennog, odau arbennig a sgriptiau heblaw Lladin. Os ydych chi am ddefnyddio'r ffeil GEDCOM hon gyda meddalwedd achyddiaeth nad yw'n cefnogi UTF-8, yna gallwch ei greu gan ddefnyddio amgodio ISO-8859-1.
sl: webtrees uporablja kodiranje UTF-8 za naglašene črke, posebne znake in ne-latinske pisave. Če želite to datoteko GEDCOM uporabiti z rodoslovnimi programi, ki ne podpirajo UTF-8, jo lahko ustvarite s kodiranjem ISO-8859-1.

# paper size
source: A3
ne: ए थ्री

# paper size
source: A4
ne: ए फोर

# Abbreviation for Persian month: Aban
source: Aban
ne: अबान

# GENITIVE
source: Aban
ne: अबान

# INSTRUMENTAL
source: Aban
ne: अबान

# LOCATIVE
source: Aban
ne: अबान

# GENITIVE
source: Adar
ne: अडार

# INSTRUMENTAL
source: Adar
ne: अडार

# LOCATIVE
source: Adar
ne: अडार

# GENITIVE
source: Av
ne: एभ

# INSTRUMENTAL
source: Av
ne: एभ

# LOCATIVE
source: Av
ne: एभ

# GENITIVE
source: Azar
ne: अजार

# INSTRUMENTAL
source: Azar
ne: अजार

# LOCATIVE
source: Azar
ne: अजार

# Abbreviation for Persian month: Bahman
source: Bah
ne: बाह

# GENITIVE
source: Bahman
ne: बाहमन

# INSTRUMENTAL
source: Bahman
ne: बाहमन

# LOCATIVE
source: Bahman
ne: बाहमन

source: CKEditor™
ne: CKEditor सम्पादन ™

source: Decidi
ne: निर्णय

# font name
source: DejaVu
ne: देजाभु

source: Duodi
ne: डुओडी

# GENITIVE
source: Elul
ne: एलउल

# INSTRUMENTAL
source: Elul
ne: एलउल

# LOCATIVE
source: Elul
ne: एलउल

# Abbreviation for Persian month: Esfand
source: Esf
ne: इएसफ

# GENITIVE
source: Esfand
ne: एसफान्ड

# INSTRUMENTAL
source: Esfand
ne: इस्फान्ड

# LOCATIVE
source: Esfand
ne: इस्फान्ड

source: Esri/ArcGIS
ne: एस्री/ArcGIS

source: F.A.B.
ne: एफ.ए.बी.

source: FamilySearch ID
ko: 가족검색 ID
ne: परिवार Search ID

# Abbreviation for Persian month: Farvardin
source: Far
ne: टाढा

# GENITIVE
source: Farvardin
ne: फार्भार्डिन

# INSTRUMENTAL
source: Farvardin
ne: फार्भार्डिन

# LOCATIVE
source: Farvardin
ne: फार्भार्डिन

source: GEDCOM
ne: GEDCOM फाइल

source: GEDCOM 7
ne: गेडकम 7

source: HTML
ne: एचटीएमएल

# GENITIVE
source: Kislev
ne: किस्लेभ

# INSTRUMENTAL
source: Kislev
ne: किस्लेभ

# LOCATIVE
source: Kislev
ne: किस्लेभ

# Abbreviation for Persian month: Mordad
source: Mor
ne: मोर

# GENITIVE
source: Mordad
ne: मोर्डाद

# INSTRUMENTAL
source: Mordad
ne: मोर्डाद

# LOCATIVE
source: Mordad
ne: मोर्डाद

source: Nonidi
ne: नोनिडी

source: Octidi
ne: अक्टोडी

# Abbreviation for Persian month: Ordibehesht
source: Ord
ne: ओआरडी

source: Panama City, Panama
cy: Dinas Panama, Panama
ne: पनामा सिटी, पनामा

source: Primidi
ne: प्रिमिडी

source: Quartidi
ne: क्वार्टिडी

source: Quintidi
ne: क्वीन्तिदी

source: SSL/TLS
ne: एसएसएल/टीएसएल

source: STARTTLS
ne: स्टारटीटीएलएस

source: Septidi
ne: सेप्टिडी

# GENITIVE
source: Sivan
ne: सिभान

# INSTRUMENTAL
source: Sivan
ne: सिभान

# LOCATIVE
source: Sivan
ne: सिभान

source: Statcounter™
ne: स्ट्याटकाउन्टर

# GENITIVE
source: Tamuz
ne: टामुज

# INSTRUMENTAL
source: Tamuz
ne: टामुज

# LOCATIVE
source: Tamuz
ne: टामुज

# GENITIVE
source: Tevet
ne: टेभेट

# INSTRUMENTAL
source: Tevet
ne: टेभेट

# LOCATIVE
source: Tevet
ne: टेभेट

# Abbreviation for Persian month: Tir
source: Tir
ne: टिर

# GENITIVE
source: Tir
ne: टिर

# INSTRUMENTAL
source: Tir
ne: टिर

# LOCATIVE
source: Tir
ne: टिर

source: Tridi
ne: त्रिदी

source: URL
ne: यूआर्‌एल URL

source: ZIP
ne: जीप

source: Bing Maps™
cy: Mapiau Bing ™

source: Cordoba, Argentina
cy: Cordoba, yr Ariannin

source: Google Maps™
cy: Mapiau Google™
