Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: If a visitor to the website has not selected a preferred language in their browser preferences, or they have selected an unsupported language, then this language will be used. Typically this applies to search engines.
cy: Os nad yw ymwelydd â'r wefan wedi dewis iaith yn ei ddewisiadau porwr, neu os yw wedi dewis iaith heb gefnogaeth, yna bydd yr iaith hon yn cael ei defnyddio. Fel arfer mae hyn yn berthnasol i beiriannau chwilio.
hy: Եթե կայքի այցելուն չի ընտրել նախընտրած լեզուն իր դիտարկիչի նախապատվություններում, կամ ընտրել է չաջակցվող լեզու, ապա այս լեզուն կօգտագործվի: Սովորաբար դա վերաբերում է որոնման համակարգերին:
ko: 웹사이트 방문자가 브라우저 기본 설정에서 기본 언어를 선택하지 않았거나 지원되지 않는 언어를 선택한 경우 이 언어가 사용됩니다. 일반적으로 이것은 검색 엔진에 적용됩니다.
ne: यदि वेबसाइटमा आगन्तुकले आफ्नो ब्राउजर प्राथमिकताहरूमा रुचाइएको भाषा चयन गरेको छैन, वा तिनीहरूले असमर्थित भाषा चयन गरेका छन् भने, यो भाषा प्रयोग गरिनेछ। सामान्यतया यो खोज इन्जिनहरूमा लागू हुन्छ।
sl: Če obiskovalec spletišča v nastavitvah svojega brskalnika ni določil želenega jezika ali je določil nepodprt jezik, bo uporabljen ta jezik. Običajno ta nastavitev velja za iskalnike.

source: Show list of family trees
cy: Dangos rhestr o gartiau achau
hy: Ցույց տալ տոհմածառերի ցանկը
ko: 가계도 목록 표시
ne: वंशवृक्षको सूचि देखाउनुहोस्
sl: Prikaži seznam družinskih dreves

source: For websites with more than one family tree, this option will show the list of family trees in the main menu, the search pages, etc.
cy: Ar gyfer gwefannau sydd â mwy nag un cart achau, bydd yr opsiwn hwn yn dangos y rhestr o cartiau achau yn y brif ddewislen, y tudalennau chwilio, ac ati.
hy: Մեկից ավելի տոհմածառ ունեցող կայքերի համար այս տարբերակը ցույց կտա տոհմածառերի ցանկը հիմնական ցանկում, որոնման էջերը և այլն:
ko: 하나 이상의 가계도가 있는 웹사이트의 경우 이 옵션은 주 메뉴, 검색 페이지 등에 가계도 목록을 표시합니다.
ne: एक भन्दा बढी पारिवारिक वृक्ष भएका वेबसाइटहरूको लागि, यो विकल्पले मुख्य मेनु, खोज पृष्ठहरू, आदिमा पारिवारिक रूखहरूको सूची देखाउनेछ।
sl: Za spletišča z več kot enim družinskim drevesom bo ta možnost prikazala seznam družinskih dreves v glavnem meniju, iskalnih straneh itd.

source: Welcome text on sign-in page
cy: Y testun croeso ar y dudalen fewngofnodi
hy: Ողջույնի տեքստ մուտքի էջում
ko: 로그인 페이지의 환영 텍스트
ne: साइन-इन पृष्ठमा स्वागत पाठ
sl: Pozdravno besedilo na prijavni strani

source: Custom welcome text
cy: Testun croeso cyfaddas
hy: Պատվերով ողջույնի տեքստ
ko: 사용자 정의 Welcome Text
ne: अनुकूलन स्वागत पाठ
sl: Pozdravno besedilo po meri

source: To set this text for other languages, you must switch to that language, and visit this page again.
cy: I osod y testun hwn ar gyfer ieithoedd eraill, rhaid i chi newid i'r iaith honno, ac ymweld â'r dudalen hon eto.
hy: Այս տեքստը այլ լեզուների համար նախադրելու համար դուք պետք է անցնեք այդ լեզվին և նորից այցելեք այս էջը:
ko: 이 언어를 다른 언어로 설정하려면 해당 언어로 전환 한 후이 페이지를 다시 방문해야합니다.
ne: अन्य भाषाहरूको लागि यो पाठ सेट गर्न, तपाईंले त्यो भाषामा स्विच गर्नुपर्छ, र यो पृष्ठ फेरि भ्रमण गर्नुपर्छ।
sl: Če želite nastaviti to besedilo za druge jezike, morate preklopiti na izbrani jezik in znova obiskati to stran.

source: Allow visitors to request a new user account
cy: Caniatáu i ymwelwyr ofyn am gyfrif defnyddiwr newydd
hy: Թույլ տվեք այցելուներին նոր օգտվողի հաշիվ պահանջել
ko: 방문자가 새 사용자 계정을 요청할 수 있도록 허용
ne: आगन्तुकहरूलाई नयाँ प्रयोगकर्ता खाता अनुरोध गर्न अनुमति दिनुहोस्
sl: Dovoli obiskovalcem, da zahtevajo nov uporabniški račun

source: The new user will be asked to confirm their email address before the account is created.
cy: Bydd gofyn i'r defnyddiwr newydd gadarnhau ei gyfeiriad e-bost cyn i'r cyfrif gael ei greu.
hy: Նոր օգտվողին կպահանջվի հաստատել իր էլփոստի հասցեն՝ նախքան հաշիվը ստեղծելը:
ko: 계정을 만들기 전에 새 사용자에게 전자 메일 주소를 확인하라는 메시지가 표시됩니다.
ne: खाता सिर्जना गर्नु अघि नयाँ प्रयोगकर्तालाई उनीहरूको इमेल ठेगाना पुष्टि गर्न सोधिनेछ।
sl: Novi uporabnik bo moral potrditi svoj e-poštni naslov, preden bo ustvarjen njegov uporabniški račun.

source: Details of the new user will be sent to the genealogy contact for the corresponding family tree.
cy: Bydd manylion y defnyddiwr newydd yn cael ei anfon at y cyswllt hel achau ar gyfer y cart achau gyfatebol.
hy: Նոր օգտատիրոջ տվյալները կուղարկվեն համապատասխան տոհմածառի կոնտակտներին:
ko: 새 사용자의 상세 정보는 해당 가계도의 계보 연락처로 전송됩니다.
ne: नयाँ प्रयोगकर्ताहरूको विवरण सम्बन्धित पारिवारिक वृक्षका लागि वंशावली सम्पर्कमा पठाइनेछ ।
sl: Podrobnosti o novem uporabniku bo prejel rodoslovni kontakt za ustrezno družinsko drevo.

source: An administrator must approve the new user account and select an access level before the user can sign in.
cy: Rhaid i weinyddwr gymeradwyo'r cyfrif defnyddiwr newydd a dewis lefel mynediad cyn y gall y defnyddiwr fewngofnodi.
hy: Ադմինիստրատորը պետք է հաստատի նոր օգտվողի հաշիվը և ընտրի մուտքի մակարդակ, նախքան օգտատերը մուտք գործի:
ko: 관리자는 새 사용자 계정을 승인하고 액세스 수준을 선택해야 사용자가 로그인할 수 있습니다.
ne: प्रयोगकर्ताले साइन इन गर्न सक्नु अघि प्रशासकले नयाँ प्रयोगकर्ता खाता अनुमोदन गर्नुपर्छ र पहुँच स्तर चयन गर्नुपर्छ।
sl: Skrbnik bo moral odobriti nov uporabniški račun in izbrati raven dostopa, preden se bo lahko uporabnik prijavil.

source: Show acceptable use agreement on “Request a new user account” page
cy: Dangos cytundeb defnydd derbyniol ar dudalen “Gofyn am gyfrif defnyddiwr newydd”
hy: Ցույց տալ ընդունելի օգտագործման համաձայնագիրը «Պահանջել նոր օգտվողի հաշիվ» էջում
ko: "새 사용자 계정 요청" 페이지에 허용 가능한 사용 계약 표시
ne: "नयाँ प्रयोगकर्ता खाता अनुरोध गर्नुहोस्" पृष्ठमा स्वीकार्य प्रयोग सम्झौता देखाउनुहोस्
sl: Na strani “Zahtevaj nov uporabniški račun” prikaži sporazum o sprejemljivi uporabi

source: Synchronize family trees with GEDCOM files
cy: Cydweddu cart achau teuluol â ffeiliau GEDCOM
hy: Համաժամացրեք տոհմածառերը GEDCOM ֆայլերի հետ
ko: GEDCOM 파일과 가계도 동기화
ne: GEDCOM फाइलहरूसँग पारिवारिक रूखहरू सिङ्क्रोनाइज गर्नुहोस्
sl: Sinhronizirajte družinska drevesa z datotekami GEDCOM

source: Create, update, and delete a family tree for every GEDCOM file in the data folder.
cy: Creu, diweddaru, a dileu cart achau ar gyfer pob ffeil GEDCOM yn y ffolder data.
hy: Ստեղծեք, թարմացրեք և ջնջեք տոհմածառ յուրաքանչյուր GEDCOM ֆայլի համար տվյալների թղթապանակում:
ko: 데이터 폴더에 있는 모든 GEDCOM 파일에 대한 가계도를 생성, 업데이트 및 삭제합니다.
ne: डेटा फोल्डरमा प्रत्येक GEDCOM फाइलको लागि पारिवारिक रूख सिर्जना गर्नुहोस्, अद्यावधिक गर्नुहोस् र मेटाउनुहोस्।
sl: Ustvarite, posodobite in izbrišite družinsko drevo za vsako datoteko GEDCOM v podatkovni mapi.

source: Caution! This may take a long time. Be patient.
cy: Rhybudd! Gall hyn gymryd amser hir. Byddwch yn amyneddgar.
hy: զգույշ Սա կարող է երկար ժամանակ տևել: Եղեք համբերատար։
ko: 주의! 시간이 오래 걸릴 수 있습니다. 인내심을 가지세요.
ne: सावधान! यसले लामो समय लिन सक्छ। धैर्यवान हुनुहोस्।
sl: Pozor! Postopek lahko traja dolgo časa. Bodite potrpežljivi.

source: Standard GEDCOM tags
hy: Ստանդարտ GEDCOM պիտակներ
ne: मानक GEDCOM ट्यागहरू

source: The GEDCOM standard provides a large number of data-entry fields, called tags.
hy: GEDCOM ստանդարտը ապահովում է տվյալների մուտքագրման մեծ թվով դաշտեր, որոնք կոչվում են պիտակներ:
ko: GEDCOM 표준은 태그라고 하는 많은 데이터 입력 필드를 제공합니다.
ne: GEDCOM मानकले डेटा-प्रविष्टि क्षेत्रहरूको ठूलो संख्या प्रदान गर्दछ, ट्याग भनिन्छ।

source: Some of these GEDCOM tags are used infrequently or never used.
hy: Այս GEDCOM պիտակներից մի քանիսը օգտագործվում են հազվադեպ կամ երբեք չեն օգտագործվում:
ko: 이러한 GEDCOM 태그 중 일부는 드물게 사용되거나 전혀 사용되지 않습니다.
ne: यी मध्ये केही GEDCOM ट्यागहरू कहिलेकाहीं प्रयोग गरिन्छ वा कहिल्यै प्रयोग हुँदैन।

source: You can simplify the edit forms by hiding GEDCOM tags that you do not use.
hy: Դուք կարող եք պարզեցնել խմբագրման ձևերը՝ թաքցնելով GEDCOM պիտակները, որոնք դուք չեք օգտագործում:
ko: 사용하지 않는 GEDCOM 태그를 숨겨서 편집 양식을 단순화할 수 있습니다.
ne: तपाईंले प्रयोग नगर्ने GEDCOM ट्यागहरू लुकाएर सम्पादन फारमहरूलाई सरल बनाउन सक्नुहुन्छ।

source: Names
cy: Enwau
hy: Անուններ
ko: 이름
ne: नामहरू
sl: Imena

source: Hide GEDCOM tags
hy: Թաքցնել GEDCOM պիտակները
ko: GEDCOM 태그 숨기기
ne: GEDCOM ट्यागहरू लुकाउनुहोस्

source: Addresses
hy: Հասցեներ
ko: 주소
ne: ठेगानाहरू

source: Source citations
hy: Աղբյուրի մեջբերումներ
ko: 출처 인용
ne: स्रोत उद्धरण

source: LDS church
hy: LDS եկեղեցի
ne: LDS चर्च

source: Identifiers
hy: Նույնացուցիչներ
ko: 식별자
ne: परिचय गराउनेहरू

source: The next version of the GEDCOM standard will add new tags and remove old ones. You can use some of the new tags now.
hy: GEDCOM ստանդարտի հաջորդ տարբերակը կավելացնի նոր պիտակներ և կհեռացնի հինները: Այժմ կարող եք օգտագործել որոշ նոր պիտակներ:
ne: GEDCOM मानकको अर्को संस्करणले नयाँ ट्यागहरू थप्नेछ र पुरानाहरूलाई हटाउनेछ। तपाईंले अब केही नयाँ ट्यागहरू प्रयोग गर्न सक्नुहुन्छ।

source: Time of birth and time of death
hy: Ծննդյան և մահվան ժամանակը
ne: जन्म समय र मृत्यु समय

source: Family fact
hy: Ընտանեկան փաստ
ne: पारिवारिक तथ्य

source: Many genealogy applications define their own custom GEDCOM tags and webtrees will be able to display most of them.
hy: Շատ ծագումնաբանության հավելվածներ սահմանում են իրենց հատուկ GEDCOM պիտակները, և վեբ ծառերը կկարողանան ցուցադրել դրանց մեծ մասը:
ne: धेरै वंशावली अनुप्रयोगहरूले तिनीहरूको आफ्नै अनुकूलन GEDCOM ट्यागहरू परिभाषित गर्दछ र webtrees तिनीहरूमध्ये धेरै प्रदर्शन गर्न सक्षम हुनेछ।

source: It is not recommended to use custom GEDCOM tags. This data can be lost when you transfer it to other applications.
hy: Խորհուրդ չի տրվում օգտագործել հատուկ GEDCOM պիտակներ: Այս տվյալները կարող են կորչել, երբ դրանք տեղափոխեք այլ հավելվածներ:
ne: यसलाई अनुकूलन GEDCOM ट्यागहरू प्रयोग गर्न सिफारिस गरिएको छैन। तपाईंले अन्य अनुप्रयोगहरूमा स्थानान्तरण गर्दा यो डाटा हराउन सक्छ।

source: To create new data using custom tags, you need to enable them.
hy: Հատուկ պիտակների միջոցով նոր տվյալներ ստեղծելու համար դուք պետք է միացնեք դրանք:
ne: अनुकूलन ट्यागहरू प्रयोग गरेर नयाँ डाटा सिर्जना गर्न, तपाईंले तिनीहरूलाई सक्षम गर्न आवश्यक छ।

source: Individual facts and events
hy: Անհատական փաստեր և իրադարձություններ
ne: व्यक्तिगत तथ्य र घटनाहरू

source: Family facts and events
hy: Ընտանեկան փաստեր և իրադարձություններ
ne: पारिवारिक तथ्य र घटनाहरू

source: GEDCOM errors
cy: Gwallau GEDCOM
hy: GEDCOM սխալներ
ko: GEDCOM 오류
ne: GEDCOM त्रुटिहरू
sl: GEDCOM napake

source: Hide these errors
hy: Թաքցնել այս սխալները
ne: यी त्रुटिहरू लुकाउनुहोस्

source: No errors have been found.
cy: Heb ganfod unrhyw wallau.
hy: Սխալներ չեն հայտնաբերվել:
ko: 오류가 발견되지 않았습니다.
ne: कुनै त्रुटिहरू फेला परेका छैनन्।
sl: Ne najdem napak.

source: show more
cy: dangos rhagor
hy: ցույց տալ ավելին
ko: 자세히 보기
sl: Pokaži več

source: Family tree title
cy: Teitl y cart achau
hy: Տոհմածառի վերնագիր
ko: 가계도 이름
ne: पारिवारिक रूख शीर्षक
sl: Naslov družinskega drevesa

source: Avoid spaces and punctuation. A family name might be a good choice.
cy: Osgoi bylchau ac atalnodi. Efallai y bydd enw teulu yn ddewis da.
hy: Խուսափեք բացատներից և կետադրական նշաններից: Ընտանեկան անունը կարող է լավ ընտրություն լինել:
ko: 공백과 구두점을 피하십시오. 성은 좋은 선택일 수 있습니다.
ne: खाली ठाउँहरू र विराम चिन्हहरू नदिनुहोस्। पारिवारिक नाम राम्रो विकल्प हुन सक्छ।
sl: Ne uporabljajte presledkov in ločil. Dobra izbira je priimek družine.

source: create
cy: creu
hy: ստեղծել
ko: 만들기
ne: सिर्जना गर्नुहोस्
sl: Ustvari

source: After creating the family tree, you will be able to import data from a GEDCOM file.
cy: Ar ôl creu'r cart achau, byddwch yn gallu mewnforio data o ffeil GEDCOM.
hy: Տոհմածառը ստեղծելուց հետո դուք կկարողանաք տվյալներ ներմուծել GEDCOM ֆայլից:
ko: 가계도를 만든 후에는 GEDCOM 파일에서 데이터를 가져올 수 있습니다.
ne: पारिवारिक वृक्ष सिर्जना गरेपछि, तपाइँ GEDCOM फाइलबाट डाटा आयात गर्न सक्षम हुनुहुनेछ।
sl: Ko boste ustvarili družinsko drevo, boste vanj lahko uvozili podatke iz datoteke GEDCOM.

source: Merge
cy: Cyfuno
hy: Միաձուլել
ko: 병합
ne: मर्ज गर्नुहोस्
sl: Združi

source: No duplicates have been found.
cy: Heb ganfod unrhyw gofnodion dyblyg.
hy: Կրկնօրինակներ չեն գտնվել:
ko: 중복 항목이 없습니다.
ne: कुनै नक्कलहरू फेला परेका छैनन्।
sl: Ne najdem nobenih dvojnikov.

source: Export preferences
cy: Dewisiadau allforio
hy: Արտահանման նախապատվություններ
ko: 환경설정 내보내기
ne: प्राथमिकताहरू निर्यात गर्नुहोस्
sl: Nastavitve izvoza

source: This will delete all the genealogy data from “%s” and replace it with data from a GEDCOM file.
cy: Bydd hyn yn dileu'r holl ddata achau o “%s” ac yn ei amnewid gyda data o ffeil GEDCOM.
hy: Սա կջնջի բոլոր ծագումնաբանական տվյալները «%s»-ից և այն կփոխարինի GEDCOM ֆայլի տվյալներով:
ko: 그러면 “%s”에서 모든 계보 데이터가 삭제되고 GEDCOM 파일의 데이터로 대체됩니다.
ne: यसले "%s" बाट सबै वंशावली डाटा मेटाउनेछ र यसलाई GEDCOM फाइलबाट डाटासँग बदल्नेछ।
sl: Uvoz bo izbrisal vse rodoslovne podatke v drevesu “%s” in jih zamenjal s podatki iz datoteke GEDCOM.

source: You have selected a GEDCOM file with a different name. Is this correct?
cy: Rydych wedi dewis ffeil GEDCOM gydag enw gwahanol. A yw hyn yn iawn?
hy: Դուք ընտրել եք GEDCOM ֆայլ այլ անունով: Սա ճի՞շտ է?
ko: 다른 이름의 GEDCOM 파일을 선택했습니다. 맞습니까?
ne: तपाईंले फरक नामको GEDCOM फाइल चयन गर्नुभएको छ। के यो सहि छ?
sl: Izbrali ste datoteko GEDCOM z drugim imenom. Je to pravilno?

source: Select a GEDCOM file to import
cy: Dewis ffeil GEDCOM i'w mewnforio
hy: Ներմուծելու համար ընտրեք GEDCOM ֆայլ
ko: 가져온 GEDCOM 파일에서 선택
ne: आयात गर्न GEDCOM फाइल चयन गर्नुहोस्
sl: Izberite datoteko GEDCOM za uvoz

source: No GEDCOM files found.
cy: Heb ganfod ffeiliau GEDCOM.
hy: GEDCOM ֆայլեր չեն գտնվել:
ko: GEDCOM 파일을 찾을 수 없습니다.
ne: कुनै GEDCOM फाइलहरू फेला परेनन्।
sl: Ne najdem datoteke GEDCOM.

source: Import preferences
cy: Dewisiadau mewnforio
hy: Ներմուծման նախապատվություններ
ko: 환경설정 가져오기
ne: प्राथमिकताहरू आयात गर्नुहोस्
sl: Nastavitve uvoza

source: automatic
hy: ավտոմատ
ne: स्वचालित

source: Keep media objects
cy: Cadw gwrthrychau cyfryngau
hy: Պահպանեք լրատվամիջոցների օբյեկտները
ko: 미디어 개체 유지
ne: मिडिया वस्तुहरू राख्नुहोस्
sl: Obdrži medijske predmete

source: If you have created media objects in webtrees, and have subsequently edited this GEDCOM file using genealogy software that deletes media objects, then select this option to merge the current media objects with the new GEDCOM file.
cy: Os ydych chi wedi creu gwrthrychau cyfryngau yn webtrees, ac wedi golygu'r ffeil GEDCOM hon wedi hynny gan ddefnyddio rhaglen achau sy'n dileu gwrthrychau cyfryngau, yna dewiswch yr opsiwn hwn i gyfuno'r gwrthrychau cyfryngau cyfredol â'r ffeil GEDCOM newydd.
hy: Եթե դուք ստեղծել եք մեդիա օբյեկտներ վեբ ծառերում և այնուհետև խմբագրել եք այս GEDCOM ֆայլը՝ օգտագործելով ծագումնաբանական ծրագրակազմ, որը ջնջում է մեդիա օբյեկտները, ապա ընտրեք այս տարբերակը՝ ընթացիկ մեդիա օբյեկտները նոր GEDCOM ֆայլի հետ միացնելու համար:
ko: 웹트리에서 미디어 개체를 생성한 후 미디어 개체를 삭제하는 계보 소프트웨어를 사용하여 이 GEDCOM 파일을 편집한 경우 이 옵션을 선택하여 현재 미디어 개체를 새 GEDCOM 파일과 병합합니다.
ne: यदि तपाईंले वेबट्रीहरूमा मिडिया वस्तुहरू सिर्जना गर्नुभएको छ, र पछि मिडिया वस्तुहरू मेटाउने वंशावली सफ्टवेयर प्रयोग गरेर यो GEDCOM फाइल सम्पादन गर्नुभएको छ भने, नयाँ GEDCOM फाइलसँग हालको मिडिया वस्तुहरू मर्ज गर्न यो विकल्प चयन गर्नुहोस्।
sl: Če ste v webtrees ustvarili medijske predmete in ste pozneje uredili datoteko GEDCOM s programsko opremo, ki izbriše medijske predmete, potrdite to polje, da združite trenutne medijske predmete z novo datoteko GEDCOM.

source: Add spaces where long lines were wrapped
cy: Ychwanegu bylchau lle roedd llinellau hir wedi'u lapio
hy: Ավելացնել բացատներ, որտեղ երկար տողեր են փաթաթված
ko: 긴 줄이 줄 바꿈된 공백 추가
ne: खाली ठाउँहरू थप्नुहोस् जहाँ लामो लाइनहरू बेरिएका थिए
sl: Dodaj presledke ob prelomih dolgih vrstic

source: If you created this GEDCOM file using genealogy software that omits spaces when splitting long lines, then select this option to reinsert the missing spaces.
cy: Os ydych wedi creu'r ffeil GEDCOM hon gan ddefnyddio rhaglen achau sy'n hepgor bylchau wrth rannu llinellau hir, yna dewiswch yr opsiwn hwn i ail fewnosod y bylchau coll.
hy: Եթե դուք ստեղծել եք այս GEDCOM ֆայլը՝ օգտագործելով ծագումնաբանական ծրագրակազմ, որը բաց է թողնում երկար տողերը բաժանելիս, ապա ընտրեք այս տարբերակը՝ բացակայող բացերը նորից զետեղելու համար:
ko: 긴 줄을 분할할 때 공백을 생략하는 계보 소프트웨어를 사용하여 이 GEDCOM 파일을 만든 경우 누락된 공백을 다시 삽입하려면 이 옵션을 선택하십시오.
ne: यदि तपाईंले यो GEDCOM फाइल वंशावली सफ्टवेयर प्रयोग गरेर सिर्जना गर्नुभयो जसले लामो लाइनहरू विभाजन गर्दा खाली ठाउँहरू छोड्छ, त्यसपछि छुटेका ठाउँहरू पुन: घुसाउन यो विकल्प चयन गर्नुहोस्।
sl: Če ste datoteko GEDCOM ustvarili z rodoslovno programsko opremo, ki izpusti presledke pri prelomih dolgih vrstic, izberite to možnost, da znova vstavite manjkajoče presledke.

source: Remove the GEDCOM media path from filenames
cy: Tynnu llwybr cyfryngau GEDCOM o enwau ffeiliau
hy: Հեռացրեք GEDCOM մեդիա ուղին ֆայլերի անուններից
ko: 파일 이름에서 GEDCOM 미디어 경로를 제거하십시오
ne: फाइलनामहरूबाट GEDCOM मिडिया मार्ग हटाउनुहोस्
sl: Odstrani medijsko pot iz imen datotek v datoteki GEDCOM

source: Some genealogy software creates GEDCOM files that contain media filenames with full paths. These paths will not exist on the web-server. To allow webtrees to find the file, the first part of the path must be removed.
cy: Mae rhai rhaglenni achau'n creu ffeiliau GEDCOM sy'n cynnwys enwau ffeiliau cyfryngau gyda llwybrau llawn. Ni fydd y llwybrau hyn yn bodoli ar y weinydd gwe. Er mwyn caniatáu i wefannau ganfod y ffeil, rhaid tynnu rhan gyntaf y llwybr.
hy: Որոշ ծագումնաբանական ծրագրեր ստեղծում են GEDCOM ֆայլեր, որոնք պարունակում են մեդիա ֆայլերի անուններ՝ ամբողջական ուղիներով: Այս ուղիները չեն լինի վեբ-սերվերի վրա: Որպեսզի վեբ ծառերը կարողանան գտնել ֆայլը, ճանապարհի առաջին մասը պետք է հեռացվի:
ko: 일부 계보 소프트웨어는 전체 경로가 포함 된 미디어 파일 이름이 포함 된 GEDCOM 파일을 생성합니다. 이 경로는 웹 서버에 존재하지 않습니다. 웹 트리가 파일을 찾도록하려면 경로의 첫 부분을 제거해야합니다.
ne: केही वंशावली सफ्टवेयरले GEDCOM फाइलहरू बनाउँछ। जसमा पूर्ण पाथसहित मिडिया फाइलनामहरू छन्। यी मार्गहरू वेब-सर्भरमा अवस्थित हुने छैनन्। वेबट्रीलाई फाइल फेला पार्न अनुमति दिन, पाथको पहिलो भाग हटाउनु पर्छ।
sl: Nekateri rodoslovni programi ustvarijo datoteke GEDCOM, ki vsebujejo imena medijskih datotek s polnimi potmi. Te poti na spletnem strežniku ne obstajajo. Če želite webtrees omogočiti, da najde datoteke, morate odstraniti prvi del poti.

source: For example, if the GEDCOM file contains %1$s and webtrees expects to find %2$s in the media folder, then you would need to remove %3$s.
cy: Er enghraifft, os yw'r ffeil GEDCOM yn cynnwys %1$s a bod webtrees yn disgwyl dod o hyd i %2$s yn y ffolder cyfryngau, yna byddai angen i chi dynnu %3$s.
hy: Օրինակ, եթե GEDCOM ֆայլը պարունակում է %1$s, և webtrees-ն ակնկալում է գտնել %2$s մեդիա թղթապանակում, ապա ձեզ հարկավոր է հեռացնել %3$s-ը:
ko: 예를 들어, GEDCOM 파일에 %1$s가 포함되어 있고 웹트리가 미디어 폴더에서 %2$s를 찾을 것으로 예상하면 %3$s를 제거해야 합니다.
ne: उदाहरणका लागि, यदि GEDCOM फाइलमा %1$s छ र webtrees ले मिडिया फोल्डरमा %2$s फेला पार्ने अपेक्षा गर्दछ भने, तपाईंले %3$s हटाउन आवश्यक छ।
sl: Na primer, če datoteka GEDCOM vsebuje %1$s in webtrees pričakuje datoteko %2$s v medijski mapi, potem je treba odstraniti %3$s.

source: In a family tree, each record has an internal reference number (called an “XREF”) such as “F123” or “R14”.
cy: O fewn cart achau, mae gan bob cofnod gyfeirnod mewnol (sef, “XREF”) fel “F123” neu “R14”.
hy: Տոհմածառում յուրաքանչյուր գրառում ունի ներքին հղման համար (կոչվում է «XREF»), օրինակ՝ «F123» կամ «R14»:
ko: 가계도에서 각 기록에는 "F123" 또는 "R14"와 같은 내부 참조 번호("XREF"라고 함)가 있습니다.
ne: पारिवारिक रूखमा, प्रत्येक रेकर्डमा आन्तरिक सन्दर्भ नम्बर हुन्छ (जसलाई "XREF" भनिन्छ) जस्तै "F123" वा "R14"।
sl: V družinskem drevesu ima vsak zapis notranjo referenčno številko (imenovano “XREF”), kot je na primer “F123” ali “R14”.

source: The two family trees have %1$s record which uses the same “XREF”.
cy: Does gan y ddau gart achau ddim cofnod sy'n defnyddio'r un “XREF”.
hy: Երկու տոհմածառերն ունեն %1$s գրառում, որն օգտագործում է նույն «XREF»-ը:
ko: 두 가계도에는 동일한 “XREF”를 사용하는 %1$s 레코드가 있습니다.
ne: दुई पारिवारिक रूखहरूसँग %1$s रेकर्ड छ जसले उही "XREF" प्रयोग गर्दछ।
sl: Družinski drevesi imata %1$s zapis, ki uporablja isti “XREF”.

source: You must renumber the records in one of the trees before you can merge them.
cy: Rhaid i chi ail-rifo'r cofnodion yn un o'r cartiau achau cyn y gallwch chi eu huno.
hy: Դուք պետք է վերահամարակալեք ծառերից մեկի գրառումները, նախքան դրանք միաձուլեք:
ko: 병합하기 전에 트리 중 하나의 레코드 번호를 다시 매겨 야합니다.
ne: तपाईंले तिनीहरूलाई मर्ज गर्न सक्नु अघि तपाईंले एउटा रूखमा रेकर्डहरू पुन: नम्बर गर्नुपर्छ।
sl: Preden lahko združite zapise v enem od družinskih dreves, jih morate preštevilčiti.

source: Copy all the records from %1$s into %2$s.
cy: Copïo'r holl gofnodion o '%1$s' i '%2$s.
hy: Պատճենեք բոլոր գրառումները %1$s-ից %2$s:
ko: %1$s의 모든 레코드를 %2$s에 복사합니다.
ne: %1$s बाट %2$s मा सबै रेकर्डहरू प्रतिलिपि गर्नुहोस्।
sl: Kopiraj vse zapise iz drevesa %1$s v drevo %2$s.

source: General
cy: Cyffredinol
hy: Գեներալ
ko: 일반
ne: साधारण
sl: Splošno

source: This individual will be selected by default when viewing charts and reports.
cy: Bydd yr unigolyn hwn yn cael ei ddewis yn ragosodedig wrth edrych ar siartiau ac adroddiadau.
hy: Այս անհատը կընտրվի լռելյայնորեն՝ գծապատկերները և հաշվետվությունները դիտելիս:
ko: 이 인물은 차트와 보고서를 볼 때 기본적으로 선택됩니다.
ne: चार्ट र रिपोर्टहरू हेर्दा यो व्यक्ति पूर्वनिर्धारित रूपमा चयन गरिनेछ।
sl: Ta oseba bo privzeto izbrana pri ogledu diagramov in poročil.

source: Calendar conversion
cy: Trosi calendr
hy: Օրացույցի փոխակերպում
ko: 달력 변환
ne: क्यालेन्डर रूपान्तरण
sl: Pretvorba koledarja

source: No calendar conversion
cy: Dim trosi calendr
hy: Օրացույցի փոխարկում չկա
ko: 달력 변환 없음
ne: कुनै क्यालेन्डर रूपान्तरण छैन
sl: Brez spremembe koledarja

source: Different calendar systems are used in different parts of the world, and many other calendar systems have been used in the past. Where possible, you should enter dates using the calendar in which the event was originally recorded. You can then specify a conversion, to show these dates in a more familiar calendar. If you regularly use two calendars, you can specify two conversions and dates will be converted to both the selected calendars.
cy: Mae gwahanol systemau calendr yn cael eu defnyddio mewn gwahanol rannau o'r byd, a defnyddiwyd llawer o systemau calendr eraill yn y gorffennol. Lle bo modd, dylech nodi dyddiadau gan ddefnyddio'r calendr y cofnodwyd y digwyddiad yn wreiddiol. Yna gallwch bennu trosiad, i ddangos y dyddiadau hyn mewn calendr mwy cyfarwydd. Os ydych chi'n defnyddio dau galendr yn rheolaidd, gallwch nodi dau drosiad a bydd dyddiadau'n cael eu trosi i'r ddau galendr a ddewiswyd.
hy: Աշխարհի տարբեր մասերում օգտագործվում են տարբեր օրացույցային համակարգեր, և շատ այլ օրացույցային համակարգեր նախկինում օգտագործվել են: Հնարավորության դեպքում դուք պետք է մուտքագրեք ամսաթվերը՝ օգտագործելով այն օրացույցը, որում ի սկզբանե գրանցվել է իրադարձությունը: Այնուհետև կարող եք նշել փոխակերպումը՝ այս ամսաթվերը ավելի ծանոթ օրացույցում ցույց տալու համար: Եթե դուք պարբերաբար օգտագործում եք երկու օրացույց, կարող եք նշել երկու փոխարկում, և ամսաթվերը կվերափոխվեն երկու ընտրված օրացույցներին:
ko: 다른 달력 시스템은 세계의 다른 지역에서 사용되며 과거에는 다른 많은 달력 시스템이 사용되었습니다. 가능하면 이벤트가 원래 기록된 달력을 사용하여 날짜를 입력해야 합니다. 그런 다음 이 날짜를 보다 친숙한 달력에 표시하도록 변환을 지정할 수 있습니다. 두 개의 달력을 정기적으로 사용하는 경우 두 개의 변환을 지정할 수 있으며 날짜는 선택한 두 달력으로 모두 변환됩니다.
ne: संसारका विभिन्न भागहरूमा विभिन्न पात्रो प्रणालीहरू प्रयोग गरिन्छ, र धेरै अन्य क्यालेन्डर प्रणालीहरू विगतमा प्रयोग गरिएको छ। जहाँ सम्भव छ, तपाईंले क्यालेन्डर प्रयोग गरेर मितिहरू प्रविष्ट गर्नुपर्छ जसमा घटना मूल रूपमा रेकर्ड गरिएको थियो। तपाइँ त्यसपछि एक रूपान्तरण निर्दिष्ट गर्न सक्नुहुन्छ, यी मितिहरूलाई थप परिचित पात्रोमा देखाउन। यदि तपाइँ नियमित रूपमा दुई क्यालेन्डरहरू प्रयोग गर्नुहुन्छ भने, तपाइँ दुईवटा रूपान्तरणहरू निर्दिष्ट गर्न सक्नुहुन्छ र मितिहरू दुवै चयन गरिएका क्यालेन्डरहरूमा रूपान्तरण गरिनेछ।
sl: V različnih delih sveta uporabljajo različne koledarje, v preteklosti pa so uporabljali tudi mnoge druge koledarje. Kjer je mogoče, vnesite datume z uporabo koledarja, v katerem je bil dogodek prvotno zabeležen. Nato lahko določite pretvorbo, da se ti datumi prikažejo v bolj znanem koledarju. Če redno uporabljate dva koledarja, lahko določite dve pretvorbi in datumi bodo pretvorjeni v oba izbrana koledarja.
