Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: %s twice removed ascending
cy: %s gradd dau esgynnol
hy: %s-ը երկու անգամ հեռացվել է աճով
ko: %s 가 오름차순으로 두 번 제거
ne: %s दुई पटक आरोही हटाइयो
sl: %s dvakrat zamaknjen naraščajoče

source: %s twice removed descending
cy: %s gradd dau esgynnol
hy: %s-ը երկու անգամ հեռացվել է նվազմամբ
ko: %s 가 내림차순으로 두 번 제거
ne: %s दुई पटक घट्दो क्रममा हटाइयो
sl: %s dvakrat zamaknjen padajoče

source: %s three times removed ascending
cy: %s gradd tri esgynnol
hy: %s-ը երեք անգամ հեռացվել է աճման կարգով
ko: %s 세번 오름차순 제거
ne: %s तीन पटक बढ्दो क्रममा हटाइयो
sl: %s trikrat zamaknjen naraščajoče

source: %s three times removed descending
cy: %s gradd tri disgynnol
hy: %s-ը երեք անգամ հեռացվել է նվազմամբ
ko: %s 세번 내림차순 제거
ne: %s तीन पटक घट्दो क्रममा हटाइयो
sl: %s trikrat zamaknjen padajoče

source: %1$s %2$s times removed ascending
cy: %1$s gradd %2$s esgynnol
hy: %1$s %2$s անգամ հեռացվել է աճման կարգով
ko: %1$s %2$s 오름차순 제거
ne: %1$s %2$s पटक बट्दो क्रममा हटाइयो
sl: %1$s %2$s-krat zamaknjen naraščajoče

source: %1$s %2$s times removed descending
cy: %1$s gradd %2$s disgynnol
hy: %1$s %2$s անգամ հեռացվել է նվազմամբ
ko: %1$s %2$s 내림차순 제거
ne: %1$s %2$s पटक घट्दो क्रममा हटाइयो
sl: %1$s %2$s-krat zamaknjen padajoče

# MALE
source: first cousin
cy: cefnder cyntaf
hy: առաջին զարմիկ
ko: 종조
ne: पहिलो कजिन
sl: bratranec

# MALE
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제
sl: drugi bratranec

# MALE
source: third cousin
cy: trydydd cefnder
hy: երրորդ զարմիկ
ko: 삼종형제
sl: tretji bratranec

# MALE
source: fourth cousin
cy: pedwerydd cefnder
hy: չորրորդ զարմիկ
ko: 사종자매
ne: चौथो भाइ
sl: četrti bratranec

# MALE
source: fifth cousin
cy: pumed cefnder
hy: հինգերորդ զարմիկ
ko: 오종형제
ne: पाँचौं कजिन
sl: peti bratranec

# MALE
source: sixth cousin
cy: chweched cefnder
hy: վեցերորդ զարմիկ
ko: 육종형제
sl: šesti bratranec

# MALE
source: seventh cousin
cy: seithfed cefnder
hy: յոթերորդ զարմիկ
ko: 칠종형제
sl: sedmi bratranec

# MALE
source: eighth cousin
cy: wythfed cefnder
hy: ութերորդ զարմիկ
ko: 팔종형제
ne: आठौं काका
sl: osmi bratranec

# MALE
source: ninth cousin
cy: nawfed cefnder
hy: իններորդ զարմիկ
ko: 구종형제
sl: deveti bratranec

# MALE
source: tenth cousin
cy: degfed cefnder
hy: տասներորդ զարմիկ
ko: 십종형제
sl: deseti bratranec

# MALE
source: eleventh cousin
cy: unfed cefnder ar ddeg
hy: տասնմեկերորդ զարմիկ
ko: 십일종형제
ne: एघारौं काका
sl: enajsti bratranec

# MALE
source: twelfth cousin
cy: deuddegfed cefnder ar ddeg
hy: տասներկուերորդ զարմիկ
ko: 십이종형제
sl: dvanajsti bratranec

# MALE
source: thirteenth cousin
cy: trydydd cefnder ar ddeg
hy: տասներեքերորդ զարմիկ
ko: 십삼종형제
sl: trinajsti bratranec

# MALE
source: fourteenth cousin
cy: pedwerydd cefnder ar ddeg
hy: տասնչորսերորդ զարմիկ
ko: 십사종형제
ne: चौधौं कजिन भाइ
sl: štirinajsti bratranec

# MALE
source: fifteenth cousin
cy: pymthegfed cefnder
hy: տասնհինգերորդ զարմիկ
ko: 십오종형제
ne: पन्ध्रौं कजिन
sl: petnajsti bratranec

# MALE
source: %s × cousin
cy: %s × cefnder
hy: %s × զարմիկ
ko: %s 종형제
ne: %s × भान्जा
sl: %s × bratranec

# FEMALE
source: first cousin
cy: cyfnither gyntaf
hy: առաջին զարմիկ
ko: 종자매(사촌)
ne: पहिलो कजिन
sl: sestrična

# FEMALE
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종자매
sl: druga sestrična

# FEMALE
source: third cousin
cy: trydedd gyfnither
hy: երրորդ զարմիկ
ko: 삼종자매
sl: tretja sestrična

# FEMALE
source: fourth cousin
cy: pedwaredd gyfnither
hy: չորրորդ զարմիկ
ko: 사종자매
ne: चौथो भाइ
sl: četrta sestrična

# FEMALE
source: fifth cousin
cy: pumed gyfnither
hy: հինգերորդ զարմիկ
ko: 오종자매
ne: पाँचौं कजिन
sl: peta sestrična

# FEMALE
source: sixth cousin
cy: chweched gyfnither
hy: վեցերորդ զարմիկ
ko: 육종자매
sl: šesta sestrična

# FEMALE
source: seventh cousin
cy: seithfed gyfnither
hy: յոթերորդ զարմիկ
ko: 칠종자매
sl: sedma sestrična

# FEMALE
source: eighth cousin
cy: wythfed gyfnither
hy: ութերորդ զարմիկ
ko: 팔종형제
ne: आठौं काका
sl: osma sestrična

# FEMALE
source: ninth cousin
cy: nawfed cyfnither
hy: իններորդ զարմիկ
ko: 구종자매
sl: deveta sestrična

# FEMALE
source: tenth cousin
cy: degfed gyfnither
hy: տասներորդ զարմիկ
ko: 십종자매
sl: deseta sestrična

# FEMALE
source: eleventh cousin
cy: unfed gyfnither ar ddeg
hy: տասնմեկերորդ զարմիկ
ko: 십일종형제
ne: एघारौं काका
sl: enajsta sestrična

# FEMALE
source: twelfth cousin
cy: deuddegfed gyfnither ar ddeg
hy: տասներկուերորդ զարմիկ
ko: 십이종자매
sl: dvanajsta sestrična

# FEMALE
source: thirteenth cousin
cy: trydedd gyfnither ar ddeg
hy: տասներեքերորդ զարմիկ
ko: 십삼종자매
sl: trinajsta sestrična

# FEMALE
source: fourteenth cousin
cy: pedwaredd gyfnither ar ddeg
hy: տասնչորսերորդ զարմիկ
ko: 십사종자매
ne: चौधौं चचेरे भाइ
sl: štirinajsta sestrična

# FEMALE
source: fifteenth cousin
cy: pymthegfed gyfnither
hy: տասնհինգերորդ զարմիկ
ko: 십오종형제
ne: पन्ध्रौं कजिन
sl: petnajsta sestrična

# FEMALE
source: %s × cousin
cy: %s × cyfnither
hy: %s × զարմիկ
ko: %s종 자매
ne: %s × भानिज
sl: %s × sestrična

source: first cousin
cy: cefnder cyntaf/cyfnither gyntaf
hy: առաջին զարմիկ
ko: 종형제(사촌)
ne: पहिलो कजिन
sl: bratranec

source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제
sl: drugi bratranec/sestrična

source: third cousin
cy: trydydd cefnder/cyfnither
hy: երրորդ զարմիկ
ko: 삼종형제
sl: tretji bratranec/sestrična

source: fourth cousin
cy: pedwerydd cefnder/pedwaredd gyfnither
hy: չորրորդ զարմիկ
ko: 사종형제
ne: चौथो भाइ
sl: četrti bratranec/sestrična

source: fifth cousin
cy: pumed cefnder/cyfnither
hy: հինգերորդ զարմիկ
ko: 오종형제
ne: पाँचौं कजिन
sl: peti bratranec

source: sixth cousin
cy: chweched cefnder
hy: վեցերորդ զարմիկ
ko: 육종형제
sl: šesti bratranec/sestrična

source: seventh cousin
cy: seithfed cefnder/cyfnither
hy: յոթերորդ զարմիկ
ko: 칠종형제
sl: sedmi bratranec/sestrična

source: eighth cousin
cy: wythfed cefnder/cyfnither
hy: ութերորդ զարմիկ
ko: 팔종형제
ne: आठौं काका
sl: osmi bratranec/sestrična

source: ninth cousin
cy: nawfed cefnder/cyfnither
hy: իններորդ զարմիկ
ko: 구종형제
sl: deveti bratranec/sestrična

source: tenth cousin
cy: degfed cefnder/cyfnither
hy: տասներորդ զարմիկ
ko: 십종형제
sl: deseti bratranec/sestrična

source: eleventh cousin
cy: unfed cefnder/cyfnither ar ddeg
hy: տասնմեկերորդ զարմիկ
ko: 십일종형제
ne: एघारौं काका
sl: enajsti bratranec/sestrična

source: twelfth cousin
cy: deuddegfed cefnder/cyfnither
hy: տասներկուերորդ զարմիկ
ko: 십이종형제
sl: dvanajsti bratranec/sestrična

source: thirteenth cousin
cy: trydydd cefnder/cyfnither ar ddeg
hy: տասներեքերորդ զարմիկ
ko: 십삼종형제
sl: trinajsti bratranec/sestrična

source: fourteenth cousin
cy: pedwerydd cefnder ar ddeg/pedwaredd gyfnither ar ddeg
hy: տասնչորսերորդ զարմիկ
ko: 십사종형제
ne: चौधौं कजिन
sl: štirinajsti bratranec/sestrična

source: fifteenth cousin
cy: pymthegfed cefnder/cyfnither
hy: տասնհինգերորդ զարմիկ
ko: 십오종형제
ne: पन्ध्रौं कजिन
sl: petnajsti bratranec/sestrična

source: %s × cousin
cy: %s × cefnder/cyfnither
hy: %s × զարմիկ
ko: %s × 종형제
ne: %s × भान्जा
sl: %s × bratranec/sestrična

# MALE
source: first %s
cy: %s cyntaf
hy: առաջին %s
ko: 첫번째 %s
ne: पहिलो %s
sl: prvi %s

# MALE
source: second %s
cy: ail %s
hy: երկրորդ %s
ko: 당숙 %s
sl: drugi %s

# MALE
source: third %s
cy: trydydd %s
hy: երրորդ %s
ko: 당숙 %s
sl: tretji %s

# MALE
source: fourth %s
cy: pedwerydd %s
hy: չորրորդ %s
ko: 현종손자 %s
ne: चौथो %s
sl: četrti %s

# MALE
source: fifth %s
cy: pumed %s
hy: հինգերորդ %s
ko: 조카고손 %s
ne: पाचौं %s
sl: peti %s

# FEMALE
source: first %s
cy: %s gyntaf
hy: առաջին %s
ko: 첫번째 %s
ne: पहिलो %s
sl: prva %s

# FEMALE
source: second %s
cy: ail %s
hy: երկրորդ %s
ko: 당숙 %s
sl: druga %s

# FEMALE
source: third %s
cy: trydedd %s
hy: երրորդ %s
ko: 당숙 %s
sl: tretja %s

# FEMALE
source: fourth %s
cy: pedwaredd %s
hy: չորրորդ %s
ko: 종현손 %s
ne: चौथो %s
sl: četrta %s

# FEMALE
source: fifth %s
cy: pumed %s
hy: հինգերորդ %s
ko: 다섯 번째 %s
ne: पाचौं %s
sl: peta %s

source: first %s
cy: %s cyntaf
hy: առաջին %s
ko: 첫번째 %s
ne: पहिलो %s
sl: prvi %s

source: second %s
cy: ail %s
hy: երկրորդ %s
ko: 당숙 %s
sl: drugi %s

source: third %s
cy: trydydd %s
hy: երրորդ %s
ko: 당숙 %s
sl: tretji %s

source: fourth %s
cy: pedwerydd/pedwaredd %s
hy: չորրորդ %s
ko: 종현손 %s
ne: चौथो %s
sl: četrti %s

source: fifth %s
cy: pumed %s
hy: հինգերորդ %s
ko: 다섯 번째 %s
ne: पाचौं %s
sl: peti %s

source: The search returned too many results.
cy: Dychwelodd y chwilio ormod o ganlyniadau.
hy: Որոնումը չափազանց շատ արդյունքներ տվեց:
ko: 검색 결과가 너무 많습니다.
ne: खोजले धेरै नतिजाहरू फर्कायो।
sl: Iskanje je vrnilo preveč rezultatov.

source: The PHP extension “%s” is not installed.
cy: Nid yw'r estyniad PHP “%s” wedi'i osod.
hy: PHP «%s» ընդլայնումը տեղադրված չէ:
ko: PHP 익스텐션 “%s”이(가) 설치되지 않았습니다.
ne: PHP विस्तार "%s" स्थापना गरिएको छैन।
sl: Razširitev PHP “%s” ni nameščena.

source: The PHP.INI setting “%1$s” is disabled.
cy: Mae gosodiad PHP.INI “%1$s” wedi ei analluogi.
hy: PHP.INI «%1$s» կարգավորումն անջատված է:
ko: PHP.INI 설정 “%1$s”이 비활성화되었습니다.
ne: PHP.INI सेटिङ "%1$s" असक्षम गरिएको छ।
sl: Nastavitev PHP.INI “%1$s” je onemogočena.

source: The PHP.INI setting “%1$s” is enabled.
cy: Mae'r gosodiad PHP.INI “%1$s” wedi'i alluogi.
hy: PHP.INI «%1$s» պարամետրը միացված է:
ko: PHP.INI 설정 “%1$s”이 활성화되었습니다.
ne: PHP.INI सेटिङ "%1$s" सक्षम छ।
sl: Nastavitev PHP.INI “%1$s” je omogočena.

source: The PHP function “%1$s” is disabled.
cy: Mae'r swyddogaeth PHP “%1$s” wedi'i analluogi.
hy: PHP «%1$s» ֆունկցիան անջատված է:
ko: PHP 기능 “%1$s”이 비활성화 되었습니다.
ne: PHP प्रकार्य "%1$s" असक्षम गरिएको छ।
sl: Funkcija PHP “%1$s” je onemogočena.

source: Your web server is using PHP version %s, which is no longer receiving security updates. You should upgrade to a later version as soon as possible.
cy: Mae eich gweinydd gwe yn defnyddio fersiwn PHP %s, nad yw bellach yn derbyn diweddariadau diogelwch. Dylech uwchraddio i fersiwn ddiweddarach cyn gynted â phosibl.
hy: Ձեր վեբ սերվերն օգտագործում է PHP %s տարբերակը, որն այլևս անվտանգության թարմացումներ չի ստանում: Դուք պետք է հնարավորինս շուտ թարմացնեք ավելի ուշ տարբերակի:
ko: 웹 서버가 더 이상 보안 업데이트를받지 않는 PHP 버전 %s을(를) 사용하고 있습니다. 가능한 빨리 최신 버전으로 업그레이드해야합니다.
ne: तपाईंको वेब सर्भरले PHP संस्करण %s प्रयोग गरिरहेको छ, जसले अब सुरक्षा अपडेटहरू प्राप्त गरिरहेको छैन। तपाईंले सकेसम्म चाँडो पछिको संस्करणमा अपग्रेड गर्नुपर्छ।
sl: Vaš spletni strežnik uporablja PHP različice %s, ki ne prejema več varnostnih posodobitev. Čim prej ga nadgradite na novejšo različico.

source: SQLite version %s is installed. SQLite version %s or later is required.
cy: Mae fersiwn SQLite %s wedi'i osod. Mae angen fersiwn SQLite %s neu'n hwyrach.
hy: Տեղադրված է SQLite %s տարբերակը: Պահանջվում է SQLite %s կամ ավելի նոր տարբերակ:
ko: SQLite 버전 %s가 설치되었습니다.SQLite 버전 %s 이상이 필요합니다.
ne: SQLite संस्करण %s स्थापित छ। SQLite संस्करण %s वा पछि आवश्यक छ।
sl: Nameščen je SQLite različice %s. Zahtevan je SQLite različice %s ali novejše.

source: The server’s temporary folder cannot be accessed.
cy: Nid oes modd cael mynediad i ffolder dros dro y gweinydd.
hy: Սերվերի ժամանակավոր թղթապանակը հասանելի չէ:
ko: 서버의 임시 폴더에 액세스 할 수 없습니다.
ne: सर्भरको अस्थायी फोल्डर पहुँच गर्न सकिँदैन।
sl: Začasna mapa strežnika ni dosegljiva.

source: SQLite is only suitable for small sites, testing and evaluation.
cy: Mae SQLite yn addas ar gyfer safleoedd bach, profi a gwerthuso yn unig.
hy: SQLite-ը հարմար է միայն փոքր կայքերի, փորձարկման և գնահատման համար:
ko: SQLite는 작은 사이트, 테스트 및 평가에만 적합합니다.
ne: SQLite साना साइटहरू, परीक्षण र मूल्याङ्कनका लागि मात्र उपयुक्त छ।
sl: SQLite je primeren samo za majhna spletišča, testiranje in evalvacijo.

source: Support for PostgreSQL is experimental.
cy: Mae cefnogaeth i PostgreSQL yn arbrofol.
hy: PostgreSQL-ի աջակցությունը փորձնական է:
ko: PostgreSQL 지원은 실험적입니다.
ne: PostgreSQL को लागि समर्थन प्रयोगात्मक छ।
sl: Podpora za PostgreSQL je poskusna.

source: Support for SQL Server is experimental.
cy: Mae cefnogaeth i SQL Server yn arbrofol.
hy: SQL Server-ի աջակցությունը փորձնական է:
ko: SQL Server 지원은 실험적입니다.
ne: SQL सर्भरको लागि समर्थन प्रयोगात्मक छ।
sl: Podpora za SQL Server je poskusna.

source: John /DOE/
hy: Ջոն /DOE/
ko: 이름입력 /가문이름입력/
ne: जोन /DOE/
sl: Janez /NOVAK/

source: Edit this individual and replace their details with your own.
cy: Golygwch yr unigolyn hwn a rhoi eich manylion chi yn lle eu manylion.
hy: Խմբագրեք այս անձին և փոխարինեք նրա տվյալները ձեր սեփականով:
ko: 이 인물을 편집하고 세부 정보를 자신의 세부 정보로 바꿉니다.
ne: यस व्यक्तिलाई सम्पादन गर्नुहोस् र तिनीहरूको विवरणहरू तपाईंको आफ्नैसँग बदल्नुहोस्।
sl: Uredi to osebo in njene podatke zamenjaj s svojimi.

source: This website is being upgraded. Try again in a few minutes.
cy: Mae'r wefan hon yn cael ei huwchraddio. Rhowch gynnig arall arni mewn ychydig funudau.
hy: Այս կայքը թարմացվում է: Մի քանի րոպեից նորից փորձեք:
ko: 이 웹 사이트는 업그레이드 중입니다. 몇 분 후에 다시 시도하십시오.
ne: यो वेबसाइट अपग्रेड हुँदैछ। केही मिनेटमा फेरि प्रयास गर्नुहोस्।
sl: Poteka nadgradnja spletišča. Čez nekaj minut poskusite znova.

source: Russell
hy: Ռասել
ne: रसेल

source: Daitch-Mokotoff
hy: Դաիչ - Մոկոտոֆ
ne: डाइच-Mokotoff

source: Males
cy: Gwrywod
hy: Արուներ
ko: 남성
ne: पुरुषहरू
sl: Moški

source: Females
cy: Benywod
hy: Էգեր
ko: 여성
ne: महिलाहरू
sl: Ženske

source: Average age
cy: Oed cyfartalog
hy: Միջին տարիքը
ko: 평균 연령
ne: औषत आयु
sl: Povprečna starost

source: Average age related to death century
cy: Oed cyfartalog yn gysylltiedig â chanrif marwolaeth
hy: Մահվան հետ կապված միջին տարիքը
ko: 세기별 사망 평균 연령
ne: मृत्यु शताब्दीसँग सम्बन्धित औसत उमेर
sl: Povprečna starost glede na stoletje smrti

source: Births by century
cy: Genedigaethau yn ôl canrif
hy: Ծնունդներն ըստ դարերի
ko: 세기별 출생
ne: शताब्दी अनुसार जन्म
sl: Rojstva po stoletjih

source: Average number
cy: Nifer cyfartalog
hy: Միջին թիվը
ko: 평균 수
ne: औसत संख्या
sl: Povprečno število

source: Average number of children per family
cy: Nifer cyfartalog y plant fesul teulu
hy: Երեխաների միջին թիվը մեկ ընտանիքում
ko: 가족당 평균 자녀 수
ne: प्रति परिवार छोराछोरीको औसत संख्या
sl: Povprečno število otrok na družino

source: Deaths by century
cy: Marwolaethau yn ôl canrif
hy: Մահերն ըստ դարի
ko: 세기별 사망
ne: शताब्दी अनुसार मृत्यु
sl: Smrti po stoletjih

source: Surname distribution chart
cy: Siart dosbarthu cyfenwau
hy: Ազգանունների բաշխման աղյուսակը
ko: 가문이름 분포도
ne: उपनाम वितरण चार्ट
sl: Diagram porazdelitve priimkov

source: Birth by country
cy: Geni yn ôl gwlad
hy: Ծնունդն ըստ երկրի
ko: 출생 국가
ne: देश अनुसार जन्म
sl: Rojstva po državah

source: Death by country
cy: Marwolaeth yn ôl gwlad
hy: Մահ՝ ըստ երկրի
ko: 국가별 사망
ne: देश अनुसार मृत्यु
sl: Smrti po državah

source: Marriage by country
cy: Priodas yn ôl gwlad
hy: Ամուսնությունը ըստ երկրի
ko: 결혼한 국가
ne: देश अनुसार विवाह
sl: Poroke po državah

source: Individual distribution chart
cy: Siart dosbarthu unigol
hy: Անհատական բաշխման աղյուսակ
ko: 인물 분포도
ne: व्यक्तिगत वितरण चार्ट
sl: Diagram porazdelitve oseb

source: Divorces by century
cy: Ysgariadau yn ôl canrif
hy: Ամուսնալուծություններ ըստ դարերի
ko: 세기별 이혼
ne: शताब्दी अनुसार सम्बन्ध विच्छेद
sl: Ločitev po stoletjih

source: Largest families
cy: Y teuluoedd mwyaf
hy: Ամենամեծ ընտանիքները
ko: 가장 큰 가족
ne: ठूला परिवारहरू
sl: Največje družine

source: Without sources
cy: Heb ffynonellau
hy: Առանց աղբյուրների
ko: 출처 없이
ne: स्रोत बिना
sl: Brez virov

source: With sources
cy: Gyda ffynonellau
hy: Աղբյուրների հետ
ko: 출처와 함께
ne: स्रोतहरु संग
sl: Z viri

source: Families with sources
cy: Teuluoedd â ffynonellau
hy: Աղբյուրներով ընտանիքներ
ko: 출처가 있는 가족
ne: स्रोतहरू भएका परिवारहरू
sl: Družine z viri

source: Individuals with sources
cy: Unigolion â ffynonellau
hy: Աղբյուրներ ունեցող անհատներ
ko: 출처가 있는 인물
ne: स्रोत भएका व्यक्तिहरू
sl: Osebe z viri

source: Marriages by century
cy: Priodasau yn ôl canrif
hy: Ամուսնությունները ըստ դարի
ko: 세기별 결혼
ne: शताब्दी अनुसार विवाह
sl: Porok po stoletjih

source: Average age in century of marriage
cy: Oed cyfartalog mewn canrif o briodas
hy: Միջին տարիքը ամուսնության դարում
ko: 세기별 결혼 평균 연령
ne: विवाहको शताब्दीमा औसत उमेर
sl: Povprečna starost v stoletju poroke

source: Average age at marriage
cy: Oed cyfartalog pan yn priodi
hy: Ամուսնության միջին տարիքը
ko: 결혼 평균 연령
ne: विवाहको औसत उमेर
sl: Povprečna starost ob poroki

source: Dead
cy: Marw
hy: Մահացած
ko: 사망
ne: मृत्यु
sl: Mrtvi

# unknown century
source: Unknown
cy: Anhysbys
hy: Անհայտ
ko: 알 수 없는
ne: अज्ञात
sl: Neznano

source: Number of families without children
cy: Y nifer y teuluoedd heb blant
hy: Երեխաներ չունեցող ընտանիքների թիվը
ko: 자녀가 없는 가족 수
ne: बच्चा नभएका परिवारहरूको संख्या
sl: Število družin brez otrok

source: Total families
cy: Cyfanswm teuluoedd
hy: Ընդհանուր ընտանիքներ
ko: 전체 가족
ne: कुल परिवार
sl: Skupno število družin

source: This information is private and cannot be shown.
cy: Mae'r wybodaeth hon yn breifat ac nid oes modd ei dangos.
hy: Այս տեղեկատվությունը մասնավոր է և չի կարող ցուցադրվել:
ko: 이 정보는 개인 정보이므로 표시 할 수 없습니다.
ne: यो जानकारी गोप्य राखिएको छ ।
sl: Ta informacija je zasebna in ne bo prikazana.

source: and
cy: a
hy: և
ko: 그리고
ne: र
sl: in

source: View this family
cy: Gweld y teulu hwn
hy: Դիտեք այս ընտանիքը
ko: 가족 보기
ne: यो परिवार हेर्नुहोस्
sl: Poglej to družino

source: No signed-in and no anonymous users
cy: Dim mewngofnodion a dim defnyddwyr anhysbys
hy: Մուտք գործած և անանուն օգտվողներ չկան
ko: 로그인 및 익명 사용자 없음
ne: कुनै साइन-इन र कुनै अज्ञात प्रयोगकर्ताहरू छैनन्
sl: Nič prijavljenih ali anonimnih uporabnikov

source: %s anonymous signed-in user
cy: %s defnyddwyr anhysbys wedi'u mewngofnodi
hy: %s անանուն օգտատեր, ով մուտք է գործել հաշիվ
ko: 익명으로 로그인 한 사용자들은 %s 명
ne: %s बेनामी साइन-इन प्रयोगकर्ता
sl: %s anonimni prijavljeni uporabnik

source: %s signed-in user
cy: %s defnyddwyr wedi'u mewngofnodi
hy: %s մուտք գործած օգտվող
ko: 로그인 한 사용자 %s
ne: %s साइन-इन प्रयोगकर्ता
sl: %s prijavljeni uporabnik

source: %s BCE
hy: %s մ.թ.ա
sl: %s pr. K.

# CENTURY
source: 21st
cy: 21ain
hy: 21-րդ
ko: 21세기
ne: २१औं
sl: 21. stol.

# CENTURY
source: 20th
cy: 20fed
hy: 20-րդ
ko: 20세기
ne: बिसौं
sl: 20. stol.

# CENTURY
source: 19th
cy: 19eg
hy: 19-րդ
ko: 19세기
ne: उन्नाइसौं
sl: 19. stol.

# CENTURY
source: 18th
cy: 18fed
hy: 18-րդ
ko: 18세기
ne: अठारौं
sl: 18. stol.

# CENTURY
source: 17th
cy: 17eg
hy: 17-րդ
ko: 17세기
ne: सत्रौं
sl: 17. stol.

# CENTURY
source: 16th
cy: 16eg
hy: 16-րդ
ko: 16세기
ne: सोह्रौं
sl: 16. stol.

# CENTURY
source: 15th
cy: 15fed
hy: 15-րդ
ko: 15번째
ne: पन्ध्रौं
sl: 15. stol.

# CENTURY
source: 14th
cy: 14eg
hy: 14-րդ
ko: 14세기
ne: चौधौं
sl: 14. stol.

# CENTURY
source: 13th
cy: 13eg
hy: 13-րդ
ko: 13세기
ne: तेह्रौं
sl: 13. stol.

# CENTURY
source: 12th
cy: 12fed
hy: 12-րդ
ko: 12세기
ne: बाह्रौं
sl: 12. stol.

# CENTURY
source: 11th
cy: 11eg
hy: 11-րդ
ko: 11세기
ne: एघारौं
sl: 11. stol.

# CENTURY
source: 10th
cy: 10fed
hy: 10-րդ
ko: 10세기
ne: दसौं
sl: 10. stol.

# CENTURY
source: 9th
cy: 9fed
hy: 9-րդ
ko: 9세기
ne: नवौं
sl: 9. stol.

# CENTURY
source: 8th
cy: 8fed
hy: 8-րդ
ko: 8세기
ne: आठौं
sl: 8. stol.

# CENTURY
source: 7th
cy: 7fed
hy: 7-րդ
ko: 7세기
ne: सातौं
sl: 7. stol.

# CENTURY
source: 6th
cy: 6ed
hy: 6-րդ
ko: 6세기
ne: छैठौं
sl: 6. stol.

# CENTURY
source: 5th
cy: 5ed
hy: 5-րդ
ko: 5세기
ne: पाचौं
sl: 5. stol.

# CENTURY
source: 4th
cy: 4ydd
hy: 4-րդ
ko: 4세기
ne: चौथो
sl: 4. stol.

# CENTURY
source: 3rd
cy: 3ydd
hy: 3-րդ
ko: 3번째
ne: तेस्रो
sl: 3. stol.

# CENTURY
source: 2nd
cy: 2il
hy: 2-րդ
ko: 2세기
ne: दोस्रो
sl: 2. stol.

# CENTURY
source: 1st
cy: 1af
hy: 1-ին
ko: 1세기
ne: प्रथम
sl: 1. stol.

source: Aruba
hy: Արուբա
ne: अरुबा

source: Afghanistan
cy: Affganistan
hy: Աֆղանստան
ko: 아프가니스탄
ne: अफगानिस्तान
sl: Afganistan

source: Angola
hy: Անգոլա
ne: एङ्गोला

source: Anguilla
hy: Անգուիլա
ne: एङ्गुइला
sl: Angvila

source: Åland Islands
hy: Ալանդյան կղզիներ
ne: आल्याण्ड टापुहरू

source: Albania
hy: Ալբանիա
ne: अल्बानिया
sl: Albanija

source: Andorra
hy: Անդորրա
ne: एन्डोर्रा
sl: Andora

source: United Arab Emirates
cy: Yr Emiraethau Arabaidd Unedig
hy: Արաբական Միացյալ Էմիրություններ
ko: United Arab Emirate
ne: संयुक्त अरब इमिरेट्स
sl: Združeni arabski emirati

source: Argentina
cy: Yr Ariannin
hy: Արգենտինա
ne: अर्जेन्टिना

source: Armenia
hy: Հայաստան
ne: आर्मेनिया
sl: Armenija

source: American Samoa
cy: Samoa Americanaidd
hy: Ամերիկյան Սամոա
ne: अमेरिकी सामोआ
sl: Ameriška Samoa

source: Antarctica
hy: Անտարկտիկա
ko: 남극
ne: एन्टार्टिका
sl: Antarktika

source: French Southern Territories
cy: Tiroedd Deheuol Ffrainc
hy: Ֆրանսիական հարավային տարածքներ
ne: फ्रेन्च दक्षिणी क्षेत्रहरू
sl: Francoska južna ozemlja

source: Antigua and Barbuda
cy: Antigua a Barbuda
hy: Անտիգուա և Բարբուդա
ne: एन्टिगुआ र बार्बुडा
sl: Antigva in Barbuda

source: Australia
cy: Awstralia
hy: Ավստրալիա
ne: अस्ट्रेलिया
sl: Avstralija

source: Austria
cy: Awstria
hy: Ավստրիա
ne: अस्ट्रिया
sl: Avstrija

source: Azerbaijan
hy: Ադրբեջան
ne: अजरबैजान
sl: Azerbajdžan

source: Azores
hy: Ազորյան կղզիներ
ne: एजोरेस
sl: Azori

source: Burundi
cy: Bwrwndi
hy: Բուրունդի
ne: बुरुण्डी

source: Belgium
cy: Gwlad Belg
hy: Բելգիա
ne: बेल्जियम
sl: Belgija

source: Benin
hy: Բենին
ne: बेनिन

source: Burkina Faso
cy: Bwrcina Ffaso
hy: Բուրկինա Ֆասո
ne: बुर्किना फासो

source: Bangladesh
hy: Բանգլադեշ
ne: बङ्गलादेश
sl: Bangladeš

source: Bulgaria
cy: Bwlgaria
hy: Բուլղարիա
ne: बुल्गेरिया
sl: Bolgarija

source: Bahrain
hy: Բահրեյն
ne: बहाराइन
sl: Bahrajn

source: Bahamas
hy: Բահամյան կղզիներ
ne: बहामस
sl: Bahami

source: Bosnia and Herzegovina
cy: Bosnia a Herzegovina
hy: Բոսնիա և Հերցեգովինա
ne: बोस्निया र हर्जगोभिना
sl: Bosna in Hercegovina

source: Saint Barthélemy
hy: Սուրբ Բարթելեմի
ne: सेन्ट बार्थेलेमी

source: Belarus
cy: Belarws
hy: Բելառուս
ne: बेलारुस
sl: Belorusija

source: Belize
hy: Բելիզ
ne: बेलिज

source: Bermuda
hy: Բերմուդյան կղզիներ
ne: बर्मुडा
sl: Bermudi

source: Bolivia
cy: Bolifia
hy: Բոլիվիա
ne: बोलिभिया
sl: Bolivija

source: Brazil
cy: Brasil
hy: Բրազիլիա
ne: ब्राजिल
sl: Brazilija

source: Barbados
hy: Բարբադոս
ne: बार्बाडस

source: Brunei Darussalam
hy: Բրունեյ Դարուսսալամ
ne: ब्रुनाई दारुसलाम
sl: Brunej

source: Bhutan
hy: Բութան
ne: भुटान
sl: Butan

source: Bouvet Island
hy: Բուվե կղզի
ne: बोउवेट आइल्यान्ड
sl: Bouvetov otok

source: Botswana
hy: Բոտսվանա
ne: बोटस्वाना
sl: Bocvana

source: Central African Republic
cy: Gweriniaeth Canolbarth Affrica
hy: Կենտրոնական Աֆրիկյան Հանրապետություն
ne: केन्द्रिय अफ्रिकन गणराज्य
sl: Srednjeafriška republika

source: Canada
hy: Կանադա
ne: क्यानाडा
sl: Kanada

source: Cocos (Keeling) Islands
hy: Կոկոս (Քիլինգ) կղզիներ
ne: कोकस (केलिङ) द्वीप
sl: Kokosovi (Keelingovi) otoki

source: Switzerland
cy: Y Swistir
hy: Շվեյցարիա
ne: स्वीजरल्याण्ड
sl: Švica

source: Chile
hy: Չիլի
ne: चिली
sl: Čile

source: China
cy: Tsieina
hy: Չինաստան
ne: चीन
sl: Kitajska

source: Côte d’Ivoire
hy: Կոտ դ’Իվուար
ne: कोट ड'लवोइर

source: Cameroon
cy: Camerŵn
hy: Կամերուն
ne: क्यामरून
sl: Kamerun

source: Democratic Republic of the Congo
cy: Gweriniaeth Ddemocrataidd y Congo
hy: Կոնգոյի Դեմոկրատական Հանրապետություն
ne: प्रजातान्त्रिक गणतन्त्र कंगो
sl: Demokratična republika Kongo

source: Republic of the Congo
cy: Gweriniaeth y Congo
hy: Կոնգոյի Հանրապետություն
ne: कंगो गणतन्त्र
sl: Kongo

source: Cook Islands
cy: Ynysoedd Cook
hy: Կուկի կղզիներ
ne: कुक टापु
sl: Cookovi otoki

source: Colombia
hy: Կոլումբիա
ne: कोलम्बीया
sl: Kolumbija

source: Comoros
hy: Կոմորներ
ne: कोमोरस
sl: Komori

source: Cape Verde
hy: Կաբո Վերդե
ne: केप भर्डे
sl: Zelenortski otoki

source: Costa Rica
hy: Կոստա Ռիկա
ne: कोस्टारिका
sl: Kostarika

source: Cuba
cy: Ciwba
hy: Կուբա
ne: क्यूबा
sl: Kuba

source: Curaçao
hy: Կյուրասաո
ne: कुराकाओ

source: Christmas Island
hy: Սուրբ Ծննդյան կղզի
ne: क्रिस्टमस आइस्ल्यान्ड
sl: Božični otok

source: Cayman Islands
cy: Ynysoedd Cayman
hy: Կայմանյան կղզիներ
ne: केम्यान आइस्ल्यान्ड्स्
sl: Kajmanski otoki

source: Cyprus
hy: Կիպրոս
ne: साइप्रस
sl: Ciper

source: Czech Republic
cy: Gweriniaeth Tsiec
hy: Չեխիայի Հանրապետություն
ne: चेक गणराज्य
sl: Češka

source: Germany
cy: Yr Almaen
hy: Գերմանիա
ne: जर्मनी
sl: Nemčija

source: Djibouti
hy: Ջիբութի
ne: डिजिबोउटी
sl: Džbuti

source: Dominica
hy: Դոմինիկա
ne: डोमिनिका
sl: Dominika

source: Denmark
cy: Denmarc
hy: Դանիա
ne: डेनमार्क
sl: Danska
