Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: These groups of individuals are not related to %s.
cy: Nid yw'r grwpiau hyn o unigolion yn perthyn i %s.
hy: Անհատների այս խմբերը կապված չեն %s-ի հետ:
ko: 이 인물 그룹은 %s와 관련이 없습니다.
ne: व्यक्तिहरूको यी समूहहरू %s सँग सम्बन्धित छैनन्।
sl: Te skupine oseb niso v razmerju z osebo %s.

source: Calculating…
cy: Cyfrifo…
hy: Հաշվարկվում է…
ko: 계산중…
ne: गणना गर्दै…
sl: Preračunavam …

source: Default family tree
cy: Y cart achau ragosodedig
hy: Կանխադրված տոհմածառ
ko: 기본 가계도
ne: पूर्वनिर्धारित पारिवारिक वृक्ष
sl: Privzeto družinsko drevo

source: Set as default
cy: Gosod fel rhagosodiad
hy: Սահմանել որպես լռելյայն
ko: 기본값으로 설정
ne: पूर्वनिर्धारित रूपमा सेट गर्नुहोस्
sl: Nastavi kot privzeto

source: Genealogy data
cy: Data achau
hy: Ծագումնաբանության տվյալներ
ko: 계보 데이터
ne: वंशावली डाटा
sl: Rodoslovni podatki

source: Add unlinked records
cy: Ychwanegu cofnodion digyswllt
hy: Ավելացրեք չկապված գրառումներ
ko: 연결되지 않은 레코드 추가
ne: अनलिंक गरिएका रेकर्डहरू थप्नुहोस्
sl: Dodaj nepovezane zapise

source: GEDCOM file
cy: Ffeil GEDCOM
hy: GEDCOM ֆայլ
ko: GEDCOM 파일
ne: GEDCOM फाइल
sl: Datoteka GEDCOM

source: Export
cy: Allforio
hy: Արտահանում
ko: 내보내기
ne: ऐक्स्पोर्ट गर्नुहोस
sl: Izvoz

source: It can take several minutes to download and install the upgrade. Be patient.
cy: Gall gymryd sawl munud i lwytho i lawr a gosod yr uwchraddiad. Byddwch yn amyneddgar.
hy: Թարմացումը ներբեռնելու և տեղադրելու համար կարող է տևել մի քանի րոպե: Եղեք համբերատար։
ko: 업그레이드를 다운로드하고 설치하는 데 몇 분 정도 걸릴 수 있습니다. 인내심을 가지세요.
ne: यसलाई डाउनलोड गर्न र अपग्रेड स्थापना गर्न धेरै मिनेट लाग्न सक्छ। धैर्यवान हुनुहोस्।
sl: Prenos in namestitev nadgradnje lahko traja nekaj minut. Bodite potrpežljivi.

source: Depending on your server configuration, you may be able to upgrade automatically.
cy: Yn dibynnu ar ffurfweddiad eich gweinydd, efallai y gallwch chi uwchraddio'n awtomatig.
hy: Կախված ձեր սերվերի կազմաձևից, դուք կարող եք ավտոմատ կերպով թարմացնել:
ko: 서버 구성에 따라 자동으로 업그레이드할 수 있습니다.
ne: तपाइँ स्वचालित रूपमा अपग्रेड गर्न सक्षम हुन सक्नुहुन्छ, तर तपाइँको सर्भर कन्फिगरेसनमा निर्भर हुन्छ ।
sl: Odvisno od nastavitve strežnika bo morda nadgradnja lahko izvedena samodejno.

source: User’s account has been inactive too long:
cy: Mae cyfrif defnyddiwr wedi bod yn anweithredol yn rhy hir:
hy: Օգտատիրոջ հաշիվը չափազանց երկար ժամանակ անգործուն է.
ko: 사용자 계정이 너무 오래 비활성 상태입니다:
ne: प्रयोगकर्ताको खाता धेरै लामो समयदेखि निष्क्रिय छ:
sl: Uporabniški račun je bil predolgo neaktiven:

source: User didn’t verify within 7 days.
cy: Nid yw'r defnyddiwr wedi gwirio o fewn 7 diwrnod.
hy: Օգտատերը չի հաստատել 7 օրվա ընթացքում։
ko: 사용자가 7 일 이내에 확인하지 않았습니다.
ne: प्रयोगकर्ताले ७ दिन भित्र प्रमाणीकरण गरेनन्।
sl: Uporabnik ni bil overjen v enem tednu.

source: User not verified by administrator.
cy: Nid yw'r defnyddiwr wedi ei wirio gan y gweinyddwr.
hy: Օգտատերը չի հաստատվել ադմինիստրատորի կողմից:
ko: 관리자가 사용자를 확인하지 않았습니다.
ne: प्रयोगकर्ता प्रशासक द्वारा प्रमाणित छैन।
sl: Uporabnika ni overil skrbnik.

source: Nothing found to cleanup
cy: Heb ganfod dim i'w lanhau
hy: Մաքրման համար ոչինչ չի գտնվել
ko: 정리할 항목이 없습니다
ne: क्लीन गर्न केही भेटिएन
sl: Ne najdem ničesar za brisanje

source: Real name
cy: Enw go iawn
hy: Իրական անուն
ko: 실제 이름
ne: वास्तविक नाम
sl: Pravo ime

source: This is your real name, as you would like it displayed on screen.
cy: Dyma'ch enw go iawn, fel yr hoffech iddo gael ei ddangos ar y sgrin.
hy: Սա ձեր իսկական անունն է, ինչպես կցանկանայիք, որ այն ցուցադրվի էկրանին:
ko: 화면에 표시하려는 실제 이름입니다.
ne: यो तपाईंको वास्तविक नाम हो, जसरी तपाईं यसलाई स्क्रिनमा देखाउन चाहनुहुन्छ।
sl: To je vaše resnično ime, kot bo prikazano na zaslonu.

source: Usernames are case-insensitive and ignore accented letters, so that “chloe”, “chloë”, and “Chloe” are considered to be the same.
cy: Nid yw enwau defnyddwyr yn dibynnu ar faint nac acenion, mae “sian”, “siân”, a “Siân” yn cael eu hystyried fel yr un fath.
hy: Օգտվողի անունները մեծատառերի չափորոշիչ չեն և անտեսում են ընդգծված տառերը, ուստի «chloe», «chloë» և «Chloe» համարվում են նույնը:
ko: 사용자 이름은 대소 문자를 구분하지 않으며 악센트 부호 문자를 무시하므로 “chloe”, “chloë”및 “Chloe”는 동일하게 간주됩니다.
ne: प्रयोगकर्तानामहरू केस-संवेदनशील हुन्छन् र उच्चारण गरिएका अक्षरहरूलाई बेवास्ता गर्छन्, त्यसैले "chloe", "chloë", र "Chloe" लाई समान मानिन्छ।
sl: Pri uporabniških imenih ne ločimo velikih in malih črk ter naglašenih črk, zato so “spela”, “špela” in “Špela” isto uporabniško ime.

source: Use at least %s character.
cy: Defnyddiwch o leiaf %s nodau.
hy: Օգտագործեք առնվազն %s նշան:
ko: %s자 이상을 사용하십시오.
ne: कम्तिमा %s वर्ण प्रयोग गर्नुहोस्।
sl: Uporabite vsaj %s znak.

source: Passwords must be at least 8 characters long and are case-sensitive, so that “secret” is different from “SECRET”.
cy: Rhaid i gyfrineiriau fod o leiaf 8 nod o hyd ac yn sensitif i faint, mae “cyfrinach” yn wahanol i “CYFRINACH”.
hy: Գաղտնաբառերը պետք է պարունակեն առնվազն 8 նիշ և ունեն մեծատառերի զգայունություն, որպեսզի «գաղտնիքը» տարբերվի «գաղտնի»ից:
ko: 비밀번호는 8자 이상이어야 하며 대소문자를 구분하므로 "secret"와 "SECRET"이 다릅니다.
ne: पासवर्डहरू कम्तिमा 8 वर्ण लामो र केस-संवेदनशील हुनुपर्छ, त्यसैले "गोप्य" "सेक्रेट" भन्दा फरक छ।
sl: Gesla morajo biti dolga vsaj 8 znakov in razlikujejo med velikimi in malimi črkami, zato je “skrivnost” različno od “SKRIVNOST”.

source: This email address will be used to send password reminders, website notifications, and messages from other family members who are registered on the website.
cy: Mae'r cyfeiriad e-bost hwn yn cael ei ddefnyddio i anfon nodiadau atgoffa cyfrinair, hysbysiadau gwefan, a negeseuon gan aelodau eraill o'r teulu sydd wedi'u cofrestru ar y wefan.
hy: Այս էլփոստի հասցեն կօգտագործվի գաղտնաբառի հիշեցումներ, կայքի ծանուցումներ և հաղորդագրություններ ուղարկելու ընտանիքի այլ անդամներից, ովքեր գրանցված են կայքում:
ko: 이 이메일 주소는 비밀번호 알림, 웹 사이트 알림 및 웹 사이트에 등록 된 다른 가족 구성원의 메시지를 보내는 데 사용됩니다.
ne: यो इमेल ठेगाना पासवर्ड रिमाइन्डरहरू, वेबसाइट सूचनाहरू, र वेबसाइटमा दर्ता भएका अन्य परिवारका सदस्यहरूबाट सन्देशहरू पठाउन प्रयोग गरिनेछ।
sl: Ta e-poštni naslov bomo uporabili za opomnike, obvestila spletišča in sporočila, ki vam jih bodo poslali drugi registrirani uporabniki spletišča.

source: Account approval and email verification
cy: Cymeradwyo cyfrif a gwirio e-bost
hy: Հաշվի հաստատում և էլփոստի հաստատում
ko: 계정 승인 및 이메일 확인
ne: खाता स्वीकृति र इमेल प्रमाणिकरण
sl: Odobritev računa in overjanje e-pošte

source: Email verified
cy: E-bost wedi'i wirio
hy: Էլփոստը հաստատված է
ko: Email 확인됨
ne: इमेल प्रमाणित भयो
sl: E-pošta overjena

source: Approved by administrator
cy: Cymeradwywyd gan weinyddwr
hy: Հաստատված է ադմինիստրատորի կողմից
ko: 관리자 승인
ne: Admin द्वारा स्वीकृत भयो
sl: Odobril skrbnik

source: When a user registers for an account, an email is sent to their email address with a verification link. When they follow this link, we know the email address is correct, and the “email verified” option is selected automatically.
cy: Pan fydd defnyddiwr yn cofrestru ar gyfer cyfrif, bydd e-bost yn cael ei anfon i'w cyfeiriad e-bost gyda dolen ddilysu. Pan fyddan nhw'n dilyn y ddolen hon, rydym yn gwybod bod y cyfeiriad e-bost yn gywir, a bydd yr opsiwn “gwirio e-bost” yn cael ei ddewis yn awtomatig.
hy: Երբ օգտատերը գրանցվում է հաշիվ, նամակ է ուղարկվում նրա էլ. հասցեին՝ հաստատման հղումով: Երբ նրանք հետևում են այս հղմանը, մենք գիտենք, որ էլփոստի հասցեն ճիշտ է, և «էլ․ հասցեն հաստատված» տարբերակը ընտրվում է ավտոմատ կերպով։
ko: 사용자가 계정을 등록하면 확인 링크가 포함 된 이메일이 이메일 주소로 전송됩니다. 그들이이 링크를 따라갈 때, 우리는 이메일 주소가 정확하다는 것을 알고 있으며“이메일 확인”옵션이 자동으로 선택됩니다.
ne: जब प्रयोगकर्ताले खाताको लागि दर्ता गर्दछ, प्रमाणीकरण लिङ्कको साथ उनीहरूको इमेल ठेगानामा इमेल पठाइन्छ। जब तिनीहरूले यो लिङ्क पछ्याउनुहोस्, हामीलाई थाहा छ इमेल ठेगाना सही छ, र "इमेल प्रमाणित" विकल्प स्वचालित रूपमा चयन हुन्छ।
sl: Ko uporabnik registrira račun, dobi na e-poštni naslov sporočilo s povezavo za overjanje. Ko uporabnik sledi tej povezavi, sistem ve, da je njegov e-poštni naslov pravilen, zato se samodejno izbere možnost “e-pošta overjena”.

source: If an administrator creates a user account, the verification email is not sent, and the email must be verified manually.
cy: Os yw gweinyddwr yn creu cyfrif defnyddiwr, nid yw'r e-bost dilysu yn cael ei anfon, a rhaid gwirio'r e-bost â llaw.
hy: Եթե ադմինիստրատորը ստեղծում է օգտատիրոջ հաշիվ, հաստատման նամակը չի ուղարկվում, և էլփոստը պետք է ստուգվի ձեռքով:
ko: 관리자가 사용자 계정을 생성한 경우 확인 메일이 발송되지 않으며, 수동으로 메일을 확인해야 합니다.
ne: यदि एडमिनले प्रयोगकर्ता खाता सिर्जना गर्छ भने, प्रमाणीकरण इमेल पठाइँदैन, र इमेल म्यानुअल रूपमा प्रमाणित गरिनुपर्छ।
sl: Če skrbnik ustvari uporabniški račun, potrditveno e-poštno sporočilo ni poslano, zato je treba e-pošto preveriti ročno.

source: You should not approve an account unless you know that the email address is correct.
cy: Dylech chi ddim cymeradwyo cyfrif oni bai eich bod yn gwybod bod y cyfeiriad e-bost yn gywir.
hy: Դուք չպետք է հաստատեք հաշիվը, եթե չգիտեք, որ էլփոստի հասցեն ճիշտ է:
ko: 이메일 주소가 정확하다는 것을 모르면 계정을 승인해서는 안됩니다.
ne: इमेल ठेगाना सही छ भन्ने थाहा नभएसम्म तपाईंले खाता अनुमोदन गर्नु हुँदैन।
sl: Računa ne smete odobriti, razen če ste prepričani, da je e-poštni naslov pravilen.

source: A user will not be able to sign in until both “email verified” and “approved by administrator” are selected.
cy: Ni fydd defnyddiwr yn gallu mewngofnodi nes bod “gwirio e-bost” a “chymeradwy gan weinyddwr” yn cael eu dewis.
hy: Օգտատերը չի կարողանա մուտք գործել, մինչև չընտրվեն և՛ «էլ․ հասցեն հաստատված» և «հաստատված է ադմինիստրատորի կողմից»։
ko: "이메일 확인"과 "관리자가 승인 함"이 모두 선택 될 때까지 사용자는 로그인 할 수 없습니다.
ne: प्रयोगकर्ताले "इमेल प्रमाणित" र "प्रशासकद्वारा अनुमोदित" दुवै चयन नगरेसम्म साइन इन गर्न सक्षम हुनेछैन।
sl: Uporabnik se ne bo mogel prijaviti, dokler nista izbrani možnosti “e-pošta preverjena” in “odobril skrbnik”.

source: Automatically accept changes made by this user
cy: Derbyn yn awtomatig newidiadau a wnaed gan y defnyddiwr hwn
hy: Ինքնաբերաբար ընդունել այս օգտվողի կողմից կատարված փոփոխությունները
ko: 이 사용자가 변경한 사항을 자동으로 수락
ne: यस प्रयोगकर्ताद्वारा गरिएका परिवर्तनहरू स्वतः स्वीकार गर्नुहोस्
sl: Samodejno sprejmi spremembe, ki jih je naredil ta uporabnik

source: Normally, any changes made to a family tree need to be reviewed by a moderator. This option allows a user to make changes without needing a moderator.
cy: Fel rheol, mae angen i gymedrolwr adolygu unrhyw newidiadau a wneir i gart achu. Mae'r opsiwn hwn yn caniatáu i ddefnyddiwr wneud newidiadau heb fod angen cymedrolwr.
hy: Սովորաբար, տոհմածառում կատարված ցանկացած փոփոխություն պետք է վերանայվի մոդերատորի կողմից: Այս տարբերակը թույլ է տալիս օգտվողին փոփոխություններ կատարել առանց մոդերատորի կարիքի:
ko: 일반적으로 가계도에 대한 모든 변경 사항은 중재자가 검토해야 합니다. 이 옵션을 사용하면 중재자 없이도 사용자가 변경할 수 있습니다.
ne: सामान्यतया, पारिवारिक वृक्षमा गरिएका कुनै पनि परिवर्तनहरू मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक छ। यो विकल्पले प्रयोगकर्तालाई मध्यस्थकर्ताको आवश्यकता बिना परिवर्तन गर्न अनुमति दिन्छ।
sl: Običajno mora vse spremembe družinskega drevesa pregledati moderator. Ta možnost uporabniku omogoča spreminjanje družinskega drevesa brez pregleda moderatorja.

source: Visible online
cy: Yn weladwy ar-lein
hy: Տեսանելի է առցանց
ko: 온라인으로 표시
ne: अनलाइन देखिने
sl: Vidna prijava

source: Visible to other users when online
cy: Yn weladwy i ddefnyddwyr eraill pan fyddan nhw ar-lein
hy: Տեսանելի է այլ օգտվողների համար, երբ առցանց
ko: 온라인 일 때 다른 사용자에게 공개
ne: अनलाइन हुँदा अन्य प्रयोगकर्ताहरूले देख्न सक्छन्
sl: Drugi vidijo, da je uporabnik prijavljen

source: You can choose whether to appear in the list of users who are currently signed-in.
cy: Gallwch ddewis a ddylech ymddangos yn y rhestr o ddefnyddwyr sydd wedi mewngofnodi ar hyn o bryd.
hy: Դուք կարող եք ընտրել, թե արդյոք հայտնվե՞լ այս պահին մուտք գործած օգտատերերի ցանկում:
ko: 현재 로그인 한 사용자 목록에 표시할지 여부를 선택할 수 있습니다.
ne: तपाईं हाल साइन-इन भएका प्रयोगकर्ताहरूको सूचीमा देखा पर्ने कि नहोस् भन्ने छनौट गर्न सक्नुहुन्छ।
sl: Izberete lahko, ali želite biti prikazani na seznamu trenutno prijavljenih uporabnikov.

source: Preferred contact method
cy: Y dull cysylltu gorau
hy: Նախընտրելի շփման մեթոդ
ko: 선호하는 연락 방법
ne: रुचाइएको सम्पर्क विधि
sl: Prednostni način sporočanja

source: Site members can send each other messages. You can choose to how these messages are sent to you, or choose not receive them at all.
cy: Gall aelodau'r wefan anfon negeseuon at ei gilydd. Gallwch ddewis sut mae'r negeseuon hyn yn cael eu hanfon atoch, neu ddewis peidio â'u derbyn o gwbl.
hy: Կայքի անդամները կարող են միմյանց հաղորդագրություններ ուղարկել: Դուք կարող եք ընտրել, թե ինչպես կուղարկվեն ձեզ այս հաղորդագրությունները, կամ ընտրել դրանք ընդհանրապես չստանալ:
ko: 사이트 회원은 서로 메시지를 보낼 수 있습니다. 이러한 메시지를 보내는 방법을 선택하거나 전혀받지 않도록 선택할 수 있습니다.
ne: साइट सदस्यहरूले एकअर्कालाई सन्देशहरू पठाउन सक्छन्। तपाइँ यी सन्देशहरू तपाइँलाई कसरी पठाइन्छ भनेर छनौट गर्न सक्नुहुन्छ, वा तिनीहरूलाई प्राप्त नगर्नुहोस्।
sl: Člani spletišča si lahko pošiljajo sporočila. Izberete lahko, kako vam bodo drugi uporabniki pošiljali sporočila oziroma ali želite sporočila sploh prejemati.

source: Administrator comments on user
cy: Sylwadau'r gweinyddwr ar y defnyddiwr
hy: Ադմինիստրատորի մեկնաբանությունները օգտատիրոջ մասին
ko: 사용자에 대한 관리자 의견
ne: प्रयोगकर्तामा प्रशासक टिप्पणीहरू
sl: Skrbniški komentarji o uporabniku

source: Administrator
cy: Gweinyddwr
hy: Ադմինիստրատոր
ko: 관리자
ne: प्रशासक
sl: Skrbnik

source: Access to family trees
cy: Mynediad i gartiau achau
hy: Տոհմածառերի հասանելիություն
ko: 가계도 이용
ne: पारिवारिक वृक्षहरूमा पहुँच
sl: Dostop do družinskih dreves

source: A role is a set of access rights, which give permission to view data, change preferences, etc. Access rights are assigned to roles, and roles are granted to users. Each family tree can assign different access to each role, and users can have a different role in each family tree.
cy: Mae rôl yn set o hawliau mynediad, sy'n rhoi caniatâd i weld data, newid dewisiadau, ac ati. Mae hawliau mynediad yn cael eu rhoi i rolau, a rolau i ddefnyddwyr. Gall pob cart achau neilltuo mynediad gwahanol i bob rôl, a gall defnyddwyr gael rôl wahanol ym mhob cart achau.
hy: Դերը մուտքի իրավունքների մի շարք է, որը թույլ է տալիս դիտել տվյալները, փոխել նախապատվությունները և այլն: Մուտքի իրավունքները վերագրվում են դերերին, իսկ դերերը տրամադրվում են օգտվողներին: Յուրաքանչյուր տոհմածառ կարող է տարբեր մուտք հատկացնել յուրաքանչյուր դերին, և օգտվողները կարող են ունենալ տարբեր դեր յուրաքանչյուր տոհմածառում:
ko: 등급은 데이터를 보거나 환경 설정을 변경할 수있는 권한을 부여하는 일련의 액세스 권한입니다. 액세스 권한은 등급에 할당되며 사용자에게 등급이 부여됩니다. 각 가계도는 각 등급에 다른 액세스 권한을 할당 할 수 있으며 사용자는 각 가계도에서 다른 등급을 가질 수 있습니다.
ne: भूमिका भनेको पहुँच अधिकारहरूको सेट हो, जसले डेटा हेर्न, प्राथमिकताहरू परिवर्तन गर्ने इत्यादि अनुमति दिन्छ। पहुँच अधिकारहरू भूमिकाहरूलाई तोकिन्छ, र भूमिकाहरू प्रयोगकर्ताहरूलाई दिइन्छ। प्रत्येक पारिवारिक रूखले प्रत्येक भूमिकामा फरक पहुँच तोक्न सक्छ, र प्रयोगकर्ताहरूले प्रत्येक पारिवारिक रूखमा फरक भूमिका खेल्न सक्छन् ।
sl: Vloga je množica pravic dostopa, ki dajejo različna dovoljenja za ogled podatkov, spreminjanje nastavitev itd. Pravice dostopa so dodeljene vlogam, vloge pa uporabnikom. Pri vsakem družinskem drevesu lahko vsaki vlogi dodelimo drugačen dostop, uporabniki pa imajo lahko drugačno vlogo v vsakem družinskem drevesu.

source: Everybody has this role, including visitors to the website and search engines.
cy: Mae gan bawb y rôl hon, gan gynnwys ymwelwyr â'r wefan a pheiriannau chwilio.
hy: Բոլորն ունեն այս դերը, ներառյալ կայքի այցելուները և որոնման համակարգերը:
ko: 웹 사이트 및 검색 엔진 방문자를 포함하여 모든 사람이 이 역할을 합니다.
ne: वेबसाइट र खोज इन्जिनहरूमा आगन्तुकहरू सहित सबैको यो भूमिका हुन्छ।
sl: To vlogo imajo vsi, vključno z obiskovalci spletišča in spletnimi iskalniki.

source: This role has all the permissions of the visitor role, plus any additional access granted by the family tree configuration.
cy: Mae gan y rôl hon holl ganiatâd rôl yr ymwelydd, ynghyd ag unrhyw fynediad ychwanegol sy'n cael ei roi gan ffurfweddiad y cart achau.
hy: Այս դերն ունի այցելուի դերի բոլոր թույլտվությունները, գումարած ընտանեկան ծառի կազմաձևման կողմից տրված ցանկացած լրացուցիչ մուտք:
ko: 이 역할에는 방문자 역할의 모든 권한과 가계도 구성에서 부여한 추가 액세스 권한이 있습니다.
ne: यो भूमिकामा आगन्तुक भूमिकाका सबै अनुमतिहरू छन्, साथै पारिवारिक रूख कन्फिगरेसनद्वारा दिइएको कुनै पनि अतिरिक्त पहुँच।
sl: Ta vloga ima vsa dovoljenja vloge obiskovalca in morebitne dodatne dostope, ki jih odobri nastavitev družinskega drevesa.

source: This role has all the permissions of the member role, plus permission to add/change/delete data. Any changes will need to be reviewed by a moderator, unless the user has the “automatically accept changes” option enabled.
cy: Mae gan y rôl hon holl ganiatâd rôl yr aelod, ynghyd â chaniatâd i ychwanegu/newid/dileu data. Bydd angen i gymedrolwr adolygu unrhyw newidiadau, oni bai bod gan y defnyddiwr yr opsiwn “derbyn newidiadau yn awtomatig” wedi'i alluogi.
hy: Այս դերն ունի անդամի դերի բոլոր թույլտվությունները, գումարած տվյալներ ավելացնելու/փոխելու/ջնջելու թույլտվությունը։ Ցանկացած փոփոխություն պետք է վերանայվի մոդերատորի կողմից, բացառությամբ այն դեպքերի, երբ օգտատերը միացված չէ «ավտոմատ ընդունել փոփոխությունները» տարբերակը:
ko: 이 역할에는 멤버 역할의 모든 권한과 데이터 추가/변경/삭제 권한이 있습니다. 사용자가 “변경사항을 자동으로 수락" 하지 않는 한 변경자는 중재자가 검토해야합니다.
ne: यो भूमिकामा सदस्य भूमिकाका सबै अनुमतिहरू छन्, साथै डेटा थप्ने/परिवर्तन गर्ने/मेट्ने अनुमति छ। प्रयोगकर्ताले "स्वचालित रूपमा परिवर्तनहरू स्वीकार गर्नुहोस्" विकल्प सक्षम नगरेसम्म कुनै पनि परिवर्तनहरू मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta vloga ima vsa dovoljenja vloge člana in dovoljenje za dodajanje/spreminjanje/brisanje podatkov. Vse spremembe mora pregledati moderator, razen če ima uporabnik omogočeno možnost “Samodejno sprejmi spremembe”.

source: This role has all the permissions of the editor role, plus permission to accept/reject changes made by other users.
cy: Mae gan y rôl hon holl ganiatâd rôl y golygydd, ynghyd â chaniatâd i dderbyn/gwrthod newidiadau a wnaed gan ddefnyddwyr eraill.
hy: Այս դերն ունի խմբագրի դերի բոլոր թույլտվությունները, գումարած այլ օգտվողների կողմից կատարված փոփոխություններն ընդունելու/մերժելու թույլտվությունը:
ko: 이 역할에는 편집자 역할의 모든 권한과 다른 사용자의 변경 사항을 수락/거부 할 수 있는 권한이 있습니다.
ne: यो भूमिकामा सम्पादक भूमिकाका सबै अनुमतिहरू छन्, साथै अन्य प्रयोगकर्ताहरूले गरेका परिवर्तनहरू स्वीकार/अस्वीकार गर्ने अनुमतिहरू।
sl: Ta vloga ima vsa dovoljenja vloge urednika in dovoljenje za sprejemanje/zavrnitev sprememb, ki so jih naredili drugi uporabniki.

source: This role has all the permissions of the moderator role, plus any additional access granted by the family tree configuration, plus permission to change the settings/configuration of a family tree.
cy: Mae gan y rôl hon holl ganiatâd rôl y cymedrolwr, ynghyd ag unrhyw fynediad ychwanegol sy'n cael ei roi gan ffurfweddiad y cart achau, ynghyd â chaniatâd i newid gosodiadau/ffurfweddiad y cart achau.
hy: Այս դերն ունի մոդերատորի դերի բոլոր թույլտվությունները, գումարած տոհմածառի կազմաձևման կողմից տրված ցանկացած լրացուցիչ մուտք, գումարած տոհմածառի կարգավորումները/կոնֆիգուրացիաները փոխելու թույլտվություն:
ko: 이 역할에는 중재자 역할의 모든 권한과 가계도 구성에서 부여한 추가 액세스 권한과 가계도의 설정/구성을 변경할 수있는 권한이 있습니다.
ne: यस भूमिकामा मध्यस्थ भूमिकाका सबै अनुमतिहरू छन्, साथै पारिवारिक रूख कन्फिगरेसनद्वारा दिइएको कुनै पनि अतिरिक्त पहुँच, साथै पारिवारिक रूखको सेटिङ/कन्फिगरेसन परिवर्तन गर्ने अनुमति।
sl: Ta vloga ima vsa dovoljenja vloge moderatorja in morebitne dodatne dostope, ki jih odobri nastavitev družinskega drevesa ter dovoljenje za spreminjanje nastavitev družinskega drevesa.

source: This role has all the permissions of the manager role in all family trees, plus permission to change the settings/configuration of the website, users, and modules.
cy: Mae gan y rôl hon holl ganiatâd rôl y rheolwr ym mhob cart achau, ynghyd â chaniatâd i newid gosodiadau/ffurfweddiad y wefan, defnyddwyr a modiwlau.
hy: Այս դերն ունի կառավարչի դերի բոլոր թույլտվությունները բոլոր տոհմածառերում, գումարած թույլտվություն փոխելու կայքի, օգտատերերի և մոդուլների կարգավորումները/կազմաձևերը:
ko: 이 역할에는 모든 가계도에서 관리자 역할의 모든 권한과 웹 사이트, 사용자 및 모듈의 설정/구성을 변경할 수 있는 권한이 있습니다.
ne: यस भूमिकामा सबै पारिवारिक रूखहरूमा प्रबन्धक भूमिकाका सबै अनुमतिहरू छन्, साथै वेबसाइट, प्रयोगकर्ताहरू, र मोड्युलहरूको सेटिङ/कन्फिगरेसन परिवर्तन गर्ने अनुमति।
sl: Ta vloga ima vsa dovoljenja vloge upravitelja v vseh družinskih drevesih ter dovoljenje za spreminjanje nastavitev spletišča, uporabnikov in modulov.

source: Individual record
cy: Cofnod unigolyn
hy: Անհատական ռեկորդ
ko: 인물 기록
ne: व्यक्तिगत रेकर्ड
sl: Zapis osebe

source: Link this user to an individual in the family tree.
cy: Cysylltwch y defnyddiwr hwn ag unigolyn yn y cart achau.
hy: Կապեք այս օգտվողին տոհմածառի անհատի հետ:
ko: 이 사용자를 가계도의 인물에게 연결합니다.
ne: यस प्रयोगकर्तालाई पारिवारिक रूखको एक व्यक्तिसँग लिङ्क गर्नुहोस्।
sl: Poveži tega uporabnika z osebo v družinskem drevesu.

source: No
cy: Na
hy: Ոչ
ko: 아니오
ne: होइन
sl: Ne

source: You must specify an individual record before you can restrict the user to their immediate family.
cy: Rhaid i chi bennu cofnod unigol cyn y gallwch gyfyngu'r defnyddiwr i'w deulu agos.
hy: Դուք պետք է նշեք անհատական գրառում, որպեսզի կարողանաք սահմանափակել օգտվողին իր անմիջական ընտանիքով:
ko: 사용자를 직계 가족으로 제한하기 전에 인물 레코드를 지정해야합니다.
ne: तपाईंले प्रयोगकर्तालाई उनीहरूको नजिकको परिवारमा प्रतिबन्ध लगाउनु अघि तपाईंले व्यक्तिगत रेकर्ड निर्दिष्ट गर्नुपर्छ।
sl: Preden lahko osebo omejite na njeno ožjo družino, morate določiti osebni zapis.

source: Masquerade as this user
cy: Ffugio fel y defnyddiwr hwn
hy: Դիմակահանդես, ինչպես այս օգտվողը
ko: 이 사용자로 변경
ne: यो प्रयोगकर्ताको रूपमा मास्करेड गर्नुहोस्
sl: Maskiraj se kot ta uporabnik

source: Date registered
cy: Dyddiad cofrestru
hy: Գրանցման ամսաթիվը
ko: 등록 날짜
ne: दर्ता मिति
sl: Datum registracije

source: Last signed in
cy: Mewngofnodwyd diwethaf
hy: Վերջին անգամ մուտք է գործել
ko: 마지막 로그인
ne: पछिल्लो पटक साइन इन गरियो
sl: Zadnja prijava

source: Approved
cy: Cymeradwywyd
hy: Հաստատված է
ko: 승인됨
ne: सदर गरियो
sl: Odobreno

source: view
cy: gweld
hy: դիտել
ko: 보기
ne: हेर्नुहोस्
sl: Prikaži

source: %s family
cy: %s teulu
hy: %s Ընտանիք
ko: %s 가족
ne: %s परिवार
sl: %s družina

source: Show
cy: Dangos
hy: Ցույց տալ
ko: 표시
ne: देखाउनुहोस्
sl: Prikaži

source: Filter
cy: Hidlo
hy: Զտել
ko: 필터
ne: छनौट गर्नुस

source: All individuals
cy: Pob unigolyn
hy: Բոլոր անհատները
ko: 모든 인물
ne: सबै व्यक्तिहरू
sl: Vse osebe

source: Living individuals
cy: Unigolion byw
hy: Կենդանի անհատներ
ko: 살아있는 인물
ne: जीवित व्यक्तिहरू
sl: Žive osebe

source: Recent years (&lt; 100 yrs)
cy: Y blynyddoedd diwethaf (&lt;; 100 oed)
hy: Վերջին տարիները (< 100 տարի)
ko: 최근 몇 년 (&lt; 100년간)
ne: हालका वर्षहरू (&lt; 100 वर्ष)
sl: Zadnja leta (&lt; 100 let)

source: Custom event
cy: Digwyddiad cyfaddas
hy: Պատվերով միջոցառում
ko: 사용자 정의 이벤트
ne: अनुकूलन घटना
sl: Dogodek po meri

source: View this day
cy: Gweld y diwrnod hwn
hy: Դիտեք այս օրը
ko: 오늘 보기
ne: यो दिन हेर्नुहोस्
sl: Poglej današnji dan

source: View this month
cy: Gweld y mis hwn
hy: Դիտեք այս ամիս
ko: 월 보기
ne: यो महिना हेर्नुहोस्
sl: Poglej ta mesec

source: View this year
cy: Gweld y flwyddyn hon
hy: Դիտեք այս տարի
ko: 년 보기
ne: यो वर्ष हेर्नुहोस्
sl: Poglej to leto

source: Links
cy: Cysylltiadau
hy: Հղումներ
ko: 링크
ne: लिङ्कहरू
sl: Povezave

source: No results found
hy: Ոչ մի արդյունք չի գտնվել
ko: 검색 결과가 없습니다
ne: कुनै परिणाम फेला परेन

source: Your name
cy: Eich enw
hy: Ձեր անունը
ko: 당신의 이름
ne: तपाईको नाम
sl: Vaše ime

# unknown people
source: Unknown
cy: Anhysbys
hy: Անհայտ
ko: 알 수 없는
ne: अज्ञात
sl: Neznano
