Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Phonetic algorithm
cy: Algorithm ffonetig
hy: Հնչյունական ալգորիթմ
ko: 발음(소리 나는) 알고리즘
ne: फोनेटिक एल्गोरिथ्म
sl: Fonetični algoritem

source: Replace with
cy: Amnewid gyda
hy: Փոխարինել հետ
ko: 으로 변경
ne: यससँग बदल्नुहोस्
sl: Zamenjaj s/z

source: Entire record
cy: Cofnod cyfan
hy: Ամբողջ ռեկորդը
ko: 전체 레코드
ne: सम्पूर्ण रेकर्ड
sl: Celoten zapis

source: replace
cy: amnewid
hy: փոխարինել
ko: 교체
ne: प्रतिस्थापन
sl: Zamenjaj

source: select all
cy: dewis y cyfan
hy: ընտրել բոլորը
ko: 모두선택
sl: Izberi vse

source: select none
cy: dewis dim
hy: ընտրել ոչ մեկը
ko: 선택하지 않음
sl: Brez izbire

source: invert selection
cy: gwrthdroi'r dewis
hy: շրջել ընտրությունը
ko: 반전 선택
sl: obrni izbor

source: Checking server configuration
cy: Gwirio ffurfweddiad y gweinydd
hy: Սերվերի կոնֆիգուրացիայի ստուգում
ko: 서버 환경설정 확인
ne: सर्भर कन्फिगरेसन जाँच गर्दै
sl: Preverjam nastavitev strežnika

source: The server configuration is OK.
cy: Mae ffurfweddiad y gweinydd yn iawn.
hy: Սերվերի կոնֆիգուրացիան կարգին է:
ko: 서버 설정이 정상입니다.
ne: सर्भर कन्फिगरेसन ठीक छ।
sl: Nastavitev strežnika je v redu.

source: Checking server capacity
cy: Gwirio capasiti'r gweinydd
hy: Սերվերի հզորության ստուգում
ko: 서버 용량 확인
ne: सर्भर क्षमता जाँच गर्दै
sl: Preverjam zmogljivost strežnika

source: The memory and CPU time requirements depend on the number of individuals in your family tree.
cy: Mae'r gofynion y cof ac amser y CPU yn dibynnu ar nifer yr unigolion yn eich cart achau.
hy: Հիշողության և պրոցեսորի ժամանակի պահանջները կախված են ձեր տոհմածառի անհատների թվից:
ko: 메모리 및 CPU 사양 요구 사항은 가계도의 인물 수에 따라 다릅니다.
ne: मेमोरी र CPU समय आवश्यकताहरू तपाईंको पारिवारिक रूखमा व्यक्तिहरूको संख्यामा निर्भर गर्दछ।
sl: Zahteve glede pomnilnika in procesorskega časa so odvisne od števila oseb v vašem družinskem drevesu.

source: The following list shows typical requirements.
cy: Mae'r rhestr ganlynol yn dangos gofynion nodweddiadol.
hy: Հետևյալ ցանկը ցույց է տալիս բնորոշ պահանջները:
ko: 다음 목록은 일반적인 요구 사항을 표시합니다.
ne: निम्न सूचीले सामान्य आवश्यकताहरू देखाउँछ।
sl: Naslednji seznam prikazuje tipične zahteve.

source: Small systems (500 individuals): 16–32 MB, 10–20 seconds
cy: Systemau bach (500 o unigolion): 16–32 MB, 10–20 eiliad
hy: Փոքր համակարգեր (500 անհատներ)՝ 16–32 ՄԲ, 10–20 վայրկյան
ko: 소규모 시스템 (개인 500 명) : 16–32MB, 10–20 초
ne: साना प्रणालीहरू (५०० व्यक्तिहरू): १६–३२ एमबी, १०–२० सेकेन्ड
sl: Majhni sistemi (500 oseb): 16–32 MB, 10–20 sekund

source: Medium systems (5,000 individuals): 32–64 MB, 20–40 seconds
cy: Systemau canolig (5,000 o unigolion): 32-64 MB, 20–40 eiliad
hy: Միջին համակարգեր (5000 անհատներ)՝ 32–64 ՄԲ, 20–40 վայրկյան
ko: 중형 시스템(개인 5,000명): 32–64MB, 20–40초
ne: मध्यम प्रणालीहरू (५,००० व्यक्तिहरू): ३२–६४ एमबी, २०–४० सेकेन्ड
sl: Srednji sistemi (5.000 oseb): 32–64 MB, 20–40 sekund

source: Large systems (50,000 individuals): 64–128 MB, 40–80 seconds
cy: Systemau mawr (50,000 o unigolion): 64–128 MB, 40-80 eiliad
hy: Խոշոր համակարգեր (50,000 անհատներ)՝ 64–128 ՄԲ, 40–80 վայրկյան
ko: 대형 시스템(개인 50,000명): 64–128MB, 40–80초
ne: ठूला प्रणालीहरू (५०,००० व्यक्तिहरू): ६४–१२८ एमबी, ४०–८० सेकेन्ड
sl: Veliki sistemi (50.000 oseb): 64–128 MB, 40–80 sekund

source: This server’s memory limit is %s MB and its CPU time limit is %s seconds.
cy: Terfyn cof y gweinydd hwn yw %s MB a therfyn amser ei CPU yw %s eiliad.
hy: Այս սերվերի հիշողության սահմանաչափը %s ՄԲ է, իսկ պրոցեսորի ժամանակը` %s վայրկյան:
ko: 이 서버의 메모리 제한은 %s MB이고 CPU 시간 제한은 %s 초입니다.
ne: यो सर्भरको मेमोरी सीमा %s MB हो र यसको CPU समय सीमा %s सेकेन्ड हो।
sl: Omejitev pomnilnika tega strežnika je %s MB, omejitev procesorskega časa pa je %s sekund.

source: If you try to exceed these limits, you may experience server time-outs and blank pages.
cy: Os fyddwch yn ceisiwch mynd dros y terfynau hyn, efallai y byddwch yn profi oedi gan y gweinydd a thudalennau gwag.
hy: Եթե փորձեք գերազանցել այս սահմանները, դուք կարող եք հանդիպել սերվերի ժամանակի դադարեցման և դատարկ էջերի հետ:
ko: 이러한 제한을 초과하려고 하면 서버 시간 초과 및 빈 페이지가 발생할 수 있습니다.
ne: यदि तपाइँ यी सीमाहरू पार गर्ने प्रयास गर्नुहुन्छ भने, तपाइँ सर्भर टाइम-आउट र खाली पृष्ठहरू अनुभव गर्न सक्नुहुन्छ।
sl: Če poskušate preseči te omejitve, lahko pride do časovnih omejitev strežnika in praznih strani.

source: Connection to database server
cy: Cysylltiad â gweinydd cronfa ddata
hy: Միացում տվյալների բազայի սերվերին
ko: 데이터베이스 서버 연결
ne: डाटाबेस सर्भरमा जडान
sl: Povezava s strežnikom podatkovne baze

source: webtrees needs a database to store your genealogy data.
cy: mae angen cronfa ddata ar webtrees i storio eich data achau.
hy: webtrees-ին անհրաժեշտ է տվյալների բազա՝ ձեր ծագումնաբանական տվյալները պահելու համար:
ko: webtrees는 계보 데이터를 저장할 데이터베이스가 필요합니다.
ne: webtrees लाई तपाईको वंशावली डाटा भण्डारण गर्नको लागि डाटाबेस चाहिन्छ।
sl: webtrees potrebuje podatkovno bazo za shranjevanje rodoslovnih podatkov.

source: Database type
cy: Math o gronfa ddata
hy: Տվյալների բազայի տեսակը
ko: 데이터베이스 유형
ne: डाटाबेस प्रकार
sl: Vrsta podatkovne baze

source: Database connection
cy: Cysylltiad cronfa ddata
hy: Տվյալների բազայի միացում
ko: 데이터베이스 연결
ne: डाटाबेस जडान
sl: Povezava s podatkovno bazo

source: Connection type
hy: Միացման տեսակը
ne: जडान प्रकार

source: network
hy: ցանց

source: Table prefix
cy: Rhagddodiad tabl
hy: Սեղանի նախածանց
ko: 테이블 접두사
ne: तालिका उपसर्ग
sl: Predpona tabele

source: The prefix is optional, but recommended. By giving the table names a unique prefix you can let several different applications share the same database.
cy: Mae'r rhagddodiad yn ddewisol, ond rydym yn ei argymell. Trwy roi rhagddodiad unigryw i enwau'r tabl gallwch adael i sawl rhaglen wahanol rannu'r un gronfa ddata.
hy: Նախածանցը ընտրովի է, բայց խորհուրդ է տրվում: Աղյուսակների անունները տալով եզակի նախածանց՝ կարող եք թույլ տալ, որ մի քանի տարբեր հավելվածներ կիսեն նույն տվյալների բազան:
ko: 접두사는 선택 사항이지만 권장됩니다. 테이블 이름에 고유한 접두사를 부여하면 여러 다른 응용 프로그램이 동일한 데이터베이스를 공유 할 수 있습니다.
ne: उपसर्ग वैकल्पिक छ, तर सिफारिस गरिएको छ। तालिका नामहरू एक अद्वितीय उपसर्ग दिएर तपाईंले धेरै फरक अनुप्रयोगहरूलाई एउटै डाटाबेस साझेदारी गर्न दिन सक्नुहुन्छ।
sl: Predpona je neobvezna, vendar priporočljiva. Če imenom tabel dodelite enolično predpono, lahko več različnim aplikacijam omogočite skupno rabo iste podatkovne baze.

source: Use letters A-Z, a-z, digits 0-9, or underscores
cy: Defnyddiwch lythrennau A-Z, a-z, digidau 0-9, neu danlinelliad
hy: Օգտագործեք A-Z, a-z տառերը, 0-9 թվանշանները կամ ընդգծումները
ko: 문자 A-Z, a-z, 숫자 0-9 또는 밑줄을 사용하십시오
ne: A-Z, a-z, अंकहरू 0-9, वा अन्डरस्कोरहरू प्रयोग गर्नुहोस्
sl: Uporabi črke A-Z, a-z, števke 0-9 ali podčrtaje

source: Most sites are configured to use localhost. This means that your database runs on the same computer as your web server.
cy: Mae'r mwyafrif o wefannau wedi'u ffurfweddu i ddefnyddio localhost. Mae hyn yn golygu bod eich cronfa ddata yn rhedeg ar yr un cyfrifiadur â'ch gweinydd gwe.
hy: Կայքերի մեծ մասը կազմաձևված է տեղական հոսթ օգտագործելու համար: Սա նշանակում է, որ ձեր տվյալների բազան աշխատում է նույն համակարգչով, ինչ ձեր վեբ սերվերը:
ko: 대부분의 사이트는 localhost를 사용하도록 구성되어 있습니다. 즉, 데이터베이스가 웹 서버와 동일한 컴퓨터에서 실행됩니다.
ne: धेरैजसो साइटहरू लोकलहोस्ट प्रयोग गर्न कन्फिगर गरिएका छन्। यसको मतलब तपाईको डाटाबेस तपाईको वेब सर्भरको रूपमा उही कम्प्युटरमा चल्छ।
sl: Večina spletišč je nastavljenih tako, da uporabljajo localhost. To pomeni, da je podatkovna baza na istem računalniku, kot spletni strežnik.

source: Most sites are configured to use the default value of 5432.
cy: Mae'r mwyafrif o wefannau wedi'u ffurfweddu i ddefnyddio'r gwerth rhagosodedig 5432.
hy: Կայքերի մեծ մասը կազմաձևված է օգտագործել 5432-ի լռելյայն արժեքը:
ko: 대부분의 사이트는 기본값 5432를 사용하도록 구성되어 있습니다.
ne: अधिकांश साइटहरू 5432 को पूर्वनिर्धारित मान प्रयोग गर्न कन्फिगर गरिएको छ।
sl: Večina spletišč je nastavljenih tako, da uporabljajo privzeto vrednost 5432.

source: Most sites are configured to use the default value of 1433.
cy: Mae'r mwyafrif o wefannau wedi'u ffurfweddu i ddefnyddio gwerth rhagosodedig 1433.
hy: Կայքերի մեծ մասը կազմաձևված է օգտագործել 1433-ի լռելյայն արժեքը:
ko: 대부분의 사이트는 기본값 1433을 사용하도록 구성되어 있습니다.
ne: अधिकांश साइटहरू 1433 को पूर्वनिर्धारित मान प्रयोग गर्न कन्फिगर गरिएका छन्।
sl: Večina spletišč je nastavljenih tako, da uporabljajo privzeto vrednost 1433.

source: Administrator account
cy: Cyfrif gweinyddwr
hy: Ադմինիստրատորի հաշիվ
ko: 관리자 계정
ne: प्रशासक खाता
sl: Skrbniški račun

source: You need to set up an administrator account. This account can control all aspects of this webtrees installation. Please choose a strong password.
cy: Mae angen i chi greu cyfrif gweinyddwr. Gall y cyfrif hwn reoli pob agwedd ar y gosodiad webtrees hwn. Dewiswch gyfrinair cryf.
hy: Դուք պետք է ստեղծեք ադմինիստրատորի հաշիվ: Այս հաշիվը կարող է վերահսկել այս webtrees-ի տեղադրման բոլոր ասպեկտները: Խնդրում ենք ընտրել ուժեղ գաղտնաբառ:
ko: 관리자 계정을 설정해야합니다. 이 계정은이 웹 트리 설치의 모든면을 제어 할 수 있습니다.
ne: तपाईंले प्रशासक खाता सेट अप गर्न आवश्यक छ। यो खाताले यस वेबट्री स्थापनाका सबै पक्षहरूलाई नियन्त्रण गर्न सक्छ। कृपया बलियो पासवर्ड छान्नुहोस्।
sl: Nastaviti morate skrbniški račun. Ta račun lahko nadzoruje vse vidike te namestitve spletišča. Izberite močno geslo.

source: You will use this to sign in to webtrees.
cy: Byddwch yn defnyddio hwn i fewngofnodi i webtrees.
hy: Դուք կօգտագործեք սա վեբ ծառեր մուտք գործելու համար:
ko: 이를 사용하여 웹 트리에 로그인합니다.
ne: तपाईंले यसलाई वेबट्रीमा साइन इन गर्न प्रयोग गर्नुहुनेछ।
sl: To boste uporabili za prijavo v webtrees.

source: This must be at least six characters long. It is case-sensitive.
cy: Rhaid i hyn fod o leiaf chwe nod o hyd. Mae'n sensitif i faint nodau.
hy: Սա պետք է լինի առնվազն վեց նիշ: Այն զգայուն է մեծատառերի նկատմամբ:
ko: 6자 이상이어야합니다. 대소문자를 구분합니다.
ne: यो कम्तिमा ६ अक्षर लामो हुनुपर्छ। यो केस-संवेदनशील छ।
sl: Dolgo mora biti vsaj šest znakov. Razlikuje med velikimi in malimi črkami.

source: %s grandchild
cy: %s o wyrion
hy: %s թոռ
ko: %s 손주들
ne: %s नाति-नातिना
sl: %s vnuk

source: Could not verify the information you entered. Please try again or contact the site administrator for more information.
cy: Yn methu gwirio'r wybodaeth rydych wedi'i gyflwyno. Rhowch gynnig arall arni neu cysylltwch â gweinyddwr y wefan i gael mwy o wybodaeth.
hy: Չհաջողվեց հաստատել ձեր մուտքագրած տեղեկատվությունը: Խնդրում ենք կրկին փորձել կամ կապվել կայքի ադմինիստրատորի հետ լրացուցիչ տեղեկությունների համար:
ko: 입력한 정보를 확인할 수 없습니다. 다시 시도하거나 사이트 관리자에게 자세한 내용을 문의하십시오.
ne: तपाईंले प्रविष्ट गर्नुभएको जानकारी प्रमाणित गर्न सकेन। कृपया पुन: प्रयास गर्नुहोस् वा थप जानकारीको लागि साइट प्रशासकलाई सम्पर्क गर्नुहोस्।
sl: Vnesenih podatkov ni bilo mogoče preveriti. Poskusite znova ali se za več informacij obrnite na skrbnika spletišča.

source: You have confirmed your request to become a registered user.
cy: Rydych wedi cadarnhau eich cais i ddod yn ddefnyddiwr cofrestredig.
hy: Դուք հաստատել եք գրանցված օգտվող դառնալու Ձեր հայտը:
ko: 등록 된 사용자가 되기위한 요청을 확인했습니다.
ne: तपाईंले दर्ता प्रयोगकर्ता बन्न आफ्नो अनुरोध पुष्टि गर्नुभयो।
sl: Potrdili ste svojo zahtevo za registracijo uporabniškega računa.

source: The administrator has been informed. As soon as they give you permission to sign in, you can sign in with your username and password.
cy: Mae'r gweinyddwr wedi cael gwybod. Cyn gynted ag y byddan nh'n rhoi caniatâd i chi fewngofnodi, gallwch fewngofnodi gyda'ch enw defnyddiwr a'ch cyfrinair.
hy: Ադմինիստրատորը տեղեկացված է. Հենց որ նրանք ձեզ մուտք գործելու թույլտվություն տան, կարող եք մուտք գործել ձեր օգտանունով և գաղտնաբառով:
ko: 관리자에게 정보가 제공되었습니다. 로그인 권한을 부여하면 사용자 이름과 비밀번호로 로그인 할 수 있습니다.
ne: प्रशासकलाई जानकारी गराइएको छ। तिनीहरूले तपाईंलाई साइन इन गर्न अनुमति दिने बित्तिकै, तपाईंले आफ्नो प्रयोगकर्ता नाम र पासवर्डको साथ साइन इन गर्न सक्नुहुन्छ।
sl: Skrbnik je bil obveščen. Ko bo odobril vašo vlogo, se boste lahko prijavljali sami s svojim uporabniškim imenom in geslom.

source: Show sources
cy: Dangos ffynonellau
hy: Ցույց տալ աղբյուրները
ko: 출처 표시
ne: स्रोतहरू देखाउनुहोस्
sl: Prikaži vire

source: Show notes
cy: Dangos nodiadau
hy: Ցույց տալ նշումները
ko: 노트 표시
ne: नोटहरू देखाउनुहोस्
sl: Prikaži opombe

source: Show occupations
cy: Dangos galwedigaethau
hy: Ցույց տալ զբաղմունքները
ko: 직업 표시
ne: पेशा देखाउनुहोस्
sl: Prikaži poklice

source: Show residences
cy: Dangos preswylfeydd
hy: Ցույց տալ բնակավայրերը
ko: 거주지 표시
ne: बासस्थान देखाउनुहोस्
sl: Prikaži prebivališča

source: Show children of ancestors
cy: Dangos plant hynafiaid
hy: Ցույց տվեք նախնիների երեխաներին
ko: 조상의 자녀 표시
ne: पुर्खाका सन्तान देखाउनुहोस्
sl: Prikaži otroke prednikov

# paper size
source: Letter
cy: Llythyr
hy: Նամակ
ne: चिठ्ठी

# paper size
source: Tabloid
hy: Տաբլոիդ
ne: ट्याब्लोइड

source: Page size
cy: Maint tudalen
hy: Էջի չափը
ko: 종이 크기
ne: पृष्ठ आकार
sl: Velikost strani

# font name
source: Arial
hy: Արիալ
ne: एरियल

# font name
source: Helvetica
hy: Հելվետիկա
ne: Helvetica फन्ट

source: Font
cy: Ffont
hy: Տառատեսակ
ko: 글꼴
ne: फन्ट
sl: Pisava

source: Ancestors of
cy: Hynafiaid
hy: -ի նախնիները
ko: 의 조상 차트
ne: का पुर्खाहरू
sl: Predniki osebe

source: Page
cy: Tudalen
hy: Էջ
ko: 페이지
ne: पेज
sl: Stran

source: of
cy: o
hy: -ից
ko: 의
ne: को
sl: od

source: Generation
cy: Cenhedlaeth
hy: Սերունդ
ko: 세대
ne: पुस्ता
sl: Generacija

# MALE
source: was born
cy: wedi ei eni
hy: ծնվել է
ko: 태어난
ne: जन्मिएको
sl: se je rodil

# FEMALE
source: was born
cy: wedi ei geni
hy: ծնվել է
ko: 태어난
ne: जन्मिएको
sl: se je rodila

source: in
cy: yn
hy: մեջ
ko: 안에
ne: मा
sl: v kraju

source: but the details are unknown
cy: ond nid yw'r manylion yn hysbys
hy: սակայն մանրամասները հայտնի չեն
ko: 그러나 세부 사항은 알 수 없습니다
ne: तर विवरणहरू अज्ञात छन्
sl: toda podrobnosti niso znane

source: He was christened
cy: Cafodd ei fedyddio
hy: Նրան մկրտեցին
ko: 그의 세례식은
ne: उहाँको नामकरण गरिएको थियो
sl: Krščen je bil

source: She was christened
cy: Cafodd ei bedyddio
hy: Նրան մկրտեցին
ko: 그녀가 세레식 받은
ne: उनको नामकरण गरिएको थियो
sl: Krščena je bila

source: His occupation was
cy: Ei alwedigaeth oedd
hy: Նրա զբաղմունքն էր
ko: 그의 직업은
ne: उसको व्यबासय
sl: Po poklicu je bil

source: Her occupation was
cy: Ei galwedigaeth oedd
hy: Նրա զբաղմունքն էր
ko: 그녀의 직업은
ne: उनीको व्यबासय
sl: Po poklicu je bila

source: He resided at
cy: Roedd yn preswylio yn
hy: Նա բնակվում էր
ko: 그가 거주한
ne: उसको ठेगाना
sl: Stanoval je

source: She resided at
cy: Roedd hi'n preswylio yn
hy: Նա բնակվում էր
ko: 그녀가 거주한
ne: मा बस्दै आएकी थिइन्
sl: Stanovala je

source: He married
cy: Priododd
hy: Նա ամուսնացավ
ko: 그의 결혼은
ne: उनले विवाह
sl: Poročil se je

source: She married
cy: Priododd
hy: Նա ամուսնացավ
ko: 그녀의 결혼은
ne: उनको विवाह
sl: Poročila se je

source: He died
cy: Bu farw
hy: Նա մահացել է
ko: 그의 죽음은
ne: उसको मृत्यु
sl: Umrl je

source: She died
cy: Bu farw
hy: Նա մահացել է
ko: 그녀의 사망은
ne: उनको मृत्यु
sl: Umrla je

source: He was cremated
cy: Cafodd ei amlosgi
hy: Նրան դիակիզել են
ko: 그가 화장 된
ne: उनको दाहसंस्कार गरियो
sl: Upepeljen je bil

source: She was cremated
cy: Cafodd ei hamlosgi
hy: Նրան դիակիզել են
ko: 그녀가 화장된
ne: उनको दाहसंस्कार गरियो
sl: Upepeljena je bila

source: He was buried
cy: Cafodd ei gladdu
hy: Նրան թաղեցին
ko: 그가 매장 된
ne: उहाँलाई गाडियो
sl: Pokopan je bil

source: She was buried
cy: Cafodd ei chladdu
hy: Նրան թաղեցին
ko: 그녀가 매장된
ne: उनलाई दफनाइएको थियो
sl: Pokopana je bila

source: Child of
cy: Plentyn
hy: -ի երեխա
ko: 의 자녀
ne: को बच्चा
sl: Otrok osebe

source: Children of
cy: Plant
hy: -ի երեխաները
ko: 의 자녀들
ne: को छोराछोरी
sl: Otroci osebe

source: Birth date range start
cy: Ystod dyddiad geni yn cychwyn
hy: Ծննդյան ամսաթվի սկիզբը
ko: 생년월일 범위 시작
ne: जन्म मिति दायरा सुरु
sl: Začetek obsega datuma rojstva

source: Birth date range end
cy: Diwedd ystod dyddiad geni
hy: Ծննդյան ամսաթվի ավարտը
ko: 생년월일 범위 종료
ne: जन्म मिति दायरा समाप्त
sl: Konec obsega datuma rojstva

source: Death date range start
cy: Ystod dyddiad marwolaeth yn cychwyn
hy: Մահվան ամսաթվի սկիզբը
ko: 사망 날짜 범위 시작
ne: मृत्युको मिति दायरा सुरु
sl: Začetek obsega datuma smrti

source: Death date range end
cy: Diwedd ystod dyddiad marwolaeth
hy: Մահվան ժամկետի ավարտը
ko: 사망 날짜 범위 종료
ne: मृत्युको मिति दायरा समाप्त
sl: Konec obsega datuma smrti

source: sort by date of death
cy: trefnu yn ôl dyddiad marwolaeth
hy: տեսակավորել ըստ մահվան ամսաթվի
ko: 사망일 순으로 정렬
sl: razvrsti po datumu smrti

source: Birthplace contains
cy: Man geni yn cynnwys
hy: Ծննդավայրը պարունակում է
ko: 출생지 포함
ne: जन्मस्थानमा समावेश भएका
sl: Kraj rojstva vsebuje

source: Burial place contains
cy: Man claddu yn cynnwys
hy: Թաղման վայրը պարունակում է
ko: 매장 장소 포함
ne: दाहसंस्कार गर्ने ठाउँ समावेश
sl: Kraj pokopa vsebuje

source: Starting range of change dates
cy: Ystod cychwyn dyddiadau newid
hy: Փոփոխությունների ամսաթվերի մեկնարկային միջակայք
ko: 변경 날짜의 시작 범위
ne: परिवर्तन मितिहरूको प्रारम्भिक दायरा
sl: Začetek obsega datuma sprememb

source: Ending range of change dates
cy: Diwedd ystod ddyddiadau newid
hy: Փոփոխությունների ամսաթվերի ավարտի միջակայքը
ko: 변경 날짜의 종료 범위
ne: परिवर्तन मितिहरूको अन्त्य दायरा
sl: Konec obsega datuma sprememb

source: Show pending changes
cy: Dangos cynigion newydd
hy: Ցույց տալ առկախ փոփոխությունները
ko: 보류중인 변경사항 표시
ne: विचाराधीन परिवर्तनहरू देखाउनुहोस्
sl: Prikaži čakajoče spremembe

source: Orientation
cy: Cyfeiriadaeth
hy: Կողմնորոշում
ko: 성향
ne: अभिमुखीकरण
sl: Usmerjenost

source: Differences
cy: Gwahaniaethau
hy: Տարբերություններ
ko: 차이점
ne: भिन्नताहरू
sl: Razlike

source: Total pending changes:
cy: Cyfanswm y cynigion newydd:
hy: Ընդհանուր սպասվող փոփոխությունները.
ko: 모든 보류중인 변경 사항:
ne: कुल विचाराधीन परिवर्तनहरू:
sl: Skupno število čakajočih sprememb:

source: Total accepted changes:
cy: Cyfanswm y newidiadau a dderbyniwyd:
hy: Ընդունված փոփոխությունները.
ko: 허용되는 Total 변경 사항:
ne: कुल स्वीकृत परिवर्तनहरू:
sl: Skupno število sprejetih sprememb:

source: Death place contains
cy: Mae'r lle marwolaeth yn cynnwys
hy: Մահվան վայրը պարունակում է
ko: 사망 장소 포함
ne: मृत्यु स्थान समावेश छ
sl: Kraj smrti vsebuje

source: Descendants of
cy: Disgynyddion
hy: -ի հետնորդները
ko: 의 후손 차트
ne: को वंशज
sl: Potomci osebe

# MALE
source: died
cy: bu farw
hy: մահացել է
ko: 사망
ne: मरेको
sl: umrl

# FEMALE
source: died
cy: bu farw
hy: մահացել է
ko: 사망
ne: मरेकी
sl: umrla

# MALE
source: married
cy: priodwyd
hy: ամուսնացած
ko: 기혼
ne: बिवाहित
sl: poročen

source: daughter of
cy: merch
hy: -ի դուստրը
ko: 의 딸
ne: को छोरी
sl: hčerjo staršev

# FEMALE
source: married
cy: priodwyd
hy: ամուսնացած
ko: 기혼
ne: बिवाहित
sl: poročena

source: son of
cy: mab
hy: -ի որդին
ko: 아들의
sl: sin osebe

source: She was born
cy: Cafodd ei geni
hy: Նա ծնվել է
ko: 그녀가 태어난
ne: उनी जन्मेकी
sl: Rodila se je

source: She
cy: Hi
hy: Նա
ko: 그녀
ne: उनी
sl: Ona

source: He was born
cy: Cafodd ei eni
hy: Նա ծնվել է
ko: 그가 태어난
ne: उ जन्मेको
sl: Rodil se je

source: He
cy: Ef
hy: Նա
ko: 그가
ne: उ
sl: On

source: A report of facts which are supported by a given source.
cy: Adroddiad am ffeithiau sy'n cael eu cefnogi gan ffynonellau penodol.
hy: Փաստերի հաշվետվություն, որը հաստատվում է տվյալ աղբյուրով:
ko: 특정 출처에서 지원하는 정보에 대한 보고서.
ne: दिइएको स्रोतद्वारा समर्थित तथ्यहरूको रिपोर्ट।
sl: Poročilo o dejstvih, ki jih podpira določen vir.

source: Find a source
cy: Canfod ffynhonnell
hy: Գտեք աղբյուր
ko: 출처 찾기
ne: श्रोत खोज
sl: Najdi vir

source: Source type
cy: Math o ffynhonnell
hy: Աղբյուրի տեսակը
ko: 출처 유형
ne: स्रोत प्रकार
sl: Vrsta vira

source: Show photos
cy: Dangos lluniau
hy: Ցույց տալ լուսանկարներ
ko: 사진 표시
ne: फोटोहरू देखाउनुहोस्
sl: Prikaži fotografije

source: Print basic events when blank
cy: Argraffu digwyddiadau sylfaenol pan yn wag
hy: Տպել հիմնական իրադարձությունները, երբ դատարկ է
ne: खाली हुँदा आधारभूत घटनाहरू छाप्नुहोस्
sl: Natisni tudi prazne osnovne dogodke

source: Use colors
cy: Defnyddio lliwiau
hy: Օգտագործեք գույներ
ko: 색상 사용
ne: रंगहरू प्रयोग गर्नुहोस्
sl: Uporabi barve

source: Parents and siblings
cy: Rhieni a brodyr a chwiorydd
hy: Ծնողներ և քույրեր և քույրեր
ko: 부모와 형제자매
ne: आमाबाबु र दाजुभाइहरू
sl: Starši in bratje/sestre

source: Spouses and children
cy: Priod a phlant
hy: Ամուսիններ և երեխաներ
ko: 배우자와 자녀들
ne: जीवनसाथी र बच्चाहरु
sl: Zakonci in otroci

source: Direct line ancestors
cy: Hynafiaid llinell uniongyrchol
hy: Ուղիղ գծի նախնիներ
ko: 직계 조상
ne: प्रत्यक्ष रेखा पुर्खाहरू
sl: Neposredni predniki

source: Direct line ancestors and their families
cy: Hynafiaid llinell uniongyrchol a'u teuluoedd
hy: Ուղիղ գծի նախնիները և նրանց ընտանիքները
ko: 직계 조상과 그 가족
ne: प्रत्यक्ष रेखा पुर्खाहरू र तिनीहरूका परिवारहरू
sl: Neposredni predniki in njihove družine

source: Choose relatives
cy: Dewis perthnasau
hy: Ընտրեք հարազատներին
ko: 친척을 선택하십시오
ne: आफन्त छान्नुहोस्
sl: Izberi sorodnike

source: Brother
cy: Brawd
hy: Եղբայր
ko: 남자형제
ne: भाइ
sl: Brat

source: Sister
cy: Chwaer
hy: Քույր
ko: 자매
ne: बहिनी
sl: Sestra

source: Family with wife
cy: Teulu gyda'r wraig
hy: Ընտանիք կնոջ հետ
ko: 아내가 있는 가족
ne: श्रीमतीसहितको परिवार
sl: Družina z ženo

source: Family with husband
cy: Teulu gyda'r gŵr
hy: Ընտանիք ամուսնու հետ
ko: 남편이 있는 가족
ne: श्रीमानसँगको परिवार
sl: Družina z možem

source: Marriage place contains
cy: Mae man priodas yn cynnwys
hy: Ամուսնության վայրը պարունակում է
ko: 결혼 장소 포함
ne: विवाह स्थल समावेश छ
sl: Kraj poroke vsebuje

source: Marriage date range start
cy: Cychwyn ystod dyddiadau priodasau
hy: Ամուսնության ամսաթվերի սկիզբ
ko: 결혼 날짜 범위 시작
ne: विवाह मिति दायरा सुरु
sl: Začetek obsega datuma poroke

source: Marriage date range end
cy: Diwedd ystod dyddiadau priodasau
hy: Ամուսնության ամսաթվերի ավարտը
ko: 결혼 날짜 범위 종료
ne: विवाह मिति दायरा समाप्त
sl: Konec obsega datuma poroke

source: Sources to the events
cy: Ffynonellau i'r digwyddiadau
hy: Իրադարձությունների աղբյուրները
ko: 이벤트 출처
ne: घटनाहरूको स्रोत
sl: Viri dogodkov

source: Pedigree chart
cy: Siart tras
hy: Տոհմային աղյուսակ
ko: 가계 차트
ne: वंशावली चार्ट
sl: Diagram rodovnika

source: %1$s %2$s has a %3$s link to %4$s.
cy: Mae gan %1$s %2$s ddolen %3$s i %4$s.
sl: %1$s %2$s ima %3$s povezavo na %4$s.

source: %1$s does not exist
cy: Nid yw %1$s yn bodoli
sl: %1$s ne obstaja

source: %1$s does not exist.
cy: Nid yw %1$s yn bodoli.
sl: %1$s ne obstaja.

source: %1$s’s %2$s
cy: %2$s %1$s
ne: %1$s को %2$s
sl: %2$s osebe %1$s

source: %H:%i:%s
sl: %G:%i:%s

source: %s&nbsp;CE
sl: %s&nbsp;po K.

source: <div class="largeError">Notice:</div><div class="error">By completing and submitting this form, you agree:<ul><li>to protect the privacy of living individuals listed on our site;</li><li>and in the text box below, to explain to whom you are related, or to provide us with information on someone who should be listed on our website.</li></ul></div>
cy: <div class="largeError">Rhybudd:</div><div class="error"> Trwy lenwi a chyflwyno'r ffurflen hon, rydych yn cytuno:<ul><li> i ddiogelu preifatrwydd unigolion byw sy'n cael eu rhestri ar ein gwefan;</li><li> ac yn y blwch testun isod, i egluro i bwy rydych chi'n perthyn, neu i ddarparu gwybodaeth i ni am rywun y dylai fod ar ein gwefan.</li></ul></div>
sl: <div class="largeError">Obvestilo:</div><div class="error">Z izpolnitvijo in oddajo tega obrazca se strinjate:<ul><li>z varovanjem zasebnosti živih oseb, navedenih na spletišču;</li><li>in da v spodnjem besedilnem polju pojasnite, s kom ste v sorodu, ali pa posredujete podatke o nekom, ki bi moral biti naveden na spletišču.</li></ul></div>

source: A URL
cy: URL
ne: एक URL
sl: Naslov URL

source: Action
cy: Symudiad
ko: 동작
sl: Dejanje

# GENITIVE
source: Adar I
ne: अडार I
sl: adar

# INSTRUMENTAL
source: Adar I
ne: अडार I
sl: adar

# LOCATIVE
source: Adar I
ne: अडार I
sl: adar

# GENITIVE
source: Adar II
ne: अडार II
sl: beadar

# INSTRUMENTAL
source: Adar II
ne: अडार II
sl: beadar

# LOCATIVE
source: Adar II
ne: अडार II
sl: beadar

source: Add a restriction
cy: Ychwanegwch gyfyngiad
sl: Dodaj omejitev

source: Add a shared note
cy: Ychwanegu nodyn i'w rannu
sl: Dodaj skupno opombo

source: Add an event
cy: Ychwanegu digwyddiad
sl: Dodaj dogodek

source: Add married names
cy: Ychwanegu enwau priod
sl: Dodaj poročna imena
