Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Show “leaves” couples or individuals. These are individuals who are alive but have no children recorded in the database.
cy: Dangos cyplau neu unigolion “dail”. Mae'r rhain yn unigolion sy'n fyw ond heb blant wedi'u cofnodi yn y gronfa ddata.
hy: Ցույց տվեք «տևում» զույգերին կամ անհատներին: Սրանք այն անձինք են, ովքեր ողջ են, բայց տվյալների բազայում գրանցված երեխաներ չունեն:
ko: “떠난”커플 또는 인물을 표시합니다. 이들은 살아 있지만 데이터베이스에 기록 된 자녀들이 없는 인물입니다.
ne: "पातहरू" जोडी वा व्यक्तिहरू देखाउनुहोस्। यी व्यक्तिहरू हुन् जो जीवित छन् तर डाटाबेसमा रेकर्ड गरिएका बच्चाहरू छैनन्।
sl: Prikaži “listne” pare ali posameznike. To so živi posamezniki, ki v podatkovni bazi nimajo zapisanih otrok.

source: Leaves
cy: Dail
hy: Տերեւներ
ko: 떠나다
ne: पातहरू
sl: Listi

source: Show couples with an unknown marriage date.
cy: Dangos cyplau â dyddiad priodas anhysbys.
hy: Ցույց տալ անհայտ ամուսնության ամսաթիվ ունեցող զույգերին:
ko: 결혼 날짜를 알 수 없는 커플을 표시합니다.
ne: अज्ञात विवाह मितिसँग जोडीहरू देखाउनुहोस्।
sl: Prikaži neporočene pare ali pare z neznanim datumom poroke.

source: Show couples who married more than 100 years ago.
cy: Dangos cyplau a briododd fwy na 100 mlynedd yn ôl.
hy: Ցույց տալ զույգերին, ովքեր ամուսնացել են ավելի քան 100 տարի առաջ:
ko: 100년 전에 결혼 한 커플을 표시합니다.
ne: 100 वर्ष भन्दा पहिले विवाह गर्ने जोडीहरू देखाउनुहोस्।
sl: Prikaži pare, ki so se poročili pred več kot sto leti.

source: Show couples who married within the last 100 years.
cy: Dangos cyplau a briododd o fewn y 100 mlynedd diwethaf.
hy: Ցույց տալ զույգերին, ովքեր ամուսնացել են վերջին 100 տարվա ընթացքում:
ko: 지난 100년동안 결혼 한 커플을 표시합니다.
ne: पछिल्लो 100 वर्ष भित्र विवाह गर्ने जोडीहरू देखाउनुहोस्।
sl: Prikaži pare, ki so se poročili v zadnjih sto letih.

source: Show divorced couples.
cy: Dangos cyplau sydd wedi ysgaru.
hy: Ցույց տալ ամուսնալուծված զույգերին:
ko: 이혼 한 커플 표시.
ne: सम्बन्धविच्छेद भएका जोडीहरू देखाउनुहोस्।
sl: Prikaži ločene pare.

source: Show couples where either partner married more than once.
cy: Dangos cyplau lle priododd y naill bartner fwy nag unwaith.
hy: Ցույց տալ զույգերին, որտեղ զուգընկերներից մեկն ամուսնացել է մեկից ավելի անգամ:
ko: 두 파트너 중 한 번 이상 결혼 한 커플을 표시합니다.
ne: जोडीहरू देखाउनुहोस् जहाँ एक जोडीले एक पटक भन्दा बढी विवाह गरेको छ।
sl: Prikaži pare, pri katerih je bil katerikoli partner poročen več kot enkrat.

source: Multiple marriages
cy: Priodasau lluosog
hy: Բազմաթիվ ամուսնություններ
ko: 다중 결혼
ne: बहुविवाह
sl: Več porok

source: Show parents
cy: Dangos rhieni
hy: Ցույց տալ ծնողներին
ko: 부모 표시
ne: आमाबुवा देखाउनुहोस्
sl: Prikaži starše

source: Given name
cy: Enw
hy: Տրված անուն
ko: 이름
ne: दिएको नाम
sl: Osebno ime

source: Mother: %s
cy: Mam: %s
hy: Մայրը՝ %s
ko: 어머니: %s
ne: आमा: %s
sl: Mati: %s

source: Father: %s
cy: Tad: %s
hy: Հայրը՝ %s
ko: 아버지: %s
ne: बुवा: %s
sl: Oče: %s

source: Show only males.
cy: Dangos gwrywod yn unig.
hy: Ցույց տալ միայն արական սեռի ներկայացուցիչներին:
ko: 남성만 표시합니다.
ne: पुरुषहरू मात्रै देखाउनुहोस् ।
sl: Prikaži samo moške.

source: Show only females.
cy: Dangos benywod yn unig.
hy: Ցույց տալ միայն իգական սեռի ներկայացուցիչներին:
ko: 여성만 표시합니다.
ne: महिलाहरू मात्रै देखाउनुहोस् ।
sl: Prikaži samo ženske.

source: Show only individuals for whom the sex is not known.
hy: Ցույց տվեք միայն այն անհատներին, որոնց սեռը հայտնի չէ:
ne: लिङ्ग थाहा नभएका व्यक्तिहरूलाई मात्र देखाउनुहोस्।

source: Show individuals who are alive or couples where both partners are alive.
cy: Dangos unigolion sy'n fyw neu gyplau lle mae'r ddau bartner yn fyw.
hy: Ցույց տվեք կենդանի մարդկանց կամ զույգերին, որտեղ երկու գործընկերներն էլ ողջ են:
ko: 살아 있는 인물 또는 두 파트너가 살아 있는 커플을 표시합니다.
ne: जीवित व्यक्तिहरू वा जोडीहरू जहाँ दुवै साझेदार जीवित छन् देखाउनुहोस्।
sl: Prikaži žive osebe ali pare, pri katerih sta živa oba partnerja.

source: Alive
cy: Yn fyw
hy: Կենդանի
ko: 살아있는
ne: जीवित
sl: Živi

source: Show individuals who died more than 100 years ago.
cy: Dangos unigolion a fu farw fwy na 100 mlynedd yn ôl.
hy: Ցույց տալ անհատներին, ովքեր մահացել են ավելի քան 100 տարի առաջ:
ko: 100년 전에 사망한 인물을 표시합니다.
ne: 100 वर्ष भन्दा बढी पहिले मृत्यु भएका व्यक्तिहरू देखाउनुहोस्।
sl: Prikaži osebe, ki so umrle pred več kot sto leti.

source: Show individuals who died within the last 100 years.
cy: Dangos unigolion a fu farw o fewn y 100 mlynedd diwethaf.
hy: Ցույց տալ անհատներին, ովքեր մահացել են վերջին 100 տարվա ընթացքում:
ko: 지난 100년동안 사망한 인물을 표시합니다.
ne: पछिल्लो 100 वर्ष भित्र मृत्यु भएका व्यक्तिहरू देखाउनुहोस्।
sl: Prikaži osebe, ki so umrle v zadnjih sto letih.

source: Show individuals born more than 100 years ago.
cy: Dangos unigolion a anwyd fwy na 100 mlynedd yn ôl.
hy: Ցույց տվեք ավելի քան 100 տարի առաջ ծնված անհատներին:
ko: 100년 전에 태어난 인물을 표시합니다.
ne: 100 वर्ष भन्दा पहिले जन्मेका व्यक्तिहरू देखाउनुहोस्।
sl: Prikaži osebe, ki so se rodile pred več kot sto leti.

source: Show individuals born within the last 100 years.
cy: Dangos unigolion a anwyd o fewn y 100 mlynedd diwethaf.
hy: Ցույց տալ վերջին 100 տարվա ընթացքում ծնված անհատներին:
ko: 지난 100년동안 태어난 인물을 표시합니다.
ne: पछिल्लो 100 वर्ष भित्र जन्मेका व्यक्तिहरू देखाउनुहोस्।
sl: Prikaži osebe, ki so se rodile v zadnjih sto letih.

source: Sosa
hy: Սոսա
ne: सोसा

source: Repository name
cy: Enw'r storfan
hy: Պահեստի անվանումը
ko: 저장소 이름
ne: भण्डारको नाम
sl: Ime skladišča

source: Submitter name
cy: Enw'r cyflwynydd
hy: Ներկայացնողի անունը
ko: 제출자 이름
ne: पेश गर्ने नाम
sl: Ime pošiljatelja

source: Surnames
cy: Cyfenwau
hy: Ազգանուններ
ko: 가문이름
ne: थरहरू
sl: Priimki

source: Welcome to this genealogy website
cy: Croeso i'r wefan hel achau hon
hy: Բարի գալուստ այս ծագումնաբանության կայք
ko: 이 계보 웹 사이트에 오신 것을 환영합니다
ne: यस वंशावली वेबसाइटमा स्वागत छ
sl: Dobrodošli na rodoslovnem spletišču

source: sign in
cy: mewngofnodi
hy: մուտք գործել
ko: 로그인
ne: लगईन
sl: Prijava

source: Forgot password?
cy: Wedi anghofio'ch cyfrinair?
hy: Մոռացել եք գաղտնաբառը?
ko: 비밀번호를 잊으셨나요?
ne: पासवर्ड भुल्नु भयो?
sl: Pozabljeno geslo?

source: The file “%s” does not exist.
cy: Nid yw'r ffeil “%s” yn bodoli.
hy: «%s» ֆայլը գոյություն չունի:
ko: “%s”파일이 없습니다.
ne: फाइल "%s" अवस्थित छैन।
sl: Datoteka “%s” ne obstaja.

source: Download file
cy: Llwytho ffeil i lawr
hy: Ներբեռնեք ֆայլը
ko: 파일 다운로드
ne: फाइल डाउनलोड गर्नुहोस्
sl: Prenesi datoteko

source: Re-order media files
hy: Կրկին պատվիրեք մեդիա ֆայլերը
ne: मिडिया फाइलहरू पुन: क्रमबद्ध गर्नुहोस्

source: Link this media object to an individual
cy: Cysylltu'r gwrthrych cyfryngau hwn ag unigolyn
hy: Կապել այս մեդիա օբյեկտը անհատի հետ
ko: 이 미디어 개체를 인물에 연결
ne: यो मिडिया वस्तुलाई एक व्यक्तिसँग लिङ्क गर्नुहोस्
sl: Poveži ta medijski predmet z osebo

source: Link this media object to a family
cy: Cysylltu'r gwrthrych cyfryngau hwn â theulu
hy: Այս մեդիա օբյեկտը կապեք ընտանիքի հետ
ko: 이 미디어 개체를 가족에 연결
ne: यो मिडिया वस्तुलाई परिवारसँग लिङ्क गर्नुहोस्
sl: Poveži ta medijski predmet z družino

source: Link this media object to a source
cy: Cysylltu'r gwrthrych cyfryngau hwn â ffynhonnell
hy: Կապել այս մեդիա օբյեկտը աղբյուրի հետ
ko: 이 미디어 개체를 출처에 연결
ne: यो मिडिया वस्तुलाई स्रोतमा लिङ्क गर्नुहोस्
sl: Poveži ta medijski predmet z virom

source: This media object has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r gwrthrych cyfryngau hwn wedi'i ddileu. Dylech adolygu'r dileu ac yna ei %1$s neu ei %2$s.
hy: Այս մեդիա օբյեկտը ջնջվել է: Դուք պետք է վերանայեք ջնջումը, այնուհետև %1$s կամ %2$s այն:
ko: 이 미디어 개체가 삭제되었습니다. 삭제를 검토 한 다음 %1$s 또는 %2$s 해야합니다.
ne: यो मिडिया वस्तु मेटाइएको छ। तपाईंले मेटाउने समीक्षा र त्यसपछि %1$s वा %2$s यसलाई समीक्षा गर्नुपर्छ।
sl: Ta medijski predmet je izbrisan. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This media object has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r gwrthrych cyfryngau hwn wedi'i ddileu. Bydd angen i'r cymedrolwr adolygu'r dileu.
hy: Այս մեդիա օբյեկտը ջնջվել է: Ջնջումը պետք է վերանայվի մոդերատորի կողմից:
ko: 이 미디어 개체가 삭제되었습니다. 중재자가 삭제를 검토해야합니다.
ne: यो मिडिया वस्तु मेटाइएको छ। मेटाउने कार्यलाई मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta medijski objekt je izbrisan. Izbris mora pregledati moderator.

source: This media object has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r gwrthrych cyfryngau hwn wedi'i olygu. Dylech adolygu'r newidiadau ac yna eu %1$s neu eu %2$s nhw.
hy: Այս մեդիա օբյեկտը խմբագրվել է: Դուք պետք է վերանայեք փոփոխությունները, այնուհետև %1$s կամ %2$s դրանք:
ko: 이 미디어 개체가 편집되었습니다. 변경 사항을 검토 한 다음 %1$s 또는 %2$s 변경해야합니다.
ne: यो मिडिया वस्तु सम्पादन गरिएको छ। तपाईंले परिवर्तनहरूको समीक्षा गर्नुपर्छ र त्यसपछि %1$s वा %2$s तिनीहरूलाई।
sl: Ta medijski objekt je urejen. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This media object has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r gwrthrych cyfryngau hwn wedi'i olygu. Mae angen i'r cymedrolwr adolygu'r newidiadau.
hy: Այս մեդիա օբյեկտը խմբագրվել է: Փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից:
ko: 이 미디어 개체가 편집되었습니다. 중재자가 변경 사항을 검토해야합니다.
ne: यो मिडिया वस्तु सम्पादन गरिएको छ। परिवर्तनहरू एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ta medijski predmet je urejen. Spremembe mora pregledati moderator.

source: Folder
cy: Ffolder
hy: Թղթապանակ
ko: 폴더
ne: फोल्डर
sl: Mapa

source: Same as uploaded file
cy: Yr un peth â'r ffeil wedi'i llwytho i fyny
hy: Նույնը, ինչ վերբեռնված ֆայլը
ko: 업로드 된 파일과 동일합니다
ne: अपलोड गरिएको फाइल जस्तै
sl: Enako kot ime naložene datoteke

source: If you have a large number of media files, you can organize them into folders and subfolders.
cy: Os oes gennych nifer fawr o ffeiliau cyfryngau, gallwch eu trefnu yn ffolderi ac is-ffolderi.
hy: Եթե դուք ունեք մեծ թվով մեդիա ֆայլեր, կարող եք դրանք կազմակերպել թղթապանակների և ենթաթղթապանակների մեջ:
ko: 미디어 파일이 많은 경우 폴더와 하위 폴더로 구성할 수 있습니다.
ne: यदि तपाइँसँग मिडिया फाइलहरूको ठूलो संख्या छ भने, तपाइँ तिनीहरूलाई फोल्डरहरू र सबफोल्डरहरूमा व्यवस्थित गर्न सक्नुहुन्छ।
sl: Če imate veliko medijskih datotek, jih lahko organizirate v mape in podmape.

source: Create a unique filename
cy: Crëwch enw ffeil unigryw
hy: Ստեղծեք եզակի ֆայլի անուն
ko: 고유 파일 이름 만들기
ne: नयाँ फाइलनेम बनाउनुहोस्
sl: Ustvari edinstveno ime datoteke

source: Keep open
cy: Cadw ar agor
hy: Բաց պահեք
ko: 열린 상태로 유지
ne: खुला राख्नुहोस्
sl: Obdrži odprto

source: Census date and place
hy: Մարդահամարի ամսաթիվը և վայրը
ko: 인구조사 날짜와 장소
ne: जनगणना मिति र स्थान

source: Generations
cy: Cenedlaethau
hy: Սերունդներ
ko: 세대
ne: पीढी
sl: Generacije

source: Layout
cy: Gosodiad
hy: Դասավորություն
ko: 레이아웃
ne: ढाँचा
sl: Postavitev

source: Sosa-Stradonitz number
cy: Rhif Sosa-Stradonitz
hy: Սոսա-Ստրադոնից համարը
ne: Sosa-Stradonitz नम्बर
sl: Sosa-Stradonitz številka

source: API key
hy: API բանալի
ne: एपीआई की

source: To use this service, you need an API key.
hy: Այս ծառայությունից օգտվելու համար ձեզ հարկավոր է API բանալի:
ko: 이 서비스를 사용하려면 API 키가 필요합니다.
ne: यो सेवा प्रयोग गर्न, तपाईंलाई API कुञ्जी चाहिन्छ।

source: Site verification code
cy: Cod dilysu gwefan
hy: Կայքի հաստատման կոդը
ko: 사이트 인증 코드
ne: साइट प्रमाणिकरण कोड
sl: Koda za preverjanje spletišča

source: Site verification codes do not work when webtrees is installed in a subfolder.
cy: Nid yw codau gwirio gwefan yn gweithio pan mae webtrees wedi'i osod is-ffolder.
hy: Կայքի ստուգման կոդերը չեն աշխատում, երբ վեբ ծառերը տեղադրվում են ենթաթղթապանակում:
ko: 웹 트리가 하위 폴더에 설치되어 있으면 사이트 확인 코드가 작동하지 않습니다.
ne: वेबट्रीहरू सबफोल्डरमा स्थापना हुँदा साइट प्रमाणीकरण कोडहरूले काम गर्दैन।
sl: Kode za preverjanje spletišča ne delujejo, če je webtrees nameščen v podmapi.

source: Create a shared note using the census assistant
cy: Creu nodyn a rennir gan ddefnyddio cynorthwyydd y cyfrifiad
hy: Ստեղծեք ընդհանուր նշում՝ օգտագործելով մարդահամարի օգնականը
ko: 인구 조사 도우미를 사용하여 공유 노트 만들기
ne: जनगणना सहायक प्रयोग गरेर साझा नोट सिर्जना गर्नुहोस्
sl: Ustvari skupno opombo s pomočjo pomočnika za popis prebivalstva

source: Citation
cy: Dyfyniad
hy: Մեջբերում
ko: 인용
ne: उद्धरण
sl: Navedek

source: Census transcript
cy: Trawsgrifiad y cyfrifiad
hy: Մարդահամարի արձանագրություն
ko: 인구조사 기록
ne: जनगणना ट्रान्सक्रिप्ट
sl: Prepis popisa

source: Household
cy: Aelwyd
hy: Տնային տնտեսություն
ko: 가정
ne: घरेलु
sl: Gospodinjstvo

source: Chart type
cy: Math o siart
hy: Գծապատկերի տեսակը
ko: 차트 유형
ne: चार्टको प्रकार
sl: Vrsta diagrama

source: The clippings cart allows you to take extracts from this family tree and download them as a GEDCOM file.
cy: Mae'r cart toriadau yn caniatáu i chi gymryd darnau o'r cart achau hwn a'u llwytho fel ffeil GEDCOM.
hy: Հատվածների զամբյուղը թույլ է տալիս քաղվածքներ վերցնել այս տոհմածառից և ներբեռնել դրանք որպես GEDCOM ֆայլ:
ko: 클리핑 카트를 사용하면 이 가계도에서 추출한 내용을 가져 와서 GEDCOM 파일로 다운로드 할 수 있습니다.
ne: क्लिपिङ्स कार्टले तपाईंलाई यस पारिवारिक रूखबाट अर्कहरू लिन र GEDCOM फाइलको रूपमा डाउनलोड गर्न अनुमति दिन्छ।
sl: Košarica za izrezke omogoča, da vzamete dele tega družinskega drevesa in jih prenesete kot datoteko GEDCOM.

source: Your clippings cart is empty.
cy: Mae'ch cart toriadau yn wag.
hy: Ձեր հատվածների զամբյուղը դատարկ է:
ko: 클리핑 카트가 비어 있습니다.
ne: तपाईंको क्लिपिङ्स कार्ट खाली छ।
sl: Košarica za izrezke je prazna.

source: Add content to the end of the <code>&lt;head&gt;</code> element.
cy: Ychwanegu cynnwys at ddiwedd yr elfen <code>&lt;head&gt;</code>.
hy: Բովանդակություն ավելացրեք <code>&lt;head&gt;</code> տարրի վերջում:
ko: 요소의 끝에 <code>&lt;head&gt;</code> 콘텐츠를 추가합니다.
ne: <code>&lt;head&gt;</code> तत्वको अन्त्यमा सामग्री थप्नुहोस्।
sl: Dodaj vsebino na konec elementa <code>&lt;head&gt;</code>.

source: Include the <code>&lt;style&gt;&lt;/style&gt;</code> tags.
cy: Cynhwyswch y tagiau <code>&lt;style&gt;&lt;/style&gt;</code>.
hy: Ներառեք <code>&lt;style&gt;&lt;/style&gt;</code> թեգերը:
ko: <code>&lt;style&gt;&lt;/style&gt;</code> 태그를 포함합니다.
ne: <code>&lt;style&gt;&lt;/style&gt;</code> ट्यागहरू समावेश गर्नुहोस्।
sl: Vključite značke <code>&lt;style&gt;&lt;/style&gt;</code>.

source: Add content to the end of the <code>&lt;body&gt;</code> element.
cy: Ychwanegwch gynnwys at ddiwedd yr elfen <code>&lt;body&gt;</code>.
hy: Ավելացրեք բովանդակություն <code>&lt;body&gt;</code> տարրի վերջում:
ko: 요소의 끝에 <code>&lt;body&gt;</code> 컨텐츠를 추가합니다.
ne: <code>&lt;body&gt;</code> तत्वको अन्त्यमा सामग्री थप्नुहोस्।
sl: Dodaj vsebino na konec elementa <code>&lt;body&gt;</code>.

source: Include the <code>&lt;script&gt;&lt;/script&gt;</code> tags.
cy: Cynhwyswch y tagiau <code>&lt;script&gt;&lt;/script&gt;</code>.
hy: Ներառեք <code>&lt;script&gt;&lt;/script&gt;</code> թեգերը:
ko: <code>&lt;script&gt;&lt;/script&gt;</code> 태그를 포함합니다.
ne: <code>&lt;script&gt;&lt;/script&gt;</code> ट्यागहरू समावेश गर्नुहोस्।
sl: Vključite značke <code>&lt;script&gt;&lt;/script&gt;</code>.

source: d’Aboville number
cy: rhif d'Aboville
hy: համարը դ’Աբովիլից հետո
ko: d 'Aboville 번호
ne: d'Aboville नम्बर
sl: d’Aboville-ovo število

source: Family of %s
cy: Teulu %s
hy: %s-ի ընտանիք
ko: %s의 가족
ne: %s को परिवार
sl: Družina osebe %s

source: Descendant generations
cy: Cenedlaethau o ddisgynyddion
hy: Հետնորդ սերունդներ
ko: 후손 세대
ne: वंशज पुस्ता
sl: Generacije potomcev

source: Show spouses
cy: Dangos priod
hy: Ցույց տալ ամուսիններին
ko: 배우자 표시
ne: पति/पत्नी देखाउनुहोस्
sl: Prikaži zakonce

source: Zoom
cy: Chwyddo
hy: Մեծացնել
ne: ठुलो बनाउनुहोस्
sl: Povečava

source: FAQs are lists of questions and answers, which allow you to explain the site’s rules, policies, and procedures to your visitors. Questions are typically concerned with privacy, copyright, user-accounts, unsuitable content, requirement for source-citations, etc.
cy: Mae Cwestiynau Cyffredin yn restrau o gwestiynau ac atebion, sy'n eich galluogi i egluro rheolau, polisïau a gweithdrefnau'r wefan i'ch ymwelwyr. Mae cwestiynau fel arfer yn ymwneud â phreifatrwydd, hawlfraint, cyfrifon defnyddwyr, cynnwys anaddas, gofynion ddyfyniadau ffynhonnell, ac ati.
hy: ՀՏՀ-ները հարցերի և պատասխանների ցուցակներ են, որոնք թույլ են տալիս ձեր այցելուներին բացատրել կայքի կանոնները, քաղաքականությունը և ընթացակարգերը: Հարցերը սովորաբար վերաբերում են գաղտնիությանը, հեղինակային իրավունքին, օգտատերերի հաշիվներին, ոչ պիտանի բովանդակությանը, աղբյուրի մեջբերումների պահանջներին և այլն:
ko: FAQ는 사이트의 규칙, 정책 및 절차를 방문자에게 설명할 수 있는 질문과 답변 목록입니다. 질문은 일반적으로 개인 정보 보호, 저작권, 사용자 계정, 부적절한 콘텐츠, 출처 인용 요구 사항 등과 관련됩니다.
ne: FAQ हरू प्रश्न र उत्तरहरूको सूची हुन्, जसले तपाईंलाई तपाईंको आगन्तुकहरूलाई साइटका नियमहरू, नीतिहरू र प्रक्रियाहरू व्याख्या गर्न अनुमति दिन्छ। प्रश्नहरू सामान्यतया गोपनीयता, प्रतिलिपि अधिकार, प्रयोगकर्ता-खाताहरू, अनुपयुक्त सामग्री, स्रोत-उद्धरणहरूको लागि आवश्यकता, आदिसँग सम्बन्धित छन्।
sl: Pogosta zastavljena vprašanja so seznami vprašanj in odgovorov, ki vam omogočajo, da obiskovalcem razložite pravila, politike in postopke spletišča. Vprašanja se običajno nanašajo na zasebnost, avtorske pravice, uporabniške račune, neprimerno vsebino, zahtevo po navajanju virov itd.

source: You may use HTML to format the answer and to add links to other websites.
cy: Gallwch ddefnyddio HTML i fformatio'r ateb ac i ychwanegu dolenni i wefannau eraill.
hy: Պատասխանը ձևաչափելու և այլ կայքերին հղումներ ավելացնելու համար կարող եք օգտագործել HTML:
ko: HTML을 사용하여 답변의 형식을 지정하고 다른 웹 사이트에 대한 링크를 추가 할 수 있습니다.
ne: तपाईंले जवाफ ढाँचा गर्न र अन्य वेबसाइटहरूमा लिङ्कहरू थप्न HTML प्रयोग गर्न सक्नुहुन्छ।
sl: Za oblikovanje odgovora in dodajanje povezav do drugih spletišč lahko uporabite HTML.

source: Sort order
cy: Trefnu yn ôl
hy: Տեսակավորելու կարգը
ko: 정렬 순서
ne: आदेश क्रमबद्ध गर्नुहोस्
sl: Vrstni red

source: Question
cy: Cwestiwn
hy: Հարց
ko: 질문
ne: प्रश्न
sl: Vprašanje

source: Answer
cy: Ateb
hy: Պատասխանել
ko: 답변
ne: जवाफ
sl: Odgovor

source: Show this block for which languages
cy: Dangos y bloc hwn ar gyfer pa iaith
hy: Ցույց տալ այս բլոկը, թե որ լեզուների համար
ko: 언어에 대한 이 블록 표시
ne: कुन भाषाहरूको लागि यो ब्लक देखाउनुहोस्
sl: Prikaži ta blok za izbrane jezike

source: An FAQ can be displayed on just one of the family trees, or on all the family trees.
cy: Mae modd dangos Cwestiynau Cyffredin ar ddim ond un cart achau, neu ar yr holl gartiau achau.
hy: ՀՏՀ-ն կարող է ցուցադրվել տոհմածառերից միայն մեկի կամ բոլոր տոհմածառերի վրա:
ko: FAQ는 가계도 중 하나에만 표시되거나 모든 가계도에 표시될 수 있습니다.
ne: एउटा FAQ केवल एउटा पारिवारिक रूखहरूमा वा सबै पारिवारिक रूखहरूमा प्रदर्शन गर्न सकिन्छ।
sl: Pogosto zastavljena vprašanja so lahko prikazana pri enem družinskem drevesu, ali pri vseh družinskih drevesih.

source: back to top
cy: yn ôl i'r brig
hy: վերադառնալ դեպի վերև
ko: 맨 위로
ne: माथि जानुहोस्
sl: Nazaj na vrh

source: Are you sure you want to remove this item from your list of favorites?
cy: Ydych chi'n siŵr eich bod chi am dynnu'r eitem hon o'ch rhestr o ffefrynnau?
hy: Իսկապե՞ս ուզում եք հեռացնել այս տարրը ձեր ընտրյալների ցանկից?
ko: 즐겨 찾기 목록에서 이 항목을 제거 하시겠습니까?
ne: के तपाइँ तपाइँको मनपर्ने सूचीबाट यो वस्तु हटाउन निश्चित हुनुहुन्छ?
sl: Ste prepričani, da želite ta element odstraniti iz seznama priljubljenih?

source: Add a favorite
cy: Ychwanegu ffefryn
hy: Ավելացնել ֆավորիտ
ko: 즐겨찾기 추가
ne: मनपर्ने व्यक्ति थप्नुहोस्
sl: Dodaj priljubljeno

source: Enter an optional note about this favorite
cy: Rhowch nodyn dewisol am y ffefryn hwn
hy: Մուտքագրեք կամընտիր նշում այս սիրելիի մասին
ko: 이 즐겨찾기에 대한 선택적 노트를 입력하세요
ne: यो मनपर्ने बारेमा एक वैकल्पिक टिप्पणी प्रविष्ट गर्नुहोस्
sl: Dodaj neobvezno opombo o priljubljeni osebi

source: Surname option
cy: Dewis cyfenw
hy: Ազգանուն տարբերակ
ko: 가문이름 옵션
ne: थरको विकल्प
sl: Možnost priimka

source: Convert to
cy: Trosi i
hy: Փոխարկել
ko: 로 변환하다
ne: मा रूपान्तरण गर्नुहोस्
sl: Spremeni v

source: Replace
cy: Amnewid
hy: Փոխարինել
ko: 변경
ne: प्रतिस्थापन गर्नुहोस्
sl: Zamenjaj

source: Search text/pattern
cy: Chwilio testun/patrwm
hy: Որոնել տեքստ/օրինաչափություն
ko: 검색 텍스트/패턴
ne: पाठ/ढाँचा खोज्नुहोस्
sl: Iskanje besedila/vzorca

source: Replacement text
cy: Testun newydd
hy: Փոխարինող տեքստ
ko: 변경 된 텍스트
ne: प्रतिस्थापन टेक्स्ट
sl: Besedilo zamenjave

source: Search method
cy: Dull chwilio
hy: Որոնման մեթոդ
ko: 검색방법
ne: खोज्ने प्रणाली
sl: Metoda iskanja

source: Regular expressions are an advanced pattern matching technique.
cy: Mae ymadroddion rheolaidd yn dechneg paru patrymau uwch.
hy: Կանոնավոր արտահայտությունները օրինաչափությունների համապատասխանեցման առաջադեմ տեխնիկա են:
ko: 정규식은 고급 패턴 일치 기술입니다.
ne: नियमित अभिव्यक्ति एक उन्नत ढाँचा मिलान प्रविधि हो।
sl: Regularni izrazi so napredna tehnika ujemanja vzorcev.

source: Match both upper and lower case letters.
cy: Cydweddu lythrennau mawr a llythrennau bach.
hy: Համապատասխանեցրեք և՛ մեծ, և՛ փոքրատառ տառերը:
ko: 대문자와 소문자를 모두 일치시킵니다.
ne: दुबै माथिल्लो र सानो अक्षरहरू मिलाउनुहोस्।
sl: Ujemanje velikih in malih črk.

source: Records
cy: Cofnodion
hy: Գրառումներ
ko: 레코드
ne: रेकर्डहरू
sl: Zapisi

source: Content
cy: Cynnwys
hy: Բովանդակություն
ko: 컨텐츠
ne: सामग्री
sl: Vsebina

source: No news articles have been submitted.
cy: Heb gyflwyno unrhyw erthyglau newyddion.
hy: Լրատվական հոդվածներ չեն ներկայացվել։
ko: 제출된 뉴스 기사가 없습니다.
ne: कुनै लेख पेश गरिएको छैन।
sl: Ni novih člankov.

source: Add a news article
cy: Ychwanegu erthygl newyddion
hy: Ավելացնել նորությունների հոդված
ko: 뉴스 기사 추가
ne: लेख थप्नुहोस्
sl: Dodaj članek

source: Show date of last update
cy: Dangos dyddiad y diweddariad diwethaf
hy: Ցույց տալ վերջին թարմացման ամսաթիվը
ko: 마지막 업데이트 날짜 표시
ne: अन्तिम अपडेट भएको समय देखाउनुहोस्
sl: Prikaži datum zadnje posodobitve

source: Total surnames
cy: Cyfanswm y cyfenwau
hy: Ընդհանուր ազգանուններ
ko: 전체 가문이름
ne: सम्पूर्ण थरहरु
sl: Skupno število priimkov

source: Total events
cy: Cyfanswm y digwyddiadau
hy: Ընդհանուր իրադարձություններ
ko: 전체 이벤트
ne: सम्पूर्ण घट्नाक्रमहरु
sl: Skupno število dogodkov

source: Total users
cy: Cyfanswm y defnyddwyr
hy: Ընդհանուր օգտվողներ
ko: 전체 사용자
ne: सम्पूर्ण प्रयोगकर्ताहरु
sl: Skupno število uporabnikov

source: Earliest birth
cy: Genedigaeth gynharaf
hy: Ամենավաղ ծնունդը
ko: 가장 빠른 출생
ne: सबैभन्दा प्रारम्भिक जन्म
sl: Najzgodnejše rojstvo

source: Latest birth
cy: Genedigaeth ddiweddaraf
hy: Վերջին ծնունդը
ko: 최근 출생
ne: पछिल्लो जन्म
sl: Zadnje rojstvo

source: Earliest death
cy: Marwolaeth gynharaf
hy: Ամենավաղ մահը
ko: 가장 빠른 사망
ne: प्रारम्भिक मृत्यु
sl: Najzgodnejša smrt

source: Latest death
cy: Marwolaeth ddiweddaraf
hy: Վերջին մահը
ko: 최근 사망
ne: पछिल्लो मृत्यु
sl: Zadnja smrt

source: Individual who lived the longest
cy: Unigolyn a fu fyw hiraf
hy: Անհատ, ով ամենաերկարն է ապրել
ko: 가장 오래 살았던 인물
ne: धेरै समय बाँच्ने व्यक्ति
sl: Oseba z najdaljšo življenjsko dobo

source: Family with the most children
cy: Teulu gyda'r nifer fwyaf o blant
hy: Ամենաշատ երեխա ունեցող ընտանիք
ko: 자녀들이 가장 많은 가족
ne: धेरै छोराछोरी भएको परिवार
sl: Družina z največ otroki

source: Most common surnames
cy: Cyfenwau mwyaf cyffredin
hy: Ամենատարածված ազգանունները
ko: 가장 일반적인 가문이름
ne: धेरै प्रयोग भएका थरहरू
sl: Najpogostejši priimki

source: Number of surnames
cy: Nifer y cyfenwau
hy: Ազգանունների թիվը
ko: 가문이름의 수
ne: उपनामहरूको संख्या
sl: Število priimkov

source: This family tree was last updated on %s.
cy: Diweddarwyd y cart achau hwn ddiwethaf ar %s.
hy: Այս տոհմածառը վերջին անգամ թարմացվել է %s -ին:
ko: 이 가계도는 %s에서 마지막으로 업데이트되었습니다.
ne: यो पारिवारिक रूख अन्तिम पटक %s मा अद्यावधिक गरिएको थियो।
sl: To družinsko drevo je bilo nazadnje posodobljeno na dan %s.

source: To use this service, you need an account.
hy: Այս ծառայությունից օգտվելու համար ձեզ հարկավոր է հաշիվ:
ko: 이 서비스를 사용하려면 계정이 필요합니다.
ne: यो सेवा प्रयोग गर्न, तपाईंलाई एउटा खाता चाहिन्छ।

source: Templates
cy: Templedi
hy: Կաղապարներ
ko: 템플릿
ne: टेम्प्लेटहरू
sl: Predloge
