Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Ward
cy: Gwarchodaeth
hy: Վարդ
ko: 후견인
ne: वार्ड
sl: Rejenec

source: Witness
cy: Tyst
hy: Վկա
ko: 증인
ne: साक्षी
sl: Priča

source: Research
cy: Ymchwil
hy: Հետազոտություն
ko: 연구
ne: अनुसन्धान
sl: Raziskava

source: Correspondence
cy: Gohebiaeth
hy: Նամակագրություն
ko: 서신[편지]
ne: पत्राचार
sl: Korespondenca

source: Other
cy: Arall
hy: Այլ
ko: 기타
ne: अन्य
sl: Drugo

source: Only managers can edit
cy: Dim ond rheolwyr all olygu
hy: Միայն կառավարիչները կարող են խմբագրել
ko: 관리자만 수정할 수 있습니다
ne: व्यवस्थापकहरूले मात्र सम्पादन गर्न सक्छन्
sl: Samo upravitelji lahko urejajo

source: husband
cy: gŵr
hy: ամուսին
ko: 남편
sl: mož

source: wife
cy: gwraig
hy: կինը
ko: 부인
ne: श्रीमती
sl: žena

source: mother
cy: mam
hy: մայրիկ
ko: 어머니
sl: mati

source: father
cy: tad
hy: հայրիկ
ko: 아버지
ne: बुवा
sl: oče

source: spouse
cy: priod
hy: ամուսին
ko: 배우자
sl: sporog/soprogra

source: Male
cy: Gwryw
hy: Արական
ko: 남성
ne: पुरुष
sl: Moški

source: Female
cy: Benyw
hy: Իգական
ko: 여성
ne: महिला
sl: Ženska

# unknown sex
source: Unknown
hy: Անհայտ
ne: अज्ञात

source: Book
cy: Llyfr
hy: Գիրք
ko: 서적
ne: पुस्तक
sl: Knjiga

source: Card
cy: Cerdyn
hy: Քարտ
ko: 카드
ne: कार्ड
sl: Razglednica

source: Coat of arms
cy: Arfbais
hy: զինանշան
ko: 가문 문장
ne: कोट अफ आर्मस्
sl: Grb

source: Document
cy: Dogfen
hy: Փաստաթուղթ
ko: 문서
ne: दस्ताबेज
sl: Dokument

source: Electronic
cy: Electroneg
hy: Էլեկտրոնային
ko: 전자
ne: विद्युतीय
sl: Elektronski vir

source: Microfiche
hy: Միկրոֆիշ
ko: 마이크로피시(책의 각 페이지를 축소 촬영한 시트 필름)
ne: माइक्रोफिच
sl: Mikrofiš

source: Microfilm
cy: Microffilm
hy: Միկրոֆիլմ
ko: 마이크로필름
ne: माइक्रोफिल्म
sl: Mikrofilm

source: Magazine
cy: Cylchgrawn
hy: Ամսագիր
ko: 잡지
ne: पत्रिका
sl: Revija

source: Manuscript
cy: Llawysgrif
hy: Ձեռագիր
ko: 원고
ne: पाण्डुलिपि
sl: Rokopis

source: Map
hy: Քարտեզ
ko: 지도
ne: नक्सा
sl: Zemljevid

source: Newspaper
cy: Papur newydd
hy: Թերթ
ko: 신문
ne: अखबार
sl: Časopis

source: Painting
cy: Paentiad
hy: Նկարչություն
ko: 그림
ne: चित्र
sl: Slika

source: Tombstone
cy: Carreg fedd
hy: Տապանաքար
ne: टम्बस्टोन
sl: Nagrobnik

source: Video
cy: Fideo
hy: Տեսանյութ
ko: 영상
ne: भिडियो

source: Aba, Nigeria
hy: Աբա, Նիգերիա
ko: 나이지리아 아바
ne: आबा, नाइजेरिया
sl: Aba, Nigerija

source: Accra, Ghana
hy: Ակրա, Գանա
ne: अक्रा, घाना
sl: Akra, Gana

source: Adelaide, Australia
cy: Adelaide, Awstralia
hy: Ադելաիդա, Ավստրալիա
ne: एडिलेड, अष्ट्रेलिया
sl: Adelaide, Avstralija

source: Cardston, Alberta, Canada
hy: Cardston, Ալբերտա, Կանադա
ne: कार्डस्टोन, अल्बर्ट, क्यानाडा
sl: Cardston, Alberta, Kanada

source: Albuquerque, New Mexico, United States
cy: Albuquerque, New Mexico, Unol Daleithiau
hy: Albuquerque, Նյու Մեքսիկո, Ամերիկայի Միացյալ Նահանգներ
ne: Albuquerque, न्यु मेक्सिको, संयुक्त राज्य अमेरिका
sl: Albuquerque, Nova Mehika, Združene države Amerike

source: Anchorage, Alaska, United States
cy: Anchorage, Alaska, Unol Daleithiau
hy: Anchorage, Ալյասկա, Ամերիկայի Միացյալ Նահանգներ
ne: एन्कोरेज, अलास्का, अमेरिका
sl: Anchorage, Aljaska, Združene države Amerike

source: Apia, Samoa
hy: Ապիա, Սամոա
ne: एपिया, सामोआ

source: Mesa, Arizona, United States
cy: Mesa, Arizona, Unol Daleithiau
hy: Mesa, Արիզոնա, Ամերիկայի Միացյալ Նահանգներ
ne: Mesa, एरिजोना, संयुक्त राज्य अमेरिका
sl: Mesa, Arizona, Združene države Amerike

source: Asunción, Paraguay
hy: Ասունսիոն, Պարագվայ
ne: Asunción, पाराग्वे

source: Atlanta, Georgia, United States
cy: Atlanta, Georgia, Unol Daleithiau
hy: Ատլանտա, Ջորջիա, Ամերիկայի Միացյալ Նահանգներ
ne: Atlanta, Georgia, संयुक्त राज्य अमेरिका
sl: Atlanta, Georgia, Združene države Amerike

source: Buenos Aires, Argentina
cy: Buenos Aires, yr Ariannin
hy: Բուենոս Այրես, Արգենտինա
ne: ब्यूनस आयर्स, अर्जेन्टिना

source: Billings, Montana, United States
cy: Billings, Montana, Unol Daleithiau
hy: Billings, Մոնտանա, Ամերիկայի Միացյալ Նահանգներ
ne: Billings, मोन्टाना, संयुक्त राज्य अमेरिका
sl: Billings, Montana, Združene države Amerike

source: Birmingham, Alabama, United States
cy: Birmingham, Alabama, Unol Daleithiau
hy: Բիրմինգհեմ, Ալաբամա, Ամերիկայի Միացյալ Նահանգներ
ne: Birmingham, अलाबामा, संयुक्त राज्य अमेरिका
sl: Birmingham, Alabama, Združene države Amerike

source: Bismarck, North Dakota, United States
cy: Bismarck, Gogledd Dakota, Unol Daleithiau
hy: Բիսմարկ, Հյուսիսային Դակոտա, Ամերիկայի Միացյալ Նահանգներ
ne: बिस्म्यार्क, उत्तरी डाकोटा, संयुक्त राज्य अमेरिका
sl: Bismarck, Severna Dakota, Združene države Amerike

source: Bogotá, Colombia
hy: Բոգոտա, Կոլումբիա
ne: बोगोता, कोलम्बिया

source: Boise, Idaho, United States
cy: Boise, Idaho, Unol Daleithiau
hy: Boise, Այդահո, Ամերիկայի Միացյալ Նահանգներ
ne: बोइस, आइदाहो, संयुक्त राज्य अमेरिका
sl: Boise, Idaho, Združene države Amerike

source: Boston, Massachusetts, United States
cy: Boston, Massachusetts, Unol Daleithiau
hy: Բոստոն, Մասաչուսեթս, Ամերիկայի Միացյալ Նահանգներ
ne: बोस्टन, म्यासाचुसेट्स, संयुक्त राज्य अमेरिका
sl: Boston, Massachusetts, Združene države Amerike

source: Bountiful, Utah, United States
cy: Bountiful, Utah, Unol Daleithiau
hy: Բաունթիֆուլ, Յուտա, Միացյալ Նահանգներ
ne: बौन्टीफुल, ओथ, संयुक्त राज्य अमेरिका
sl: Bountiful, Utah, Združene države Amerike

source: Brigham City, Utah, United States
cy: Brigham City, Utah, Unol Daleithiau
hy: Brigham City, Յուտա, Միացյալ Նահանգներ
ko: Brigham City, Utah, United State
ne: ब्रिहङ्गम सिटी, ओथ, संयुक्त राज्य अमेरिका
sl: Brigham City, Utah, Združene države Amerike

source: Brisbane, Australia
cy: Brisbane, Awstralia
hy: Բրիսբեն, Ավստրալիա
ne: ब्रिसवेन, अस्ट्रेलिया
sl: Brisbane, Avstralija

source: Baton Rouge, Louisiana, United States
cy: Baton Rouge, Louisiana, Unol Daleithiau
hy: Baton Rouge, Լուիզիանա, Ամերիկայի Միացյալ Նահանգներ
ne: Baton Rouge, लुइजियाना, संयुक्त राज्य अमेरिका
sl: Baton Rouge, Louisiana, Združene države Amerike

source: Calgary, Alberta, Canada
hy: Կալգարի, Ալբերտա, Կանադա
ne: क्याल्ग्रे, अल्बर्ट, क्यानाडा
sl: Calgary, Alberta, Kanada

source: Campinas, Brazil
cy: Campinas, Brasil
hy: Կամպինաս, Բրազիլիա
ne: क्याम्पिनास, ब्राजिल
sl: Campinas, Brazilija

source: Caracas, Venezuela
hy: Կարակաս, Վենեսուելա
ne: कराकस, भेनेजुएला

source: Cebu City, Philippines
cy: Dinas Cebu, Philippines
hy: Սեբու քաղաք, Ֆիլիպիններ
ne: सेबु सिटी, फिलिपिन्स
sl: Cebu, Filipini

source: Chicago, Illinois, United States
cy: Chicago, Illinois, Unol Daleithiau
hy: Չիկագո, Իլինոյս, Ամերիկայի Միացյալ Նահանգներ
ne: शिकागो, इलनोए, संयुक्त राज्य अमेरिका
sl: Chicago, Illinois, Združene države Amerike

source: Ciudad Juárez, Mexico
hy: Սյուդադ Խուարես, Մեքսիկա
ne: Ciudad Juarez, मेक्सिको

source: Cochabamba, Bolivia
cy: Cochabamba, Bolifia
hy: Կոչաբամբա, Բոլիվիա
ne: कोचाबाम्बा, बोलिभिया
sl: Cochabamba, Bolivija

source: Colonia Juárez, Mexico
hy: Կոլոնիա Խուարես, Մեքսիկա
ne: कोलोनिया जुआरेज, मेक्सिको

source: Columbia, South Carolina, United States
cy: Columbia, De Carolina, Unol Daleithiau
hy: Կոլումբիա, Հարավային Կարոլինա, Ամերիկայի Միացյալ Նահանգներ
ne: Columbia, दक्षिण क्यारोलाइना, संयुक्त राज्य अमेरिका
sl: Columbia, Južna Karolina, Združene države Amerike

source: Columbus, Ohio, United States
cy: Columbus, Ohio, Unol Daleithiau
hy: Columbus, Օհայո, Ամերիկայի Միացյալ Նահանգներ
ne: Columbus, ओहायो, संयुक्त राज्य अमेरिका
sl: Columbus, Ohio, Združene države Amerike

source: Copenhagen, Denmark
cy: Copenhagen, Denmarc
hy: Կոպենհագեն, Դանիա
ne: कोपेनहेगन, डेनमार्क
sl: København, Danska

source: Córdoba, Argentina
hy: Կորդոբա, Արգենտինա
ne: कोर्डोबा, अर्जेन्टिना

source: Columbia River, Washington, United States
cy: Columbia River, Washington, Unol Daleithiau
hy: Columbia River, Վաշինգտոն, Ամերիկայի Միացյալ Նահանգներ
ne: कोलम्बिया नदी, वासिङ्गटन, संयुक्त राज्य अमेरिका
sl: Columbia River, Washington, Združene države Amerike

source: Curitiba, Brazil
cy: Curitiba, Brasil
hy: Կուրիտիբա, Բրազիլիա
ne: क्युरिटिबा, ब्राजिल
sl: Curitiba, Brazilija

source: Dallas, Texas, United States
cy: Dallas, Texas, Unol Daleithiau
hy: Դալլաս, Տեխաս, Ամերիկայի Միացյալ Նահանգներ
ne: डल्लास, टेक्सस्, संयुक्त राज्य अमेरिका
sl: Dallas, Teksas, Združene države Amerike

source: Denver, Colorado, United States
cy: Denver, Colorado, Unol Daleithiau
hy: Դենվեր, Կոլորադո, Ամերիկայի Միացյալ Նահանգներ
ne: Denver, कलोराडो, संयुक्त राज्य अमेरिका
sl: Denver, Kolorado, Združene države Amerike

source: Detroit, Michigan, United States
cy: Detroit, Michigan, Unol Daleithiau
hy: Դեթրոյթ, Միչիգան, Ամերիկայի Միացյալ Նահանգներ
ne: देत्रोइत, मिसिकन, संयुक्त राज्य अमेरिका
sl: Detroit, Michigan, Združene države Amerike

source: Draper, Utah, United States
cy: Draper, Utah, Unol Daleithiau
hy: Draper, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Draper, युटा, संयुक्त राज्य अमेरिका
sl: Draper, Utah, Združene države Amerike

source: Edmonton, Alberta, Canada
hy: Էդմոնտոն, Ալբերտա, Կանադա
ne: Edmonton, Alberta, क्यानाडा
sl: Edmonton, Alberta, Kanada

source: Endowment House
cy: Tŷ Gwaddoli
hy: Օժանդակ տուն
ne: इन्डोमेन्ट हाउस
sl: Obdaritvena hiša

source: Fort Lauderdale, Florida, United States
cy: Fort Lauderdale, Florida, Unol Daleithiau
hy: Ֆորտ Լոդերդեյլ, Ֆլորիդա, Ամերիկայի Միացյալ Նահանգներ
ne: Fort Lauderdale, फ्लोरिडा, संयुक्त राज्य अमेरिका
sl: Fort Lauderdale, Florida, Združene države Amerike

source: Frankfurt am Main, Germany
cy: Frankfurt am Main, yr Almaen
hy: Մայնի Ֆրանկֆուրտ, Գերմանիա
ne: फ्रैंकफर्ट एम मेन, जर्मनी
sl: Frankfurt na Majni, Nemčija

source: Freiburg, Germany
cy: Freiburg, yr Almaen
hy: Ֆրայբուրգ, Գերմանիա
ne: फ्राइबर्ग, जर्मनी
sl: Freiburg, Nemčija

source: Fresno, California, United States
cy: Fresno, California, Unol Daleithiau
hy: Ֆրեզնո, Կալիֆորնիա, Ամերիկայի Միացյալ Նահանգներ
ne: Fresno, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Fresno, Kalifornija, Združene države Amerike

source: Fukuoka, Japan
hy: Ֆուկուոկա, Ճապոնիա
ne: फुकुओका, जापान
sl: Fukuoka, Japonska

source: Gila Valley, Arizona, United States
cy: Cwm Gila, Arizona, Unol Daleithiau
hy: Gila Valley, Արիզոնա, Ամերիկայի Միացյալ Նահանգներ
ne: गिला Valley, एरिजोना, संयुक्त राज्य अमेरिका
sl: Gila Valley, Arizona, Združene države Amerike

source: Gilbert, Arizona, United States
cy: Gilbert, Arizona, Unol Daleithiau
hy: Gilbert, Արիզոնա, Ամերիկայի Միացյալ Նահանգներ
ne: गिलबर्ट, एरिजोना, संयुक्त राज्य अमेरिका
sl: Gilbert, Arizona, Združene države Amerike

source: Guadalajara, Mexico
cy: Guadalajara, Mecsico
hy: Գվադալախարա, Մեքսիկա
ne: ग्वाडालजारा, मेक्सिको
sl: Guadalajara, Mehika

source: Guatemala City, Guatemala
cy: Dinas Guatemala, Guatemala
hy: Գվատեմալա Սիթի, Գվատեմալա
ne: ग्वाटेमाला सिटी, ग्वाटेमाला
sl: Gvatemala, Gvatemala

source: Guayaquil, Ecuador
cy: Guayaquil, Ecwador
hy: Գուայաքիլ, Էկվադոր
ne: ग्वायाकिल, इक्वेडर
sl: Guayaquil, Ekvador

source: The Hague, Netherlands
cy: Yr Hâg, Yr Iseldiroedd
hy: Հաագա, Նիդեռլանդներ
ne: हेग, नेदरल्याण्ड्स
sl: The Hague, Nizozemska

source: Halifax, Nova Scotia, Canada
hy: Հալիֆաքս, Նոր Շոտլանդիա, Կանադա
ne: Halifax, नोभा स्कोटिया, क्यानाडा
sl: Halifax, Nova Škotska, Kanada

source: Hartford, Connecticut, United States
cy: Hartford, Connecticut, Unol Daleithiau
hy: Հարթֆորդ, Կոնեկտիկուտ, Ամերիկայի Միացյալ Նահանգներ
ne: Hartford, कनेक्टिकट, संयुक्त राज्य अमेरिका
sl: Hartford, Connecticut, Združene države Amerike

source: Laie, Hawaii, United States
cy: Laie, Hawaii, Unol Daleithiau
hy: Laie, Հավայան կղզիներ, Ամերիկայի Միացյալ Նահանգներ
ne: Laie, हवाई, संयुक्त राज्य अमेरिका
sl: Laie, Havaji, Združene države Amerike

source: Helsinki, Finland
cy: Helsinki, Y Ffindir
hy: Հելսինկի, Ֆինլանդիա
ne: हेलसिंकी, फिनल्याण्ड
sl: Helsinki, Finska

source: Hermosillo, Mexico
cy: Hermosillo, Mecsico
hy: Հերմոսիլո, Մեքսիկա
ne: हर्मोसिलो, मेक्सिको
sl: Hermosillo, Mehika

source: Hong Kong
hy: Հոնկոնգ
ne: हङकङ

source: Houston, Texas, United States
cy: Houston, Texas, Unol Daleithiau
hy: Հյուսթոն, Տեխաս, Ամերիկայի Միացյալ Նահանգներ
ne: Houston, टेक्सस्, संयुक्त राज्य अमेरिका
sl: Houston, Teksas, Združene države Amerike

source: Idaho Falls, Idaho, United States
cy: Idaho Falls, Idaho, Unol Daleithiau
hy: Այդահո Ֆոլս, Այդահո, Ամերիկայի Միացյալ Նահանգներ
ne: Idaho Falls, Idaho, संयुक्त राज्य अमेरिका
sl: Idaho Falls, Idaho, Združene države Amerike

source: Indianapolis, Indiana, United States
cy: Indianapolis, Indiana, Unol Daleithiau
hy: Ինդիանապոլիս, Ինդիանա, Ամերիկայի Միացյալ Նահանգներ
ne: Indianapolis, इन्डियाना, संयुक्त राज्य अमेरिका
sl: Indianapolis, Indiana, Združene države Amerike

source: Johannesburg, South Africa
cy: Johannesburg, De Affrica
hy: Յոհանեսբուրգ, Հարավային Աֆրիկա
ne: जोहानेसबर्ग, दक्षिण अफ्रिका
sl: Johannesburg, Južna Afrika

source: Jordan River, Utah, United States
cy: Afon Jordan, Utah, Unol Daleithiau
hy: Jordan River, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Jordan River, Utah, संयुक्त राज्य अमेरिका
sl: Jordan River, Utah, Združene države Amerike

source: Kansas City, Missouri, United States
cy: Kansas City, Missouri, Unol Daleithiau
hy: Կանզաս Սիթի, Միսսուրի, Միացյալ Նահանգներ
ne: Kansas City, Missouri, संयुक्त राज्य अमेरिका
sl: Kansas City, Missouri, Združene države Amerike

source: Kona, Hawaii, United States
cy: Kona, Hawaii, Unol Daleithiau
hy: Kona, Հավայան կղզիներ, Ամերիկայի Միացյալ Նահանգներ
ne: Kona, हवाई, संयुक्त राज्य अमेरिका
sl: Kona, Havaji, Združene države Amerike

source: Kyiv, Ukraine
cy: Kyiv, Wcráin
hy: Կիև, Ուկրաինա
ne: कीभ, युक्रेन
sl: Kijev, Ukrajina

source: Los Angeles, California, United States
cy: Los Angeles, California, Unol Daleithiau
hy: Լոս Անջելես, Կալիֆորնիա, Միացյալ Նահանգներ
ne: लस एन्जलस, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Los Angeles, Kalifornija, Združene države Amerike

source: Lima, Peru
cy: Lima, Periw
hy: Լիմա, Պերու
ne: लिमा, पेरु

source: Logan, Utah, United States
cy: Logan, Utah, Unol Daleithiau
hy: Logan, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Logan, युटा, संयुक्त राज्य अमेरिका
sl: Logan, Utah, Združene države Amerike

source: London, England
cy: Llundain, Lloegr
hy: Լոնդոն, Անգլիա
ne: लन्डन, इङ्गल्याण्ड
sl: London, Anglija

source: Louisville, Kentucky, United States
cy: Louisville, Kentucky, Unol Daleithiau
hy: Լուիսվիլ, Կենտուկի, Ամերիկայի Միացյալ Նահանգներ
ne: Louisville, केन्टकी, संयुक्त राज्य अमेरिका
sl: Louisville, Kentucky, Združene države Amerike

source: Lubbock, Texas, United States
cy: Lubbock, Texas, Unol Daleithiau
hy: Lubbock, Տեխաս, Ամերիկայի Միացյալ Նահանգներ
ne: Lubbock, टेक्सस्, संयुक्त राज्य अमेरिका
sl: Lubbock, Teksas, Združene države Amerike

source: Las Vegas, Nevada, United States
cy: Las Vegas, Nevada, Unol Daleithiau
hy: Լաս Վեգաս, Նևադա, Միացյալ Նահանգներ
ne: लस भेगास, नेभाडा, संयुक्त राज्य अमेरिका
sl: Las Vegas, Nevada, Združene države Amerike

source: Madrid, Spain
cy: Madrid, Sbaen
hy: Մադրիդ, Իսպանիա
ne: म्याड्रिड, स्पेन
sl: Madrid, Španija

source: Manaus, Brazil
cy: Manaus, Brasil
hy: Մանաուս, Բրազիլիա
ne: मानौस, ब्राजिल
sl: Manaus, Brazilija

source: Manhattan, New York, United States
cy: Manhattan, Efrog Newydd, Unol Daleithiau
hy: Մանհեթեն, Նյու Յորք, Ամերիկայի Միացյալ Նահանգներ
ne: Manhattan, न्यु योर्क, संयुक्त राज्य अमेरिका
sl: Manhattan, New York, Združene države Amerike

source: Manila, Philippines
hy: Մանիլա, Ֆիլիպիններ
ne: मनिला, फिलिपिन्स
sl: Manila, Filipini

source: Manti, Utah, United States
cy: Manti, Utah, Unol Daleithiau
hy: Manti, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Manti, युटा, संयुक्त राज्य अमेरिका
sl: Manti, Utah, Združene države Amerike

source: Medford, Oregon, United States
cy: Medford, Oregon, Unol Daleithiau
hy: Մեդֆորդ, Օրեգոն, Ամերիկայի Միացյալ Նահանգներ
ne: Medford, अरिगन, संयुक्त राज्य अमेरिका
sl: Medford, Oregon, Združene države Amerike

source: Melbourne, Australia
cy: Melbourne, Awstralia
hy: Մելբուրն, Ավստրալիա
ne: मेलबर्न, अष्ट्रेलिया
sl: Melbourne, Avstralija

source: Memphis, Tennessee, United States
cy: Memphis, Tennessee, Unol Daleithiau
hy: Մեմֆիս, Թենեսի, Ամերիկայի Միացյալ Նահանգներ
ne: Memphis, टेनसी, संयुक्त राज्य अमेरिका
sl: Memphis, Tennessee, Združene države Amerike

source: Merida, Mexico
cy: Merida, Mecsico
hy: Մերիդա, Մեքսիկա
ne: मेरिडा, मेक्सिको
sl: Merida, Mehika

source: Mexico City, Mexico
cy: Dinas Mecsico, Mecsico
hy: Մեխիկո Սիթի, Մեքսիկա
ne: मेक्सिको सिटी, मेक्सिको
sl: Mexico City, Mehika

source: Montevideo, Uruguay
hy: Մոնտեվիդեո, Ուրուգվայ
ne: मोन्टेभिडियो, उरुग्वे
sl: Montevideo, Urugvaj

source: Monterrey, Mexico
cy: Monterrey, Mecsico
hy: Մոնտերեյ, Մեքսիկա
ne: मोन्टेरी, मेक्सिको
sl: Monterrey, Mehika

source: Monticello, Utah, United States
cy: Monticello, Utah, Unol Daleithiau
hy: Monticello, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Monticello, युटा, संयुक्त राज्य अमेरिका
sl: Monticello, Utah, Združene države Amerike

source: Montreal, Quebec, Canada
hy: Մոնրեալ, Քվեբեկ, Կանադա
ne: Montreal, Quebec, क्यानाडा
sl: Montréal, Québec, Kanada

source: Mount Timpanogos, Utah, United States
cy: Mount Timpanogos, Utah, Unol Daleithiau
hy: Mount Timpanogos, Յուտա, Միացյալ Նահանգներ
ne: Mount Timpanogos, Utah, संयुक्त राज्य अमेरिका
sl: Mount Timpanogos, Utah, Združene države Amerike

source: Nashville, Tennessee, United States
cy: Nashville, Tennessee, Unol Daleithiau
hy: Նեշվիլ, Թենեսի, Ամերիկայի Միացյալ Նահանգներ
ne: Nashville, टेनसी, संयुक्त राज्य अमेरिका
sl: Nashville, Tennessee, Združene države Amerike

source: Nauvoo (new), Illinois, United States
cy: Nauvoo (newydd), Illinois, Unol Daleithiau
hy: Նավու (նոր), Իլինոյս, Միացյալ Նահանգներ
ne: Nauvoo (नयाँ), इलिनोइस, संयुक्त राज्य अमेरिका
sl: Nauvoo (novo), Illinois, Združene države Amerike

source: Nauvoo (original), Illinois, United States
cy: Nauvoo (gwreiddiol), Illinois, Unol Daleithiau
hy: Նավու (օրիգինալ), Իլինոյս, ԱՄՆ
ne: Nauvoo (मूल), इलिनोइस, संयुक्त राज्य अमेरिका
sl: Nauvoo (izvirno), Illinois, Združene države Amerike

source: Newport Beach, California, United States
cy: Traeth Casnewydd, California, Unol Daleithiau
hy: Նյուպորտ Բիչ, Կալիֆորնիա, Միացյալ Նահանգներ
ne: Newport Beach, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Newport Beach, Kalifornija, Združene države Amerike

source: Nuku’Alofa, Tonga
hy: Նուկու Ալոֆա, Տոնգա
ne: Nuku'Alofa, टोंगा

source: New York, New York, United States
cy: Efrog Newydd, Efrog Newydd, Unol Daleithiau
hy: Նյու Յորք, Նյու Յորք, Միացյալ Նահանգներ
ne: New York, New York, संयुक्त राज्य अमेरिका
sl: New York, New York, Združene države Amerike

source: Hamilton, New Zealand
cy: Hamilton, Seland Newydd
hy: Համիլթոն, Նոր Զելանդիա
ne: ह्यामिल्टन, न्युजिल्याण्ड
sl: Hamilton, Nova Zelandija

source: Oakland, California, United States
cy: Oakland, California, Unol Daleithiau
hy: Օքլենդ, Կալիֆորնիա, Ամերիկայի Միացյալ Նահանգներ
ne: Oakland, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Oakland, Kalifornija, Združene države Amerike

source: Oaxaca, Mexico
cy: Oaxaca, Mecsico
hy: Օախակա, Մեքսիկա
ne: ओक्साका, मेक्सिको
sl: Oaxaca, Mehika

source: Ogden, Utah, United States
cy: Ogden, Utah, Unol Daleithiau
hy: Ogden, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Ogden, युटा, संयुक्त राज्य अमेरिका
sl: Ogden, Utah, Združene države Amerike

source: Oklahoma City, Oklahoma, United States
cy: Dinas Oklahoma, Oklahoma, Unol Daleithiau
hy: Օկլահոմա Սիթի, Օկլահոմա, Միացյալ Նահանգներ
ne: Oklahoma City, Oklahoma, संयुक्त राज्य अमेरिका
sl: Oklahoma City, Oklahoma, Združene države Amerike

source: Oquirrh Mountain, Utah, United States
cy: Mynydd Oquirrh, Utah, Unol Daleithiau
hy: Oquirrh Mountain, Յուտա, Միացյալ Նահանգներ
ne: Oquirrh Mountain, Utah, संयुक्त राज्य अमेरिका
sl: Oquirrh Mountain, Utah, Združene države Amerike

source: Orlando, Florida, United States
cy: Orlando, Florida, Unol Daleithiau
hy: Օռլանդո, Ֆլորիդա, Ամերիկայի Միացյալ Նահանգներ
ne: Orlando, फ्लोरिडा, संयुक्त राज्य अमेरिका
sl: Orlando, Florida, Združene države Amerike

source: Porto Alegre, Brazil
cy: Porto Alegre, Brasil
hy: Պորտո Ալեգրե, Բրազիլիա
ne: पोर्टो एलेग्रे, ब्राजिल
sl: Porto Alegre, Brazilija

source: Palmyra, New York, United States
cy: Palmyra, Efrog Newydd, Unol Daleithiau
hy: Պալմիրա, Նյու Յորք, Ամերիկայի Միացյալ Նահանգներ
ne: Palmyra, न्यु योर्क, संयुक्त राज्य अमेरिका
sl: Palmyra, New York, Združene države Amerike

source: Papeete, Tahiti
hy: Պապեետե, Թաիթի
ne: Papeete, ताहिती

source: Payson, Utah, United States
cy: Payson, Utah, Unol Daleithiau
hy: Փեյսոն, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Payson, युटा, संयुक्त राज्य अमेरिका
sl: Payson, Utah, Združene države Amerike

source: Perth, Australia
cy: Perth, Awstralia
hy: Պերտ, Ավստրալիա
ne: पर्थ, अष्ट्रेलिया
sl: Perth, Avstralija

source: Phoenix, Arizona, United States
cy: Phoenix, Arizona, Unol Daleithiau
hy: Phoenix, Արիզոնա, Ամերիկայի Միացյալ Նահանգներ
ne: Phoenix, एरिजोना, संयुक्त राज्य अमेरिका
sl: Phoenix, Arizona, Združene države Amerike

source: President’s Office
cy: Swyddfa'r Llywydd
hy: Նախագահի աշխատակազմ
ne: राष्ट्रपति कार्यालय
sl: Predsednikov urad

source: Portland, Oregon, United States
cy: Portland, Oregon, Unol Daleithiau
hy: Պորտլենդ, Օրեգոն, Ամերիկայի Միացյալ Նահանգներ
ne: Portland, अरिगन, संयुक्त राज्य अमेरिका
sl: Portland, Oregon, Združene države Amerike

source: Preston, England
cy: Preston, Lloegr
hy: Պրեստոն, Անգլիա
ne: प्रेस्टन, इङ्गल्याण्ड
sl: Preston, Anglija

source: Provo City Center, Utah, United States
cy: Canol Dinas Provo, Utah, Unol Daleithiau
hy: Provo City Center, Յուտա, Միացյալ Նահանգներ
ne: Provo City Center, Utah, संयुक्त राज्य अमेरिका
sl: Provo City Center, Utah, Združene države Amerike

source: Provo, Utah, United States
cy: Provo, Utah, Unol Daleithiau
hy: Պրովո, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Provo, युटा, संयुक्त राज्य अमेरिका
sl: Provo, Utah, Združene države Amerike

source: Quetzaltenango, Guatemala
hy: Quetzaltenango, Գվատեմալա
ne: Quetzaltenango, ग्वाटेमाला
sl: Quetzaltenango, Gvatemala

source: Raleigh, North Carolina, United States
cy: Raleigh, Gogledd Carolina, Unol Daleithiau
hy: Raleigh, Հյուսիսային Կարոլինա, Միացյալ Նահանգներ
ne: Raleigh, उत्तरी क्यारोलाइना, संयुक्त राज्य अमेरिका
sl: Raleigh, Severna Karolina, Združene države Amerike

source: Recife, Brazil
cy: Recife, Brasil
hy: Ռեսիֆե, Բրազիլիա
ne: रेसिफे, ब्राजिल
sl: Recife, Brazilija

source: Redlands, California, United States
cy: Redlands, California, Unol Daleithiau
hy: Redlands, Կալիֆորնիա, Ամերիկայի Միացյալ Նահանգներ
ne: Redlands, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Redlands, Kalifornija, Združene države Amerike

source: Regina, Saskatchewan, Canada
hy: Ռեգինա, Սասկաչևան, Կանադա
ne: Regina, Saskatchewan, क्यानाडा
sl: Regina, Saskatchewan, Kanada

source: Reno, Nevada, United States
cy: Reno, Nevada, Unol Daleithiau
hy: Reno, Նևադա, Ամերիկայի Միացյալ Նահանգներ
ne: Reno, नेभाडा, संयुक्त राज्य अमेरिका
sl: Reno, Nevada, Združene države Amerike

source: Rexburg, Idaho, United States
cy: Rexburg, Idaho, Unol Daleithiau
hy: Rexburg, Այդահո, Ամերիկայի Միացյալ Նահանգներ
ne: Rexburg, आइडाहो, संयुक्त राज्य अमेरिका
sl: Rexburg, Idaho, Združene države Amerike

source: Sacramento, California, United States
cy: Sacramento, California, Unol Daleithiau
hy: Սակրամենտո, Կալիֆորնիա, Ամերիկայի Միացյալ Նահանգներ
ne: Sacramento, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: Sacramento, Kalifornija, Združene države Amerike

source: San Salvador, El Salvador
hy: Սան Սալվադոր, Էլ Սալվադոր
ne: सान साल्भाडोर, एल साल्भाडोर
sl: San Salvador, Salvador

source: Santiago, Chile
hy: Սանտյագո, Չիլի
ne: सान्टियागो, चिली
sl: Santiago, Čile

source: San Antonio, Texas, United States
cy: San Antonio, Texas, Unol Daleithiau
hy: Սան Անտոնիո, Տեխաս, Ամերիկայի Միացյալ Նահանգներ
ne: San Antonio, टेक्सस्, संयुक्त राज्य अमेरिका
sl: San Antonio, Teksas, Združene države Amerike

source: San Diego, California, United States
cy: San Diego, California, Unol Daleithiau
hy: Սան Դիեգո, Կալիֆորնիա, Միացյալ Նահանգներ
ne: स्यान डिएगो, क्यालिफोर्निया, संयुक्त राज्य अमेरिका
sl: San Diego, Kalifornija, Združene države Amerike

source: Santo Domingo, Dominican Republic
cy: Santo Domingo, Gweriniaeth Dominicanaidd
hy: Սանտո Դոմինգո, Դոմինիկյան Հանրապետություն
sl: Santo Domingo, Dominikanska republika
