Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

# You should review the changes and then accept or reject them.
source: accept
cy: derbyn
hy: ընդունել
ko: 동의
ne: स्वीकार गर्नुहोस्
sl: sprejmi

# You should review the changes and then accept or reject them.
source: reject
cy: gwrthod
hy: մերժել
ko: 거부
ne: अस्वीकार
sl: zavrni

source: This family has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r teulu hwn wedi'i olygu. Dylech adolygu'r newidiadau ac yna eu %1$s neu eu %2$s nhw.
hy: Այս ընտանիքը խմբագրվել է: Դուք պետք է վերանայեք փոփոխությունները, այնուհետև %1$s կամ %2$s դրանք:
ko: 이 가족은 편집되었습니다. 변경 사항을 검토 한 다음 %1$s 또는 %2$s 변경해야 합니다.
ne: यो परिवार सम्पादन गरिएको छ। तपाईंले परिवर्तनहरूको समीक्षा गर्नुपर्छ र त्यसपछि %1$s वा %2$s तिनीहरूलाई।
sl: Ta družina je urejena. Preglejte spremembe in jih nato %1$s ali %2$s.

source: This family has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r teulu hwn wedi'i olygu. Mae angen i'r cymedrolwr adolygu'r newidiadau.
hy: Այս ընտանիքը խմբագրվել է: Փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից:
ko: 이 가족은 편집되었습니다. 중재자가 변경 사항을 검토해야합니다.
ne: यो परिवार सम्पादन गरिएको छ। परिवर्तनहरू एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ta družina je urejena. Spremembe mora pregledati moderator.

source: No facts exist for this family.
cy: Nid oes unrhyw ffeithiau'n bodoli i'r teulu hwn.
hy: Այս ընտանիքի համար փաստեր չկան.
ko: 이 가족에 대한 정보가 없습니다.
ne: यस परिवारको लागि कुनै तथ्य छैन।
sl: Za to družino ni navedenih dejstev.

source: Username or email address
cy: Enw defnyddiwr neu gyfeiriad e-bost
hy: Օգտվողի անունը կամ էլփոստի հասցեն
ko: 사용자 이름이나 이메일 주소
ne: प्रयोगकर्ता नाम अथवा ई–मेल ठेगाना
sl: Uporabniško ime ali e-poštni naslov

source: Data fixes can require lots of slow calculations, so it is not possible to create an exact list of records that need to be updated.
cy: Gall atgyweiriadau data ofyn am lawer o gyfrifiadau araf, felly nid yw'n bosibl creu rhestr union o gofnodion y mae angen eu diweddaru.
hy: Տվյալների շտկումները կարող են պահանջել շատ դանդաղ հաշվարկներ, ուստի հնարավոր չէ թարմացվող գրառումների ճշգրիտ ցուցակ ստեղծել:
ko: 데이터 수정에는 느린 계산이 많이 필요할 수 있으므로 업데이트해야 하는 레코드의 정확한 목록을 생성하는 것은 불가능합니다.
ne: डाटा फिक्सहरूलाई धेरै ढिलो गणनाहरू आवश्यक पर्दछ, त्यसैले यो अद्यावधिक गर्न आवश्यक रेकर्डहरूको सही सूची सिर्जना गर्न सम्भव छैन।
sl: Popravki podatkov lahko zahtevajo veliko dolgotrajnih izračunov, zato ni mogoče ustvariti natančnega seznama zapisov, ki jih je treba posodobiti.

source: For example, we can quickly find individuals that do not have a death event, but it is much slower to calculate if the individual is dead.
cy: Er enghraifft, gallwn ddod o hyd i unigolion nad oes ganddynt ddigwyddiad marwolaeth yn gyflym, ond mae'n llawer arafach cyfrifo a yw'r unigolyn wedi marw.
hy: Օրինակ, մենք կարող ենք արագ գտնել անհատներ, որոնց մոտ մահվան դեպք չկա, բայց շատ ավելի դանդաղ է հաշվարկել, թե արդյոք անհատը մահացել է:
ko: 예를 들어 사망 데이터가 없는 인물을 빠르게 찾을 수 있지만, 인물이 사망했는지 여부를 계산하는 것은 훨씬 느립니다.
ne: उदाहरणका लागि, मृत्युको घटना नभएका व्यक्तिहरूलाई हामी तुरुन्तै फेला पार्न सक्छौं, तर व्यक्ति मरेको छ कि छैन भनेर गणना गर्न धेरै ढिलो हुन्छ।
sl: Na primer, hitro lahko najdemo osebe, ki nimajo dogodka smrt, vendar je veliko počasneje izračunati, ali je posameznik mrtev.

source: This list is created using a simple (but fast) search, and therefore includes records that will not be updated.
cy: Mae'r rhestr hon yn cael ei chreu gan ddefnyddio chwilio syml (ond cyflym), ac felly mae'n cynnwys cofnodion na fydd yn cael eu diweddaru.
hy: Այս ցուցակը ստեղծվում է պարզ (բայց արագ) որոնման միջոցով և, հետևաբար, ներառում է գրառումներ, որոնք չեն թարմացվելու:
ko: 이 목록은 단순하지만 빠른 검색을 사용하여 작성되므로 업데이트되지 않는 레코드를 포함합니다.
ne: यो सूची एक साधारण (तर छिटो) खोज प्रयोग गरेर सिर्जना गरिएको छ, र त्यसैले अद्यावधिक नहुने रेकर्डहरू समावेश गर्दछ।
sl: Ta seznam je ustvarjen z uporabo preprostega (vendar hitrega) iskanja in zato vključuje zapise, ki ne bodo posodobljeni.

source: Dates are stored using English abbreviations and keywords. Shortcuts are available as alternatives to these abbreviations and keywords.
cy: Mae dyddiadau'n cael eu storio gan ddefnyddio byrfoddau ac allweddeiriau Saesneg. Mae llwybrau byr ar gael fel dewisiadau amgen i'r byrfoddau a'r geiriau allweddol hyn.
hy: Ամսաթվերը պահվում են՝ օգտագործելով անգլերեն հապավումները և հիմնաբառերը: Դյուրանցումները հասանելի են որպես այս հապավումների և հիմնաբառերի այլընտրանք:
ko: 날짜는 영어 약어와 키워드를 사용하여 저장됩니다. 이러한 약어 및 키워드에 대한 대안으로 바로 가기를 사용할 수 있습니다.
ne: मितिहरू अङ्ग्रेजी संक्षिप्त रूपहरू र कुञ्जी शब्दहरू प्रयोग गरेर भण्डारण गरिएका छन् । सर्टकटहरू यी संक्षिप्त रूपहरू र कुञ्जी शब्दहरूको विकल्पको रूपमा उपलब्ध छन् ।
sl: Datumi so shranjeni z uporabo angleških okrajšav in ključnih besed. Kot alternativa tem okrajšavam in ključnim besedam so na voljo bližnjice.

source: Shortcut
cy: Llwybr Byr
hy: Դյուրանցում
ko: 바로가기
ne: सरलविधि
sl: Bližnjica

source: Date ranges are used to indicate that an event, such as a birth, happened on an unknown date within a possible range.
cy: Mae ystodau dyddiad yn cael eu defnyddio i nodi bod digwyddiad, fel genedigaeth, wedi digwydd ar ddyddiad anhysbys o fewn ystod bosibl.
hy: Ամսաթվերի միջակայքերը օգտագործվում են ցույց տալու համար, որ իրադարձությունը, ինչպիսին ծնունդն է, տեղի է ունեցել անհայտ ամսաթվի հնարավոր տիրույթում:
ko: 날짜 범위는 출생과 같은 사건이 가능한 범위 내에서 알 수 없는 날짜에 발생했음을 나타내는 데 사용됩니다.
ne: मिति दायराहरू संकेत गर्न प्रयोग गरिन्छ कि घटना, जस्तै जन्म, सम्भव दायरा भित्र अज्ञात मितिमा भयो।
sl: Časovna obdobja se uporabljajo za označevanje, da se je dogodek, kot je rojstvo, zgodil na neznan datum v možnem obsegu.

source: Date periods are used to indicate that a fact, such as an occupation, continued for a period of time.
cy: Mae cyfnodau dyddiad yn cael eu defnyddio i nodi bod ffaith, fel galwedigaeth, wedi parhau am gyfnod.
hy: Ամսաթվերի ժամկետները օգտագործվում են ցույց տալու համար, որ փաստը, ինչպիսին է զբաղմունքը, շարունակվել է որոշակի ժամանակահատվածում:
ko: 날짜 기간은 직업과 같은 정보가 일정 기간 동안 지속되었음을 나타내는 데 사용됩니다.
ne: मिति अवधिहरू संकेत गर्न प्रयोग गरिन्छ कि एक तथ्य, जस्तै पेशा, समय को लागी जारी रह्यो।
sl: Datumska obdobja se uporabljajo za označevanje, da se je neko dejstvo, kot je poklic, nadaljevalo v določenem obdobju.

source: Date period
cy: Cyfnod dyddiad
hy: Ամսաթվի ժամկետը
ko: 날짜 기간
ne: मिति अवधि
sl: Datumsko obdobje

source: Simple dates are assumed to be in the gregorian calendar. To specify a date in another calendar, add a keyword before the date. This keyword is optional if the month or year format make the date unambiguous.
cy: Mae dyddiadau syml yn cael eu tybio o fewn y calendr Gregoraidd. I nodi dyddiad mewn calendr arall, ychwanegwch allweddair cyn y dyddiad. Mae'r allweddair hwn yn ddewisol os yw'r fformat mis neu flwyddyn yn gwneud y dyddiad yn ddiamwys.
hy: Ենթադրվում է, որ պարզ ամսաթվերը գրված են Գրիգորյան օրացույցում: Մեկ այլ օրացույցում ամսաթիվ նշելու համար ավելացրեք հիմնաբառ ամսաթվից առաջ: Այս հիմնաբառը պարտադիր չէ, եթե ամսվա կամ տարվա ձևաչափը ամսաթիվը դարձնում է միանշանակ:
ko: 간단한 날짜는 그레고리력으로되어 있다고 가정합니다. 다른 캘린더에서 날짜를 지정하려면 날짜 앞에 키워드를 추가하십시오. 월 또는 연도 형식으로 날짜를 모호하지 않게하려면이 키워드는 선택 사항입니다.
ne: साधारण मितिहरू ग्रेगोरियन क्यालेन्डरमा मानिन्छन्। अर्को क्यालेन्डरमा मिति निर्दिष्ट गर्न, मिति भन्दा पहिले किवर्ड थप्नुहोस्। यदि महिना वा वर्ष ढाँचाले मिति अस्पष्ट बनाउँछ भने यो कुञ्जी शब्द वैकल्पिक छ।
sl: Preprosti datumi so predpostavljeno zapisani v gregorijanskem koledarju. Če želite določiti datum v drugem koledarju, dodajte ključno besedo pred datumom. Ta ključna beseda ni obvezna, če je datum nedvoumen zaradi zapisa meseca ali leta.

source: In many cultures it is customary to have a traditional name spelled in the traditional characters and also a romanized version of the name as it would be spelled or pronounced in languages based on the Latin alphabet, such as English.<br><br>If you prefer to use the Latin alphabet to enter the name in the standard name fields, then you can use this field to enter the same name in the non-Latin alphabet such as Greek, Hebrew, Russian, Arabic, or Chinese. Both versions of the name will appear in lists and charts.<br><br>Although this field is labeled “Hebrew”, it is not restricted to containing only Hebrew characters.
cy: Mewn llawer o ddiwylliannau mae'n arferol cael enw traddodiadol wedi'i sillafu yn y nodau traddodiadol a hefyd fersiwn wedi'i rhufenedig o'r enw gan y byddai'n cael ei sillafu neu ei ynganu mewn ieithoedd sy'n seiliedig ar yr wyddor Ladin, fel Saesneg.<br><br> Os yw'n well gennych ddefnyddio'r wyddor Ladin i nodi'r enw yn y meysydd enw safonol, yna gallwch ddefnyddio'r maes hwn i nodi'r un enw yn yr wyddor heblaw Lladin fel Groeg, Hebraeg, Rwseg, Arabeg neu Tsieinëeg. Bydd y ddau fersiwn o'r enw yn ymddangos mewn rhestrau a siartiau.<br><br> Er bod y maes hwn wedi'i labelu'n “Hebraeg”, nid yw'n gyfyngedig i gynnwys nodau Hebraeg yn unig.
hy: Շատ մշակույթներում ընդունված է ավանդական անունն ուղղագրել ավանդական գրանշաններով, ինչպես նաև անվան հռոմեական տարբերակ, ինչպես դա գրվում կամ արտասանվում է լատինական այբուբենի վրա հիմնված լեզուներով, օրինակ՝ անգլերենով:<br><br>Եթե նախընտրում եք օգտագործել լատինական այբուբենը՝ անունը ստանդարտ անվան դաշտերում մուտքագրելու համար, ապա կարող եք օգտագործել այս դաշտը՝ նույն անունը Latin, ռուսերեն, եբրայերեն, al-չինարեն, ոչ-չինարեն, ոչ-չինարեն, ոչ-չինարեն, ոչ-չինարեն, ոչ-չինարեն, ոչ-չինարեն կամ ոչ-չինարեն աբեթ մուտքագրելու համար: Անվան երկու տարբերակները կհայտնվեն ցուցակներում և գծապատկերներում:<br><br>Չնայած այս դաշտը պիտակավորված է «եբրայերեն», այն չի սահմանափակվում միայն եբրայերեն գրանշաններով:
ko: 많은 문화권에서는 영어와 같은 라틴 알파벳을 기반으로 하는 언어에서 철자 또는 발음되는 것과 같이 전통적인 이름을 전통적인 문자로 철자하고 로마자로 표기하는 것이 관례입니다.<br><br>만약 히브리어, 그리스어, 러시아어, 중국어 또는 아랍어와 같은 비라틴 알파벳을 사용하여 표준 이름 필드에 이름을 입력하려는 경우 이 필드에 라틴 알파벳을 사용하여 동일한 이름을 입력할 수 있습니다. 두 가지 버전의 이름이 목록과 차트에 표시됩니다.<br><br>이 필드에 "로마자 표기"라고 표시되어 있지만 라틴 알파벳을 기반으로 한 문자만 포함하도록 제한되지는 않습니다. 이것은 세 개의 다른 알파벳이 나타날 수 있는 일본어 이름과 함께 사용할 수 있습니다.
ne: धेरै संस्कृतिहरूमा परम्परागत वर्णहरूमा परम्परागत नामको हिज्जे र नामको रोमनीकृत संस्करण हुने चलन छ किनकि यसलाई अंग्रेजी जस्ता ल्याटिन वर्णमालामा आधारित भाषाहरूमा हिज्जे वा उच्चारण गरिन्छ।<br><br>यदि तपाईं मानक नाम क्षेत्रहरूमा नाम प्रविष्ट गर्न ल्याटिन वर्णमाला प्रयोग गर्न रुचाउनु हुन्छ, त्यसपछि तपाईंले ग्रीक, हिब्रू, रुसी, अरबी, वा चिनियाँ जस्ता गैर-ल्याटिन वर्णमालाहरूमा उही नाम प्रविष्ट गर्न यो क्षेत्र प्रयोग गर्न सक्नुहुन्छ। नामको दुबै संस्करणहरू सूची र चार्टहरूमा देखा पर्नेछ।<br><br>यद्यपि यो क्षेत्रलाई "हिब्रू" लेबल गरिएको छ, यो केवल हिब्रू वर्णहरू समावेश गर्न प्रतिबन्धित छैन।
sl: V mnogih kulturah je običajno, da se tradicionalno ime zapiše s tradicionalnimi znaki, pa tudi v romanizirani različici imena, kot bi se zapisalo ali izgovorilo v jezikih (npr. angleščina), ki temeljijo na latinici.<br><br>Če za vnos imena v standardna polja za ime raje uporabljate latinico, lahko v to polje vnesete isto ime v jeziku, ki ne uporablja latinice, kot so grščina, hebrejščina, ruščina, arabščina ali kitajščina. Obe različici imena se bosta prikazali na seznamih in v diagramih.<br><br>Čeprav je to polje označeno s “hebrejščina”, ni omejeno samo na hebrejske znake.

source: A media object is a record in the family tree which contains information about a media file. This information may include a title, a copyright notice, a transcript, privacy restrictions, etc. The media file, such as the photo or video, can be stored locally (on this webserver) or remotely (on a different webserver).
cy: Mae gwrthrych cyfryngau yn gofnod yn y goeden deulu sy'n cynnwys gwybodaeth am ffeil cyfryngau. Gall y wybodaeth hon gynnwys teitl, hysbysiad hawlfraint, trawsgrifiad, cyfyngiadau preifatrwydd, ac ati. Mae modd storio'r ffeil gyfryngau, fel y llun neu'r fideo, yn lleol (ar y gweinydd gwe hwn) neu'n bell (ar weinydd gwe wahanol).
hy: Մեդիա օբյեկտը տոհմածառի գրառում է, որը պարունակում է տեղեկատվություն մեդիա ֆայլի մասին: Այս տեղեկատվությունը կարող է ներառել վերնագիր, հեղինակային իրավունքի մասին ծանուցում, տառադարձում, գաղտնիության սահմանափակումներ և այլն: Մեդիա ֆայլը, ինչպիսին է լուսանկարը կամ տեսանյութը, կարող է պահվել տեղական (այս վեբսերվերի վրա) կամ հեռակա (այլ վեբսերվերի վրա):
ko: 미디어 개체는 미디어 파일에 대한 정보가 포함 된 가계도의 레코드입니다. 이 정보에는 제목, 저작권 표시, 대화 내용, 개인 정보 제한 등이 포함될 수 있습니다. 사진 또는 비디오와 같은 미디어 파일은 로컬 (이 웹 서버) 또는 원격 (다른 웹 서버)에 저장 될 수 있습니다.
ne: मिडिया वस्तु भनेको पारिवारिक रूखमा रहेको रेकर्ड हो जसमा मिडिया फाइलको बारेमा जानकारी हुन्छ। यस जानकारीमा शीर्षक, प्रतिलिपि अधिकार सूचना, ट्रान्सक्रिप्ट, गोपनीयता प्रतिबन्धहरू, आदि समावेश हुन सक्छ। फोटो वा भिडियो जस्ता मिडिया फाइलहरू स्थानीय रूपमा (यस वेबसर्भरमा) वा टाढाबाट (भिन्न वेबसर्भरमा) भण्डारण गर्न सकिन्छ।
sl: Medijski predmet je zapis v družinskem drevesu, ki vsebuje informacije o medijski datoteki. Te informacije lahko vključujejo naslov, obvestilo o avtorskih pravicah, prepis, omejitve zasebnosti itd. Medijska datoteka, kot je fotografija ali videoposnetek, je lahko shranjena lokalno (na tem spletnem strežniku) ali oddaljeno (na drugem spletnem strežniku).

source: The <b>name</b> field contains the individual’s full name, as they would have spelled it or as it was recorded. This is how it will be displayed on screen. It uses standard genealogy annotations to identify different parts of the name.
cy: Mae'r maes <b>enw</b> yn cynnwys enw llawn yr unigolyn, fel y bydden nhw wedi'i sillafu neu fel y'i cofnodwyd. Dyma sut y bydd yn cael ei ddangos ar y sgrin. Mae'n defnyddio anodiadau hel achau safonol i nodi gwahanol rannau o'r enw.
hy: <b>name</b> դաշտը պարունակում է անհատի լրիվ անունը, ինչպես նրանք կգրեին կամ այնպես, ինչպես գրանցվել է: Այսպես այն կցուցադրվի էկրանին։ Այն օգտագործում է ստանդարտ ծագումնաբանական ծանոթագրություններ անվանման տարբեր մասերը բացահայտելու համար:
ko: <b>이름</b> 필드에는 개인의 전체 이름이 포함되어 있다. 다음과 같이 표시됩니다.그것은 이름의 다른 부분을 식별하기 위해 표준 계보 주석을 사용한다.
ne: <b>नाम</b> फिल्डले व्यक्तिको पूरा नाम समावेश गर्दछ, जसरी उनीहरूले यसलाई हिज्जे गरेको वा रेकर्ड गरिएको थियो। यो कसरी स्क्रिनमा प्रदर्शित हुनेछ। यसले नामको विभिन्न भागहरू पहिचान गर्न मानक वंशावली एनोटेसनहरू प्रयोग गर्दछ।
sl: Polje <b>ime</b> vsebuje polno ime posameznika, kot je uradno zabeleženo. Ime bo tako prikazano tudi na zaslonu. Za določanje različnih delov imena so uporabljene standardne rodoslovne oznake.

source: The surname is enclosed by slashes: <%s>John Paul /Smith/<%s>
cy: Mae'r cyfenw yn cael ei amgylchynu gan slaes: <%s>John Paul /Smith/<%s>
hy: Ազգանունը կցվում է շեղերով՝ <%s>Ջոն Փոլ /Սմիթ/<%s>
ko: 가문이름은 슬래시로 묶습니다. <%s>John Paul /Smith/<%s>
ne: उपनाम स्ल्याशहरूद्वारा संलग्न गरिएको छ: <%s>जोन पल /स्मिथ/<%s>
sl: Priimek je obdan s poševnicami: <%s>Janez Pavel /Kovač/<%s>

source: If the surname is unknown, use empty slashes: <%s>Mary //<%s>
cy: Os nad yw'r cyfenw'n hysbys, defnyddiwch slaes gwag: <%s>Mary //<%s>
hy: Եթե ազգանունն անհայտ է, օգտագործեք դատարկ շեղեր՝ <%s>Մերի //<%s>
ko: 가문이름을 알 수 없는 경우 빈 슬래시를 사용하십시오. <%s>Mary //<%s>
ne: यदि थर अज्ञात छ भने, खाली स्ल्याशहरू प्रयोग गर्नुहोस्: <%s>मेरी //<%s>
sl: Če priimek ni znan, uporabite prazne poševnice: <%s>Marija //<%s>

source: If an individual has two separate surnames, both should be enclosed by slashes: <%s>José Antonio /Gómez/ /Iglesias/<%s>
cy: Os oes gan unigolyn ddau gyfenw ar wahân, dylai'r ddau gael eu hamgáu gan slaes: <%s>José Antonio /Gómez/ /Iglesias/<%s>
hy: Եթե անհատն ունի երկու առանձին ազգանուն, երկուսն էլ պետք է փակվեն շեղերով՝ <%s>Խոսե Անտոնիո /Գոմես/ /Իգլեսիաս/<%s>
ko: 인물이 두 개의 가문이름을 가진 경우 둘 다 슬래시로 묶어야합니다. <%s>José Antonio /Gómez/ /Iglesias/<%s>
ne: यदि एक व्यक्तिको दुई अलग-अलग थर छ भने, दुबै स्ल्यासद्वारा संलग्न हुनुपर्छ: <%s>जोसे एन्टोनियो /गोमेज/ /इग्लेसियस/<%s>
sl: Če ima oseba dva ločena priimka, morata biti oba obdana s poševnicami: <%s>Janez Anton /Novak/ /Horvat/<%s>

source: If an individual does not have a surname, no slashes are needed: <%s>Jón Einarsson<%s>
cy: Os nad oes gan unigolyn gyfenw, nid oes angen slaes: <%s>Jón Einarsson<%s>
hy: Եթե անհատը ազգանուն չունի, ապա կտրվածքի կարիք չկա. <%s>Ջոն Էյնարսոն<%s>
ko: 인물에게 가문이름이 없으면 슬래시가 필요하지 않습니다. <%s> Jon Einarsson <%s>
ne: यदि एक व्यक्तिको उपनाम छैन भने, कुनै स्ल्यास आवश्यक पर्दैन: <%s>Jón Einarsson<%s>
sl: Če oseba nima priimka, poševnice niso potrebne: <%s>Janez France<%s>

source: If an individual was not known by their first given name, the preferred name should be indicated with an asterisk: <%s>John Paul* /Smith/<%s>
cy: Os nad yw unigolyn yn hysbys wrth ei enw cyntaf, dylid nodi'r enw gyda seren: <%s>John Paul* /Smith/<%s>
hy: Եթե անհատը հայտնի չէ իր առաջին անունով, նախընտրելի անունը պետք է նշվի աստղանիշով՝ <%s>Ջոն Փոլ* /Սմիթ/<%s>
ko: 인물이 본명으로 알려지지 않은 경우 선호하는 이름은 별표 (<%s>John Paul* /Smith/<%s>)로 표시해야합니다
ne: यदि कुनै व्यक्तिलाई उसको पहिलो दिइएको नामबाट थाहा थिएन भने, रुचाइएको नाम तारा चिन्हले संकेत गरिनुपर्छ: <%s>John Paul* /Smith/<%s>
sl: Če oseba ni bila znana po prvem imenu, je treba želeno ime označiti z zvezdico: <%s>Janez Pavel* /Kovač/<%s>

source: If an individual was known by a nickname which is not part of their formal name, it should be enclosed by quotation marks. For example, <%s>John &quot;Nobby&quot; /Clark/<%s>.
cy: Os oedd unigolyn yn cael ei adnabod wrth lysenw nad yw'n rhan o'i enw ffurfiol, dylid ei amgáu â dyfynodau. Er enghraifft, <%s> John &quot;Nobby&quot; /Clark/<%s>.
hy: Եթե անհատը հայտնի էր մականունով, որը նրա պաշտոնական անվան մաս չէ, այն պետք է փակցվի չակերտներով: Օրինակ՝ <%s>Ջոն &laquo;Նոբբի&raquo; /Clark/<%s>:
ko: 인물이 정식 이름의 일부가 아닌 별명으로 알려진 경우 따옴표로 묶어야합니다. 예를 들어 <%s> John "Nobby"/Clark/ <%s>입니다.
ne: यदि कुनै व्यक्तिलाई उपनामले चिनिन्छ जुन तिनीहरूको औपचारिक नामको अंश होइन भने, यो उद्धरण चिन्हहरूद्वारा संलग्न हुनुपर्छ। उदाहरणका लागि, <%s> जोन &quot;नोबी&quot; /क्लार्क/<%s>।
sl: Če je bila oseba znana po vzdevku, ki ni del uradnega imena, mora biti vzdevek med narekovaji. Na primer, <%s>Janez &quot;Škilec&quot; /Vidmar/<%s>.

source: When you add, edit, or delete information, the changes are not saved immediately. Instead, they are kept in a “pending” area. These pending changes need to be reviewed by a moderator before they are accepted.
cy: Pan fyddwch chi'n ychwanegu, golygu, neu ddileu gwybodaeth, fydd y newidiadau ddim yn cael eu cadw ar unwaith. Yn lle hynny, mae nhw'n cael eu cadw mewn ardal “cynigion”. Mae angen i'r cymedrolwr adolygu'r cynigion hyn cyn iddyn nhw gael eu derbyn.
hy: Երբ ավելացնում եք, խմբագրում կամ ջնջում եք տեղեկատվություն, փոփոխություններն անմիջապես չեն պահպանվում: Փոխարենը, դրանք պահվում են «սպասող» տարածքում։ Այս սպասվող փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից՝ նախքան դրանք ընդունելը:
ko: 정보를 추가, 편집 또는 삭제할 때 변경 사항이 즉시 저장되지 않습니다. 대신 “보류중인”영역에 유지됩니다. 이러한 보류중인 변경 사항은 중재자가 승인하기 전에 검토해야합니다.
ne: जब तपाइँ जानकारी थप्नुहुन्छ, सम्पादन गर्नुहुन्छ, वा मेटाउनुहुन्छ, परिवर्तनहरू तुरुन्तै सुरक्षित हुँदैनन्। बरु, तिनीहरूलाई "पेन्डिङ" क्षेत्रमा राखिएको छ। यी पेन्डिङ परिवर्तनहरू स्वीकार गर्नु अघि एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ko dodajate, urejate ali brišete podatke, se spremembe ne shranijo takoj. Namesto tega se hranijo v območju “čakajoče”. Te čakajoče spremembe mora pred sprejetjem pregledati moderator.

source: This process allows the site’s owner to ensure that the new information follows the site’s standards and conventions, has proper source attributions, etc.
cy: Mae'r broses hon yn caniatáu i berchennog y wefan sicrhau bod y wybodaeth newydd yn dilyn safonau a chonfensiynau'r wefan, bod ganddi briodoleddau ffynhonnell iawn, ac ati.
hy: Այս գործընթացը թույլ է տալիս կայքի սեփականատիրոջը համոզվել, որ նոր տեղեկատվությունը համապատասխանում է կայքի չափանիշներին և կոնվենցիաներին, ունի աղբյուրների համապատասխան վերագրումներ և այլն:
ko: 이 과정을 통해 사이트 소유자는 새로운 정보가 사이트의 표준 및 규칙을 따르고 적절한 소스 속성 등을 갖도록 할 수 있습니다.
ne: यो प्रक्रियाले साइटको मालिकलाई नयाँ जानकारी साइटको मापदण्ड र सम्मेलनहरू पछ्याउँछ, उचित स्रोत विशेषताहरू, आदि छ भनेर सुनिश्चित गर्न अनुमति दिन्छ।
sl: Ta postopek lastniku spletišča omogoča, da zagotovi, da nove informacije upoštevajo standarde in konvencije spletišča, imajo ustrezne navedbe virov itd.

source: Pending changes are only shown when your account has permission to edit. When you sign out, you will no longer be able to see them. Also, pending changes are only shown on certain pages. For example, they are not shown in lists, reports, or search results.
cy: Dim ond pan fydd gan eich cyfrif ganiatâd i olygu y bydd cynigion newydd yn cael eu dangos. Pan fyddwch chi'n allgofnodi, fyddwch chi ddim yn gallu eu gweld mwyach. Hefyd, dim ond ar rai tudalennau y mae cynigion yn cael eu dangos. Er enghraifft, fyddan nhw ddim yn cael eu dangos mewn rhestrau, adroddiadau na chanlyniadau chwilio.
hy: Սպասող փոփոխությունները ցուցադրվում են միայն այն ժամանակ, երբ ձեր հաշիվը խմբագրելու թույլտվություն ունի: Երբ դուրս գաք, դուք այլևս չեք կարողանա տեսնել դրանք: Բացի այդ, սպասվող փոփոխությունները ցուցադրվում են միայն որոշակի էջերում: Օրինակ, դրանք չեն ցուցադրվում ցուցակներում, հաշվետվություններում կամ որոնման արդյունքներում:
ko: 보류 중인 변경 사항은 계정에 편집 권한이 있을 때만 표시됩니다. 로그아웃하면 더 이상 볼 수 없습니다. 또한 보류 중인 변경 사항은 특정 페이지에만 표시됩니다. 예를 들어 목록, 리포트 또는 검색 결과에 표시되지 않습니다.
ne: विचाराधीन परिवर्तनहरू मात्र देखाइन्छ जब तपाईंको खातालाई सम्पादन गर्ने अनुमति हुन्छ। जब तपाइँ साइन आउट गर्नुहुन्छ, तपाइँ अब उप्रान्त तिनीहरूलाई हेर्न सक्षम हुनुहुने छैन। साथै, विचाराधीन परिवर्तनहरू केही पृष्ठहरूमा मात्र देखाइन्छ। उदाहरणका लागि, तिनीहरू सूची, रिपोर्ट, वा खोज परिणामहरूमा देखाइँदैनन्।
sl: Čakajoče spremembe so prikazane le, če ima vaš račun dovoljenje za urejanje. Ko se odjavite, jih ne boste mogli več videti. Čakajoče spremembe so prikazane le na določenih straneh. Na primer, niso prikazane na seznamih, poročilih ali rezultatih iskanja.

source: Each user account has an option to “automatically accept changes”. When this is enabled, any changes made by that user are saved immediately. Many administrators enable this for their own user account.
cy: Mae gan bob cyfrif defnyddiwr y dewis i “dderbyn newidiadau yn awtomatig”. Pan fydd hyn wedi'i alluogi, mae unrhyw newidiadau a wneir gan y defnyddiwr hwnnw yn cael eu cadw ar unwaith. Mae llawer o weinyddwyr yn galluogi hyn ar gyfer eu cyfrif defnyddiwr eu hunain.
hy: Յուրաքանչյուր օգտվողի հաշիվ ունի «ավտոմատ կերպով ընդունել փոփոխությունները» տարբերակ: Երբ սա միացված է, այդ օգտվողի կողմից կատարված ցանկացած փոփոխություն անմիջապես պահվում է: Շատ ադմինիստրատորներ դա թույլ են տալիս իրենց սեփական օգտատիրոջ հաշվի համար:
ko: 각 사용자 계정에는 "변경 사항을 자동으로 수락"하는 옵션이 있습니다. 이 기능이 활성화되면 해당 사용자가 변경한 사항이 즉시 저장됩니다. 많은 관리자가 자신의 사용자 계정에 대해 이 기능을 활성화합니다.
ne: प्रत्येक प्रयोगकर्ता खातासँग "स्वचालित रूपमा परिवर्तनहरू स्वीकार गर्ने" विकल्प हुन्छ। जब यो सक्षम हुन्छ, त्यो प्रयोगकर्ताद्वारा गरिएका कुनै पनि परिवर्तनहरू तुरुन्तै सुरक्षित हुन्छन्। धेरै प्रशासकहरूले यसलाई आफ्नै प्रयोगकर्ता खाताको लागि सक्षम पार्छन्।
sl: Vsak uporabniški račun ima možnost “samodejnega sprejemanja sprememb”. Ko je ta možnost omogočena, se vse spremembe, ki jih naredi ta uporabnik, takoj shranijo. Mnogi skrbniki omogočijo to možnost za svoj uporabniški račun.

source: Place names should be entered as a comma-separated list, starting with the smallest place and ending with the country. For example, “Westminster, London, England”.
cy: Dylid nodi enwau lleoedd fel rhestr sydd wedi'i gwahanu gan goma, gan ddechrau gyda'r lle lleiaf a gorffen gyda'r wlad. Er enghraifft, “Y Rhath, Caerdydd, Cymru”.
hy: Տեղանունները պետք է մուտքագրվեն որպես ստորակետերով բաժանված ցուցակ՝ սկսած ամենափոքր տեղից և վերջացրած երկրով: Օրինակ՝ «Վեսթմինսթեր, Լոնդոն, Անգլիա»։
ko: 장소 이름은 가장 작은 장소부터 시작하여 국가로 끝나는 쉼표로 구분된 목록으로 입력해야 합니다. 예: "웨스트민스터 런던 영국".
ne: स्थानको नामहरू अल्पविराम-विभाजित सूचीको रूपमा प्रविष्ट गर्नुपर्छ, सबैभन्दा सानो ठाउँबाट सुरु भएर देशमा समाप्त हुन्छ। उदाहरणका लागि, "वेस्टमिन्स्टर, लन्डन, इङ्गल्याण्ड"।
sl: Imena krajev je treba vnesti kot seznam, ločen z vejicami, ki se začne z najmanjšim krajem in konča z državo. Na primer »Kupšinci, Murska Sobota, Slovenija«.
