Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Add styling and scripts to every page.
cy: Ychwanegu steilio a sgriptiau i bob tudalen.
hy: Յուրաքանչյուր էջի վրա ավելացրեք ոճեր և սցենարներ:
ko: 모든 페이지에 스타일과 스크립트를 추가하십시오.
ne: प्रत्येक पृष्ठमा स्टाइल र स्क्रिप्टहरू थप्नुहोस्।
sl: Dodaj oblikovanje in skripte na vsako stran.

source: CSS and JS
cy: CSS a JS
hy: CSS և JS
ne: CSS र JS
sl: CSS in JS

source: Deaths
cy: Marwolaethau
hy: Մահվան դեպքեր | մահացություններ
ko: 사망
ne: मृत्युहरू
sl: Smrti

source: A report of individuals who died in a given time or place.
cy: Adroddiad am unigolion a fu farw mewn amser neu le penodol.
hy: Հաշվետվություն անհատների մասին, ովքեր մահացել են տվյալ պահին կամ վայրում:
ko: 사망시간이나 장소에 관한 인물에 대한 보고서.
ne: तोकिएको समय वा स्थानमा मृत्यु भएका व्यक्तिहरूको रिपोर्ट ।
sl: Poročilo o osebah, ki so umrle v določenem času ali kraju.

source: A chart of an individual’s descendants.
cy: Siart o ddisgynyddion unigolyn.
hy: Անհատի ժառանգների աղյուսակ.
ko: 인물의 후손 차트.
ne: व्यक्तिको वंशजको चार्ट।
sl: Diagram potomcev osebe.

source: Descendants of %s
cy: Disgynyddion %s
hy: %s-ի ժառանգներ
ko: %s의 후손
ne: %s को वंशज
sl: Potomci osebe %s

source: A sidebar showing the descendants of an individual.
cy: Bar ochr yn dangos disgynyddion unigolyn.
hy: Կողային գոտի, որը ցույց է տալիս անհատի հետնորդները:
ko: 인물의 후손을 보여주는 SideBar.
ne: एक व्यक्तिको सन्तान देखाउने साइडबार।
sl: Stranska vrstica, ki prikazuje potomce osebe.

source: A report of an individual’s descendants, in a narrative style.
cy: Adroddiad am ddisgynyddion unigolyn, mewn ddull naratif.
hy: Զեկույց անհատի ժառանգների մասին՝ պատմողական ոճով։
ko: 인물의 후손에 대한 대화체의 보고서.
ne: एक व्यक्तिको सन्तानको रिपोर्ट, कथा शैलीमा।
sl: Poročilo o potomcih osebe, v pripovednem slogu.

source: A report of the information provided by a source.
cy: Adroddiad o'r wybodaeth sy'n cael ei ddarparu gan ffynhonnell.
hy: Տեղեկատվության հաղորդումը աղբյուրի կողմից։
ko: 출처가 제공 한 정보의 보고서.
ne: स्रोतद्वारा दिइएको जानकारीको रिपोर्ट ।
sl: Poročilo o podatkih, pridobljenih pri viru.

source: Family book
cy: Llyfr y teulu
hy: Ընտանեկան գիրք
ko: 패밀리북
ne: पारिवारिक किताब
sl: Družinska knjiga

source: A chart of an individual’s ancestors and descendants, as a family book.
cy: Siart o hynafiaid a disgynyddion unigolyn, fel llyfr y teulu.
hy: Անհատի նախնիների և ժառանգների աղյուսակը՝ որպես ընտանեկան գիրք:
ko: Family Book 모양으로 인물 조상과 후손을 보여주는 차트.
ne: दुई व्यक्तिहरू बीचको सम्बन्ध देखाउने चार्ट।
sl: Diagram, ki prikazuje prednike in potomce osebe, kot družinska knjiga.

source: Family book of %s
cy: Llyfr teulu %s
hy: %s-ի ընտանեկան գիրք
ko: %s의 패밀리북
ne: %s को पारिवारिक किताब
sl: Družinska knjiga osebe %s

source: A report of family members and their details.
cy: Adroddiad am aelodau'r teulu a'u manylion.
hy: Ընտանիքի անդամների հաշվետվությունը և նրանց մանրամասները:
ko: 가족 및 세부 보고서.
ne: पारिवारिक सदस्यको विवरण र उनीहरूको विस्तृत जानकारी ।
sl: Poročilo o družinskih članih in njihovih podrobnostih.

source: A list of families.
cy: Rhestr o deuluoedd.
hy: Ընտանիքների ցանկ.
ko: 가족 목록 입니다.
ne: परिवारहरूको सूचि ।
sl: Seznam družin.

source: Family navigator
cy: Llywiwr teuluoedd
hy: Ընտանեկան նավիգատոր
ko: 패밀리 네비게이터
ne: पारिवारिक नेभिगेटर
sl: Družinski krmar

source: A sidebar showing an individual’s close families and relatives.
cy: Bar ochr yn dangos teuluoedd agos a pherthnasau unigolyn.
hy: Կողային գոտի, որը ցույց է տալիս անհատի մերձավոր ընտանիքներն ու հարազատները:
ko: 인물의 가까운 가족과 친척을 보여주는 SideBar.
ne: एक व्यक्तिको नजिकको परिवार र आफन्तहरू देखाउने साइडबार।
sl: Stranska vrstica, ki prikazuje ožje družinske člane in sorodnike osebe.

source: Favorites
cy: Ffefrynnau
hy: Ֆավորիտներ
ko: 즐겨찾기
ne: मनपर्ने
sl: Priljubljene

source: Display and manage a family tree’s favorite pages.
cy: Dangos a rheoli hoff dudalennau cart achau.
hy: Ցուցադրել և կառավարել տոհմածառի սիրելի էջերը:
ko: 가계도의 즐겨 찾는 페이지를 표시하고 관리합니다.
ne: पारिवारिक वृक्षको मनपर्ने पृष्ठहरू देखाउनुहोस् र व्यवस्थापन गर्नुहोस्।
sl: Prikažite in upravljajte priljubljene strani družinskega drevesa.

source: Family news and site announcements.
cy: Newyddion teuluol a chyhoeddiadau gwefan.
hy: Ընտանեկան նորություններ և կայքի հայտարարություններ.
ko: 가족 뉴스 및 사이트 공지.
ne: पारिवारिक समाचार र साइट घोषणाहरू।
sl: Družinske novice in obvestila.

source: News
cy: Newyddion
hy: Նորություններ
ko: 뉴스
ne: समाचारहरू
sl: Novice

source: Add/edit a journal/news entry
cy: Ychwanegu/golygu cyfnod dyddlyfr/newyddion
hy: Ավելացնել/խմբագրել ամսագիր/նորությունների գրառում
ko: 저널/뉴스 항목 추가/편집
ne: जर्नल/समाचार प्रविष्टि थप्नुहोस्/सम्पादन गर्नुहोस्
sl: Dodaj/uredi dnevnik/novico

source: Statistics
cy: Ystadegau
hy: Վիճակագրություն
ko: 통계
ne: तथ्याङ्क
sl: Statistični podatki

source: The size of the family tree, earliest and latest events, common names, etc.
cy: Maint y cart achau, digwyddiadau cynharaf a diweddaraf, enwau cyffredin, ac ati.
hy: Տոհմածառի չափը, ամենավաղ և վերջին իրադարձությունները, ընդհանուր անունները և այլն:
ko: 가계도의 크기, 가장 빠른 최신 이벤트, 일반적인 이름 등.
ne: पारिवारिक रूखको आकार, प्रारम्भिक र पछिल्लो घटनाहरू, सामान्य नामहरू, आदि।
sl: Velikost družinskega drevesa, najzgodnejši in najnovejši dogodki, splošna imena itd.

source: Fan chart
cy: Siart ffan
hy: Երկրպագուների աղյուսակ
ko: 팬차트
ne: फ्यान चार्ट
sl: Pahljačasti diagram

source: A fan chart of an individual’s ancestors.
cy: Siart ffan o hynafiaid unigolyn.
hy: Անհատի նախնիների երկրպագուների աղյուսակը:
ko: 인물의 조상에 대한 팬 차트.
ne: व्यक्तिको पुर्खाहरूको फ्यान चार्ट।
sl: Pahljačasti diagram prednikov osebe.

source: Fan chart of %s
cy: Siart ffan %s
hy: %s-ի երկրպագուների աղյուսակը
ko: %s의 팬차트
ne: %s को फ्यान चार्ट
sl: Pahljačasti diagram osebe %s

source: half circle
cy: hanner cylch
hy: կես շրջան
sl: Polkrog

source: three-quarter circle
cy: cylch tri chwarter
hy: երեք քառորդ շրջան
sl: Tri četrtine kroga

source: full circle
cy: cylch llawn
hy: ամբողջական շրջան
ne: पूर्ण सर्कल
sl: Polni krog

source: Convert %s tags to GEDCOM 5.5.1
hy: Փոխարկեք %s պիտակները GEDCOM 5.5.1-ի
ne: %s ट्यागहरूलाई GEDCOM 5.5.1 मा रूपान्तरण गर्नुहोस्

source: Replace cemetery tags with burial places.
cy: Amnewid tagiau mynwent gyda mannau claddu.
hy: Փոխարինեք գերեզմանոցի պիտակները թաղման վայրերով:
ko: 묘지 태그를 매장 장소로 변경.
ne: चिहानको ट्यागलाई दफन गर्ने ठाउँहरूसँग बदल्नुहोस्।
sl: Zamenjaj oznake pokopališč z grobnimi mesti.

source: Remove duplicate links
cy: Dileu cysylltiadau dyblyg
hy: Հեռացրեք կրկնօրինակ հղումները
ko: 중복 링크 제거
ne: डुप्लिकेट लिङ्कहरू हटाउनुहोस्
sl: Odstrani podvojene povezave

source: A common error is to have multiple links to the same record, for example listing the same child more than once in a family record.
cy: Gwall cyffredin yw cael sawl cysylltiad i'r un cofnod, er enghraifft rhestru'r un plentyn fwy nag unwaith mewn cofnod teulu.
hy: Ընդհանուր սխալը միևնույն գրառումին մի քանի հղումներ ունենալն է, օրինակ՝ միևնույն երեխային մեկից ավելի անգամ ընտանեկան գրառումներում նշելը:
ko: 일반적인 오류는 같은 레코드에 여러 개의 링크가있는 것입니다 (예 : 가족 레코드에 같은 자녀를 두 번 이상 나열하는 것).
ne: एउटा सामान्य त्रुटि भनेको एउटै रेकर्डमा धेरै लिङ्कहरू हुनु हो, उदाहरणका लागि पारिवारिक रेकर्डमा एउटै बच्चालाई एकभन्दा बढी पटक सूचीबद्ध गर्नु।
sl: Pogosta napaka je več povezav do istega zapisa, na primer večkratna navedba istega otroka v istem zapisu družine.

source: Add missing death records
cy: Ychwanegu cofnodion marwolaeth coll
hy: Ավելացրեք անհայտ կորած մահվան գրառումները
ko: 누락 된 사망 기록 추가
ne: हराएको मृत्यु रेकर्डहरू थप्नुहोस्
sl: Dodaj manjkajoče zapise o smrti

source: You can speed up the privacy calculations by adding a death record to individuals whose death can be inferred from other dates, but who do not have a record of death, burial, cremation, etc.
cy: Gallwch gyflymu'r cyfrifo preifatrwydd trwy ychwanegu cofnod marwolaeth at unigolion y mae modd casglu eu marwolaeth o ddyddiadau eraill, ond nad oes ganddyn nhw gofnod o farwolaeth, claddu, amlosgi, ac ati.
hy: Դուք կարող եք արագացնել գաղտնիության հաշվարկները՝ ավելացնելով մահվան արձանագրություն այն անձանց, որոնց մահը կարելի է եզրակացնել այլ ամսաթվերից, բայց ովքեր չունեն մահվան, հուղարկավորության, դիակիզման և այլնի գրառում:
ko: 다른 날짜로부터 사망을 유추 할 수 있지만 사망, 매장, 화장 등을 기록하지 않은 인물에게 사망 기록을 추가하여 인물 정보 계산 속도를 높일 수 있습니다.
ne: अन्य मितिहरूबाट मृत्युको अनुमान लगाउन सकिने तर मृत्यु, गाड्ने, दाहसंस्कार, इत्यादिको रेकर्ड नभएका व्यक्तिहरूको मृत्यु रेकर्ड थपेर तपाईंले गोपनीयता गणनालाई गति दिन सक्नुहुन्छ।
sl: Izračune zasebnosti dostopa lahko pospešite tako, da osebam, katerih smrt je mogoče sklepati na podlagi drugih datumov, vendar nimajo zapisa o smrti, pokopu, upepelitvi itd., dodate zapis o smrti.

source: Fix name slashes and spaces
cy: Trwsio slaesau a bylchau
hy: Ուղղել անունների շեղերը և բացատները
ko: 이름 슬래시 및 공백 수정
ne: नाम स्ल्याश र खाली ठाउँहरू ठीक गर्नुहोस्
sl: Popravi poševnice in presledke v imenih

source: Correct NAME records of the form “John/DOE/” or “John /DOE”, as produced by older genealogy programs.
cy: Cywiro cofnodion NAME o'r ffurflen “John/DOE/” neu “John/DOE”, fel sy'n cael eu cynhyrchu gan raglenni hel achau hŷn.
hy: «John/DOE/» կամ «John /DOE» ձևի ԱՆՎԱՆՈՒԹՅԱՆ գրառումները, որոնք արտադրվել են ավելի հին ծագումնաբանական ծրագրերի կողմից:
ko: 이전 계보 프로그램에서 생성된 "John/DOE/" 또는 "John /DOE" 형식의 NAME 레코드를 수정합니다.
ne: "John/DOE/" वा "John /DOE" फारमको NAME रेकर्डहरू, पुरानो वंशावली कार्यक्रमहरूद्वारा उत्पादित गरी सही गर्नुहोस्।
sl: Pravilni zapisi NAME v obliki “Janez/NOVAK/” ali “Janez /NOVAK”, kot so jih ustvarili starejši genealoški programi.

source: Some genealogy software stores all names in a single name record, using custom tags such as _MARNM and _AKA. An alternative is to create a new name record for each name.
hy: Որոշ ծագումնաբանական ծրագրեր պահում են բոլոր անունները մեկ անվանման գրառումում՝ օգտագործելով հատուկ պիտակներ, ինչպիսիք են _MARNM և _AKA: Այլընտրանք է յուրաքանչյուր անվան համար ստեղծել նոր անվանական գրառում:
ko: 일부 계보 소프트웨어는 _MARNM 및 _AKA와 같은 사용자 정의 태그를 사용하여 단일 이름 레코드에 모든 이름을 저장합니다. 대안은 각 이름에 대해 새 이름 레코드를 만드는 것입니다.
ne: केही वंशावली सफ्टवेयरले _MARNM र _AKA जस्ता अनुकूलन ट्यागहरू प्रयोग गरेर सबै नामहरू एकल नाम रेकर्डमा भण्डारण गर्दछ। एउटा विकल्प भनेको प्रत्येक नामको लागि नयाँ नाम रेकर्ड बनाउनु हो।

source: Update place names
cy: Diweddaru enwau lleoedd
hy: Թարմացրեք տեղանունները
ko: 장소이름 업데이트
ne: स्थानको नाम अपडेट गर्नुहोस्
sl: Posodobi imena krajev

source: Update the higher-level parts of place names, while keeping the lower-level parts.
cy: Diweddaru'r rhannau lefel uwch o enwau lleoedd, wrth gadw'r rhannau lefel is.
hy: Թարմացրեք տեղանունների ավելի բարձր մակարդակի մասերը՝ պահպանելով ստորին մակարդակի մասերը:
ko: 하위 레벨 부분을 유지하면서 상위 레벨의 장소 이름 부분을 업데이트하십시오.
ne: तल्लो-स्तरका भागहरू राख्दै ठाउँको नामहरूको उच्च-स्तरका भागहरू अद्यावधिक गर्नुहोस्।
sl: Posodobite dele imen krajev višje ravni, pri čemer ohranite dele imen krajev nižje ravni.

source: “Highlighted image” (_PRIM) tags are used by some genealogy applications to indicate the preferred image for an individual. An alternative is to re-order the images so that the preferred one is listed first.
cy: Mae tagiau “delwedd wedi'i hamlygu” (_PRIM) yn cael eu defnyddio gan rai raglenni achyddiaeth i nodi'r hoff ddelwedd ar gyfer unigolyn. Dewis arall yw ad-drefnu'r delweddau fel bod yr un sy'n cael ei ffafrio'n yn cael ei restru gyntaf.
hy: «ընդգծված պատկեր» (_PRIM) թեգերն օգտագործվում են որոշ ծագումնաբանական հավելվածների կողմից՝ անհատի համար նախընտրելի պատկերը նշելու համար: Այլընտրանք է պատկերները վերադասավորելն այնպես, որ նախընտրածը առաջինը նշված լինի:
ko: "강조된 이미지"(_PRIM) 태그는 개인이 선호하는 이미지를 나타내기 위해 일부 계보 응용 프로그램에서 사용됩니다. 대안은 선호하는 이미지가 먼저 나열되도록 이미지를 재정렬하는 것입니다.
ne: "हाइलाइट गरिएको छवि" (_PRIM) ट्यागहरू कुनै व्यक्तिको लागि मनपर्ने छवि संकेत गर्न केही वंशावली अनुप्रयोगहरूद्वारा प्रयोग गरिन्छ। एउटा विकल्प भनेको छविहरूलाई पुन: क्रमबद्ध गर्नु हो ताकि मनपर्नेलाई पहिले सूचीबद्ध गरियोस्।
sl: Oznake “Označena slika” (_PRIM) nekateri rodoslovni programi uporabljajo za označevanje prednostne slike osebe. Druga možnost je, da slike prerazporedite tako, da je prednostna slika navedena prva.

source: Search and replace text, using simple searches or advanced pattern matching.
cy: Chwilio a amnewid testun, gan ddefnyddio chwiliadau syml neu gydweddu patrymau uwch.
hy: Որոնեք և փոխարինեք տեքստը՝ օգտագործելով պարզ որոնումներ կամ առաջադեմ օրինաչափությունների համապատասխանություն:
ko: 간단한검색 또는 고급패턴일치를 사용하여 텍스트를 검색하고 바꿉니다.
ne: सरल खोज वा उन्नत ढाँचा मिलान प्रयोग गरेर पाठ खोज्नुहोस् र बदल्नुहोस्।
sl: Iskanje in zamenjava besedila z uporabo preprostih iskanj ali naprednega ujemanja vzorcev.

source: Match the exact text, even if it occurs in the middle of a word.
cy: Cydweddwch yr union destun, hyd yn oed os yw'n digwydd yng nghanol gair.
hy: Համապատասխանեցրեք ճշգրիտ տեքստը, նույնիսկ եթե այն հայտնվում է բառի մեջտեղում:
ko: 단어 중간에 있더라도 정확한 텍스트를 찾습니다.
ne: ठ्याक्कै पाठ मिलाउनुहोस्, भले पनि यो शब्दको बीचमा हुन्छ।
sl: Ujemanje natančnega besedila, tudi če se pojavi sredi besede.

source: Match the exact text, unless it occurs in the middle of a word.
cy: Cydweddu'r union destun, oni bai ei fod yn digwydd yng nghanol gair.
hy: Համապատասխանեցրեք ճշգրիտ տեքստը, եթե այն չի հայտնվում բառի մեջտեղում:
ko: 단어 중간에 나오지 않는 한 정확한 텍스트를 찾습니다.
ne: ठ्याक्कै पाठ मिलाउनुहोस्, जबसम्म यो शब्दको बीचमा हुँदैन।
sl: Ujemanje natančnega besedila, razen če se pojavi sredi besede.

source: Use a “?” to match a single character, use “*” to match zero or more characters.
cy: Defnyddio “?” i gydweddu â nod sengl, defnyddio “*” i gydweddu â sero neu fwy o nodau.
hy: Օգտագործեք «?» մեկ նիշին համապատասխանելու համար օգտագործեք «*»՝ զրո կամ ավելի նիշերը համապատասխանելու համար:
ko: “?”를 사용하십시오 단일 문자를 일치 시키려면 “*”를 사용하여 0 개 이상의 문자를 일치시킵니다.
ne: प्रयोग गर्नुहोस् "?" एकल क्यारेक्टर मिलाउन, शून्य वा बढी क्यारेक्टरहरू मिलाउन "*" प्रयोग गर्नुहोस्।
sl: Za en sam znak uporabite znak “?”, za nič ali več znakov pa znak “*”.

source: Regular expression
cy: Mynegiad rheolaidd
hy: Կանոնավոր արտահայտություն
ko: 정규식
ne: नियमित अभिव्यक्ति
sl: Regularni izraz

source: Locations
cy: Lleoliadau
hy: Վայրեր
ko: 위치
ne: स्थानहरू
sl: Lokacije

source: Media objects
cy: Gwrthrychau cyfrwng
hy: Մեդիա օբյեկտներ
ko: 미디어 개체
ne: मिडिया वस्तुहरू
sl: Medijski predmeti

source: Notes
cy: Nodiadau
hy: Նշումներ
ko: 노트
ne: टिप्पणी
sl: Opombe

source: Repositories
cy: Storfannau
hy: Պահեստարաններ
ko: 저장소
ne: भण्डारहरू
sl: Skladišča

source: Sources
cy: Ffynonellau
hy: Աղբյուրներ
ko: 출처
ne: स्रोतहरू
sl: Viri

source: Submitters
cy: Cyflwynwyr
hy: Ներկայացնողներ
ko: 제출자
ne: पेस गर्नेहरू
sl: Pošiljatelji

source: _WT_OBJE_SORT tags were used by old versions of webtrees to indicate the preferred image for an individual. An alternative is to re-order the images so that the preferred one is listed first.
hy: _WT_OBJE_SORT թեգերն օգտագործվել են վեբ ծառերի հին տարբերակների կողմից՝ անհատի համար նախընտրելի պատկերը նշելու համար: Այլընտրանք է պատկերները վերադասավորելն այնպես, որ նախընտրածը առաջինը նշված լինի:
ne: _WT_OBJE_SORT ट्यागहरू वेबट्रीहरूको पुरानो संस्करणहरूद्वारा व्यक्तिको मनपर्ने छवि संकेत गर्न प्रयोग गरिएको थियो। एउटा विकल्प भनेको छविहरूलाई पुन: क्रमबद्ध गर्नु हो ताकि मनपर्नेलाई पहिले सूचीबद्ध गरियोस्।

source: FAQ
cy: Cwestiynau Cyffredin
hy: ՀՏՀ
ne: एफएक्यू
sl: Pogosto zastavljena vprašanja

source: A list of frequently asked questions and answers.
cy: Rhestr o gwestiynau ac atebion cyffredin.
hy: Հաճախակի տրվող հարցերի և պատասխանների ցանկ:
ko: 자주 묻는 질문 및 답변 목록.
ne: बारम्बार सोधिने प्रश्न र उत्तरहरूको सूची ।
sl: Seznam pogosto zastavljenih vprašanj in odgovorov.

source: Frequently asked questions
cy: Cwestiynau cyffredin
hy: Հաճախակի տրվող հարցեր
ko: 자주 묻는 질문
ne: लगातार सोधिने प्रश्न
sl: Pogosto zastavljena vprašanja

source: Add an FAQ
cy: Ychwanegu Cwestiynau Cyffredin
hy: Ավելացնել ՀՏՀ
ko: FAQ 추가
ne: FAQ थप्नुहोस्
sl: Dodaj pogosto zastavljeno vprašanje

source: Edit the FAQ
cy: Golygu'r Cwestiynau Cyffredin
hy: Խմբագրել ՀՏՀ-ն
ko: FAQ 수정
ne: FAQ सम्पादन गर्नुहोस्
sl: Uredi pogosto zastavljena vprašanja

source: GeoNames
hy: Աշխարհագրական անուններ
ne: भौगोलिक नाम

source: Search for place names using %s.
hy: Որոնեք տեղանունները՝ օգտագործելով %s:
ko: %s을(를) 사용하여 장소 이름을 검색합니다.
ne: %s प्रयोग गरेर ठाउँको नाम खोज्नुहोस्।

source: Google™ analytics
cy: Dadansoddeg Google™
hy: Google™ վերլուծություն
ne: गुगल एनालिटिक्स
sl: Google™ analitika

source: Google™ maps
hy: Google™ քարտեզներ
ne: गुगल म्याप्स

source: Google™ webmaster tools
cy: Offer gwefeistr Google ™
hy: Google™ վեբ վարպետների գործիքներ
ne: गुगल वेब टुल्स
sl: Google™ skrbniška orodja

source: Here maps
hy: Այստեղ քարտեզներ
ne: Here नक्साहरू

source: Hit counters
cy: Cyfrifo ymweliadau
hy: Հարվածների հաշվիչներ
ne: आगन्तुक गणनाहरू
sl: Števci ogledov

source: Count the visits to each page
cy: Cyfrif yr ymweliadau â phob tudalen
hy: Հաշվեք յուրաքանչյուր էջի այցելությունները
ko: 각 페이지에 대한 방문 수 계산
ne: प्रत्येक पृष्ठमा भ्रमणहरू गणना गर्नुहोस्
sl: Preštej obiske vsake strani

source: This page has been viewed %s time.
cy: Does neb wedi edrych ar y dudalen hon.
hy: Այս էջը դիտվել է %s անգամ:
ko: 이 페이지는 %s번 조회되었습니다.
ne: यो पृष्ठ %s पटक हेरिएको छ।
sl: To stran so si obiskovalci in uporabniki ogledali %s krat.

source: An hourglass chart of an individual’s ancestors and descendants.
cy: Siart awrwydr o hynafiaid a disgynyddion unigolyn.
hy: Անհատի նախնիների և ժառանգների ավազի ժամացույցի աղյուսակը:
ko: 인물의 조상과 후손의 양방향 차트.
ne: एक व्यक्तिको पुर्खा र वंशज को एक घण्टाको चार्ट।
sl: Diagram peščene ure prednikov in potomcev osebe.

source: Hourglass chart of %s
cy: Siart awrwydr %s
hy: %s-ի ավազի ժամացույցի գծապատկեր
ko: %s의 양방향 차트
ne: %s को घडीको घडी चार्ट
sl: Diagram peščene ure osebe %s

source: Add your own text and graphics.
cy: Ychwanegu eich testun a'ch graffeg eich hun.
hy: Ավելացրեք ձեր սեփական տեքստը և գրաֆիկան:
ko: 자신만의 텍스트와 그래픽을 추가하십시오.
ne: तपाईंको आफ्नै कुरा र ग्राफिक्स थप्नुहोस्।
sl: Dodaj lastno besedilo in grafiko.

source: Custom
cy: Cyfaddasu
hy: Պատվերով
ko: 사용자정의
ne: अनुकूल
sl: Po meri

source: Keyword examples
cy: Enghreifftiau o eiriau allweddol
hy: Հիմնաբառերի օրինակներ
ko: 키워드 예제
ne: कीवर्ड उदाहरणहरू
sl: Primeri ključnih besed

source: Narrative description
cy: Disgrifiad naratif
hy: Պատմական նկարագրություն
ko: 이야기체의 설명
ne: कथा विवरण
sl: Pripovedni opis

source: Facts and events
cy: Ffeithiau a digwyddiadau
hy: Փաստեր և իրադարձություններ
ko: 정보 및 이벤트
ne: तथ्य र घटनाहरु
sl: Dejstva in dogodki

source: A tab showing the facts and events of an individual.
cy: Tab yn dangos ffeithiau a digwyddiadau bywyd unigolyn.
hy: Անհատի փաստերն ու իրադարձությունները ցուցադրող ներդիր:
ko: 인물의 정보와 사건을 보여주는 탭.
ne: एक व्यक्तिको नजिकका आफन्तहरू देखाउने ट्याब।
sl: Zavihek, ki prikazuje dejstva in dogodke osebe.

source: Related families
cy: Teuluoedd cysylltiedig
hy: Հարակից ընտանիքներ
ko: 관련 가족
ne: सम्बन्धित परिवारहरू
sl: Družine v sorodstvenem razmerju

source: A report of the families that are closely related to an individual.
cy: Adroddiad am y teuluoedd sydd â chysylltiad agos ag unigolyn.
hy: Անհատի հետ սերտ առնչություն ունեցող ընտանիքների հաշվետվություն:
ko: 인물과 밀접한 관련이있는 가족에 대한 보고서.
ne: एक व्यक्तिसँग नजिकको सम्बन्ध भएका परिवारहरूको रिपोर्ट ।
sl: Poročilo o družinah, ki so tesno povezane z osebo.

source: A list of individuals.
cy: Rhestr o unigolion.
hy: Անհատների ցանկ.
ko: 인물 목록.
ne: व्यक्तिहरूको सूचि ।
sl: Seznam oseb.

source: Extra information
cy: Gwybodaeth ychwanegol
hy: Լրացուցիչ տեղեկություններ
ko: 추가 정보
ne: अतिरिक्त जानकारी
sl: Dodatne informacije

source: A sidebar showing non-genealogy information about an individual.
cy: Bar ochr yn dangos gwybodaeth cyffredinol am unigolyn.
hy: Անհատականի մասին ոչ ծագումնաբանական տեղեկություններ ցուցադրող կողագոտ:
ko: 인물에 대한 비 계보 정보를 보여주는 SideBar.
ne: एक व्यक्तिको बारेमा गैर-वंशावली जानकारी देखाउने साइडबार।
sl: Stranska vrstica, ki prikazuje ne-rodoslovne podatke o osebi.

source: A report of an individual’s details.
cy: Adroddiad am fanylion unigolyn.
hy: Անհատի մանրամասների հաշվետվություն:
ko: 인물의 세부 사항에 대한 보고서.
ne: एक व्यक्तिको विवरणको रिपोर्ट।
sl: Poročilo o podrobnostih osebe.

# unknown family
source: unknown
cy: anhysbys
hy: անհայտ
ko: 알 수 없음
ne: अज्ञात
sl: neznano

source: Son of %s
cy: Mab %s
hy: %s-ի որդին
ko: %s의 아들
ne: %s को छोरा
sl: Sin osebe %s

source: Daughter of %s
cy: Merch %s
hy: %s-ի դուստրը
ko: %s의 딸
ne: %s को छोरी
sl: Hči osebe %s

source: Child of %s
cy: Plentyn %s
hy: %s-ի երեխա
ko: %s의 자녀
ne: %s को सन्तान
sl: Otrok osebe %s

source: An interactive tree, showing all the ancestors and descendants of an individual.
cy: Cart rhyngweithiol, yn dangos holl hynafiaid a disgynyddion unigolyn.
hy: Ինտերակտիվ ծառ, որը ցույց է տալիս անհատի բոլոր նախնիներն ու հետնորդները:
ko: 인물의 모든 조상과 후손을 보여주는 범위형 가계도.
ne: एक व्यक्तिको सम्पूर्ण पूर्वज र सन्ततिहरू देखाइएको पारस्परिक वृक्ष ।
sl: Interaktivno drevo prikazuje prednike in potomce osebe.

source: Lifespans
cy: Hyd bywyd
hy: Կյանքի տևողություններ
ko: 생애
ne: जीवनकाल
sl: Življenjske dobe

source: A chart of individuals’ lifespans.
cy: Siart o hyd bywyd unigolion.
hy: Անհատների կյանքի տևողության աղյուսակ.
ko: 인물의 생애 차트.
ne: व्यक्तिको जीवनकालको चार्ट।
sl: Diagram življenjske dobe oseb.

source: %s individual
cy: %s unigolion
hy: %s անհատ
ko: %s 인물
ne: %s व्यक्ति
sl: %s oseba

source: The lists menu.
cy: Y ddewislen rhestrau.
hy: Ցուցակների մենյու.
ko: 목록 메뉴.
ne: सूची मेनु।
sl: Meni seznamov.

source: A list of locations.
cy: Rhestr o leoliadau.
hy: Վայրերի ցանկ:
ko: 위치 목록.
ne: स्थानहरूको सूचि ।
sl: Seznam lokacij.

source: Who is online
cy: Pwy sydd ar-lein
hy: Ով է առցանց
ko: 온라인 상태 인 사람
ne: को अनलाइन हुनुहुन्छ
sl: Kdo je prijavljen

source: A list of users and visitors who are currently online.
cy: Rhestr o ddefnyddwyr ac ymwelwyr sydd ar-lein ar hyn o bryd.
hy: Օգտատերերի և այցելուների ցուցակ, ովքեր ներկայումս առցանց են:
ko: 현재 온라인 상태 인 사용자 및 방문자 목록.
ne: हाल अनलाइन भएका प्रयोगकर्ता र आगन्तुकहरूको सूची।
sl: Seznam trenutno prijavljenih uporabnikov in obiskovalcev.

source: An alternative way to sign in and sign out.
cy: Ffordd arall o fewngofnodi ac allgofnodi.
hy: Մուտք գործելու և դուրս գալու այլընտրանքային միջոց:
ko: 로그인 로그아웃에 대한 방법.
ne: लगीन र लगआउट गर्ने अर्को तरिका।
sl: Alternativni način prijave in odjave.

source: Sign out
cy: Allgofnodi
hy: Դուրս գալ
ko: 로그아웃
ne: लगआउट
sl: Odjava

source: Mapbox
hy: Քարտեզարկղ
ne: नक्सा बाकस

source: Nominatim
hy: անվանական
ne: नामांकन

source: Marriages
cy: Priodasau
hy: Ամուսնություններ
ko: 결혼
ne: विवाहहरू
sl: Poroke

source: A report of individuals who were married in a given time or place.
cy: Adroddiad am unigolion a oedd yn briod ar adeegau neu lefydd penodol.
hy: Հաշվետվություն անհատների մասին, ովքեր ամուսնացել են տվյալ պահին կամ վայրում:
ko: 결혼한 시간이나 장소에 관한 인물에 대한 보고서.
ne: निश्चित समय वा स्थानमा विवाह गरेका व्यक्तिहरूको रिपोर्ट ।
sl: Poročilo o osebah, ki so se poročile v določenem času ali kraju.

source: Matomo™ / Piwik™ analytics
cy: Dadansoddeg Matomo ™ / Piwik ™
hy: Matomo™ / Piwik™ վերլուծություն
ne: Matomo™ / Piwik™ विश्लेषण
sl: Matomo™ / Piwik™ analitika

source: A list of media objects.
cy: Rhestr o wrthrychau cyfryngau.
hy: Լրատվամիջոցների օբյեկտների ցանկ.
ko: 미디어 개체 목록.
ne: मिडियाहरूको सूचि ।
sl: Seznam medijskih predmetov.

source: A tab showing the media objects linked to an individual.
cy: Tab yn dangos y gwrthrychau cyfryngau sy'n gysylltiedig ag unigolyn.
hy: Ներդիր, որը ցույց է տալիս անհատի հետ կապված մեդիա օբյեկտները:
ko: 인물의 미디어 개체 연결을 보여주는 탭.
ne: एक व्यक्तिसँग लिङ्क गरिएको मिडिया वस्तुहरू देखाउने ट्याब।
sl: Zavihek, ki prikazuje medijske predmete, povezane z osebo.

source: minimal
cy: lleiaf
hy: նվազագույն
sl: Minimalno

source: Missing data
cy: Data coll
hy: Տվյալներ բացակայում են
ko: 누락된 데이터
ne: हराएको डाटा
sl: Manjkajoči podatki
