Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Death of a paternal grandfather
cy: Marwolaeth tad-cu/taid tadol
hy: Հորական պապի մահը
ko: 조부의 사망
ne: हजुरबुवाको मृत्यु
sl: Smrt očetovega očeta

source: Death of a paternal grandmother
cy: Marwolaeth mam-gu/nain tadol
hy: Հորական տատիկի մահ
ko: 조모의 사망
ne: हजुरआमाको मृत्यु
sl: Smrt očetove matere

source: Burial of a paternal grandfather
cy: Claddu tad-cu/taid tadol
hy: Հորական պապի հուղարկավորությունը
ko: 조부의 매장
ne: मावलका हजुरबुवाको अन्त्येष्टि
sl: Pokop očetovega očeta

source: Burial of a paternal grandmother
cy: Claddu mam-gu/nain tadol
hy: Հորական տատի հուղարկավորությունը
ko: 조모의 매장
ne: मावलको हजुरआमाको अन्त्येष्टि
sl: Pokop očetove matere

source: Cremation of a paternal grandfather
cy: Amlosgiad tad-cu/taid tadol
hy: Հորական պապի դիակիզումը
ko: 조부의 화장
ne: हजुरबुवाको दाहसंस्कार
sl: Upepelitev očetovega očeta

source: Cremation of a paternal grandmother
cy: Amlosgiad mam-gu/nain tadol
hy: Հորական տատի դիակիզում
ko: 조모의 화장
ne: हजुरआमाको दाहसंस्कार
sl: Upepelitev očetove matere

source: Marriage of a father
cy: Priodas tad
hy: Հոր ամուսնություն
ko: 아버지의 결혼
ne: बुवाको विवाह
sl: Poroka očeta

source: Marriage of a mother
cy: Priodas mam
hy: Մոր ամուսնություն
ko: 어머니의 결혼
ne: आमाको विवाह
sl: Poroka matere

source: Marriage of a parent
cy: Priodas rhiant
hy: Ծնողի ամուսնությունը
ko: 부모님의 결혼
ne: आमाबाबुको विवाह
sl: Poroka starša

source: Marriage of parents
cy: Priodas rhieni
hy: Ծնողների ամուսնությունը
ko: 부모님의 결혼
ne: आमाबाबुको विवाह
sl: Poroka staršev

source: Death of a husband
cy: Marwolaeth gŵr
hy: Ամուսնու մահ
ko: 남편의 사망
ne: श्रीमानको मृत्यु
sl: Smrt moža

source: Death of a wife
cy: Marwolaeth gwraig
hy: Կնոջ մահ
ko: 부인의 사망
ne: श्रीमतीको मृत्यु
sl: Smrt žene

source: Death of a spouse
cy: Marwolaeth un priod
hy: Ամուսնու մահ
ko: 배우자의 사망
ne: जीवनसाथीको मृत्यु
sl: Smrt partnerja

source: Burial of a husband
cy: Claddu gŵr
hy: Ամուսնու թաղում
ko: 남편의 매장
ne: श्रीमानको दाहसंस्कार
sl: Pokop moža

source: Burial of a wife
cy: Claddu gwraig
hy: Կնոջ թաղումը
ko: 아내의 매장
ne: श्रीमतीको अन्त्येष्ठि
sl: Pokop žene

source: Burial of a spouse
cy: Claddu priod
hy: Ամուսնու թաղումը
ko: 배우자의 매장
ne: पतिको अन्त्येष्ठि
sl: Pokop partnerja

source: Cremation of a husband
cy: Amlosgi gŵr
hy: Ամուսնու դիակիզում
ko: 남편의 화장
ne: श्रीमानको दाहसंस्कार
sl: Upepelitev moža

source: Cremation of a wife
cy: Amlosgi gwraig
hy: Կնոջ դիակիզումը
ko: 부인의 화장
ne: पत्नीको दाहसंस्कार
sl: Upepelitev žene

source: Cremation of a spouse
cy: Amlosgi priod
hy: Ամուսնու դիակիզում
ko: 배우자의 화장
ne: पति/पत्नीको दाहसंस्कार
sl: Upepelitev partnerja

source: To display a map, you need to enable a map-provider in the control panel.
hy: Քարտեզ ցուցադրելու համար հարկավոր է կառավարման վահանակում միացնել քարտեզի մատակարարը:
ne: नक्सा देखाउनको लागि, तपाईंले नियन्त्रण प्यानलमा नक्सा-प्रदायक सक्षम गर्न आवश्यक छ।

source: Enter fullscreen
hy: Մուտք գործեք ամբողջ էկրանով
ne: फुल स्क्रिन बनाउनुहोस्

source: Exit fullscreen
hy: Դուրս գալ լիաէկրանից
ne: फुलस्क्रिनबाट बाहिर निस्कनुहोस्

source: Reload map
cy: Ail-lwytho map
hy: Վերբեռնել քարտեզը
ko: 지도 다시 열기
ne: नक्सा पुन: लोड गर्नुहोस्
sl: Znova naloži zemljevid

source: Zoom in
cy: Chwyddo i fewn
hy: Մեծացնել
ko: 확대
ne: जूम बढाउनुहोस्
sl: Povečaj

source: Zoom out
cy: Chwyddo allan
hy: Մեծացնել
ko: 축소
ne: जूम घटाउनुहोस्
sl: Pomanjšaj

source: webtrees message
cy: neges webtrees
hy: webtrees հաղորդագրություն
ko: webtrees 메세지
ne: webtrees सन्देश
sl: webtrees sporočilo

source: Send a message to all users
cy: Anfon neges at bob defnyddiwr
hy: Ուղարկեք հաղորդագրություն բոլոր օգտվողներին
ko: 모든 사용자에게 메세지 보내기
ne: सबै प्रयोगकर्ताहरूलाई सन्देश पठाउनुहोस्
sl: Pošlji sporočilo vsem uporabnikom

source: Send a message to users who have never signed in
cy: Anfon neges at ddefnyddwyr sydd heb fewngofnodi erioed
hy: Ուղարկեք հաղորդագրություն այն օգտատերերին, ովքեր երբևէ մուտք չեն գործել
ko: 로그인 한 적이 없는 사용자에게 메시지를 보냅니다
ne: कहिल्यै साइन इन नगर्ने प्रयोगकर्ताहरूलाई सन्देश पठाउनुहोस्
sl: Pošlji sporočilo uporabnikom, ki se še nikoli niso prijavili

source: Send a message to users who have not signed in for 6 months
cy: Anfon neges at ddefnyddwyr sydd heb fewngofnodi ers 6 mis
hy: Ուղարկեք հաղորդագրություն այն օգտվողներին, ովքեր մուտք չեն գործել 6 ամիս
ko: 6 개월 동안 로그인하지 않은 사용자에게 메시지 보내기
ne: ६ महिनादेखि साइन इन नभएका प्रयोगकर्ताहरूलाई सन्देश पठाउनुहोस्
sl: Pošlji sporočilo uporabnikom, ki se že šest mesecev niso prijavili

source: Internal messaging
cy: Negeseuon mewnol
hy: Ներքին հաղորդագրություններ
ko: 내부 메시지
ne: आन्तरिक सन्देश
sl: Notranje sporočanje

source: Internal messaging with emails
cy: Negeseuon mewnol gydag e-byst
hy: Ներքին հաղորդագրություններ էլփոստով
ko: 이메일을 통한 내부 메시지
ne: इमेलहरूको साथ आन्तरिक सन्देश
sl: Notranje sporočanje z e-pošto

source: webtrees sends emails with no storage
cy: mae webtrees yn anfon e-byst heb unrhyw storfan
hy: webtrees-ը նամակներ է ուղարկում առանց պահեստավորման
ko: webtrees는 저장 공간 없이 이메일을 보냅니다
ne: webtrees कुनै भण्डारण बिना इमेल पठाउँछ
sl: webtrees pošilja e-pošto brez shranjevanja

source: Mailto link
cy: Dolen mailto
hy: Mailto հղում
ko: 메일 링크
ne: मेल पठाउने लिङ्क
sl: Povezava mailto

source: No contact
cy: Dim cysylltiad
hy: Կապ չկա
ko: 연락처 없음
ne: सम्पर्क छैन
sl: Brez sporočanja

source: himself
cy: ei hun
hy: ինքն իրեն
ko: 그 자신
sl: on sam

source: herself
cy: ei hun
hy: ինքն իրեն
ko: 그녀 자신
sl: ona sama

source: themself
cy: eu hunain
hy: իրենք իրենց
ko: 자신
sl: oni sami

source: self
cy: hunan
hy: ինքն իրեն
ko: 본인
ne: स्वयं
sl: sam/a

source: parent
cy: rhiant
hy: ծնող
ko: 부모님
ne: अभिभावक
sl: starš

source: ex-husband
cy: cyn-ŵr
hy: նախկին ամուսին
ko: 전 남편
ne: पहिलेको श्रीमान्
sl: bivši mož

source: fiancé
cy: dyweddi
hy: փեսացու
ko: 약혼자
ne: मंगेतर
sl: zaročenec

# MALE
source: partner
hy: գործընկեր
ko: 파트너
ne: साथी

source: ex-wife
cy: cyn-wraig
hy: նախկին կինը
ko: 전 부인
ne: पहिलेकी श्रीमती
sl: bivša žena

source: fiancée
cy: dyweddi
hy: հարսնացու
ko: 약혼자
ne: मंगेतर
sl: zaročenka

# FEMALE
source: partner
hy: գործընկեր
ko: 파트너
ne: साथी
sl: partnerka

source: ex-spouse
cy: cyn-briod
hy: նախկին ամուսին
ko: 전 배우자
ne: पहिलेको पति/पत्नी
sl: bivši zakonec

source: fiancé(e)
cy: dyweddi
hy: փեսացու (ե)
ko: 약혼자
ne: मंगेतर (ई)
sl: zaročenec/zaročenka

source: partner
hy: գործընկեր
ko: 파트너
ne: साथी

source: son
cy: mab
hy: որդի
ko: 아들
ne: छोरा
sl: Sin

source: daughter
cy: merch
hy: դուստրը
ko: 딸
ne: छोरी
sl: hči

source: twin brother
cy: efaill
hy: երկվորյակ եղբայր
ko: 쌍둥이 남자형제
sl: dvojček

source: younger brother
cy: brawd iau
hy: կրտսեր եղբայրը
ko: 손아래 남자형제
ne: भाइ
sl: mlajši brat

source: elder brother
cy: brawd hŷn
hy: ավագ եղբայր
ko: 손윗남자형제
ne: दाजु
sl: starejši brat

source: brother
cy: brawd
hy: եղբայր
ko: 남자형제
ne: भाइ
sl: brat

source: twin sister
cy: chwaer efaill
hy: երկվորյակ քույր
ko: 쌍둥이 자매
sl: dvojčica

source: younger sister
cy: chwaer iau
hy: կրտսեր քույրը
ko: 손아래 여자형제
ne: बहिनी
sl: mlajša sestra

source: elder sister
cy: chwaer hŷn
hy: ավագ քույր
ko: 손윗여자형제
ne: दिदी
sl: starejša sestra

source: sister
cy: chwaer
hy: քույր
ko: 자매
ne: बहि
sl: sestra

source: twin sibling
cy: brawd neu chwaer efaill
hy: երկվորյակ քույր կամ եղբայր
ko: 쌍둥이 남매
sl: dvojček/dvojčica

source: younger sibling
cy: brawd neu chwaer iau
hy: կրտսեր քույր ու եղբայր
ko: 손아래 형제자매
ne: भाइबहिनी
sl: mlajši brat/sestra

source: elder sibling
cy: brawd neu chwaer hŷn
hy: ավագ քույր կամ եղբայր
ko: 손윗 형제자매
ne: दाजु
sl: starejši brat/sestra

source: sibling
cy: brawd neu chwaer
hy: քույր ու եղբայր
ko: 형제자매
sl: brat/sestra

# brother’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 질(姪)/질녀(姪女)
sl: nečak/nečakinja

# brother’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 질녀(姪女)
sl: nečakinja

# brother’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 조카-질(姪)
sl: nečak

# brother’s wife
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 형수(兄嫂)/제수(弟嫂)
sl: svakinja

# child’s child
source: grandchild
cy: wŷr/wyres
hy: թոռնիկ
ko: 손주,외손주
ne: नातिनातिना
sl: vnuk/vnukinja

# child’s daughter
source: granddaughter
cy: wyres
hy: թոռնուհին
ko: 손녀/외손녀
ne: नातिनी
sl: vnukinja

# child’s husband
source: son-in-law
cy: mab yng nghyfraith
hy: փեսա
ko: 사위-여서(女壻)
sl: zet

# child’s son
source: grandson
cy: ŵyr
hy: թոռնիկ
ko: 손자/외손자
ne: नाति
sl: vnuk

# child’s spouse
source: son/daughter-in-law
cy: mab/merch-yng-nghyfraith
hy: փեսա/հարս
ko: 사돈(査頓)
sl: zet/snaha

# child’s wife
source: daughter-in-law
cy: merch-yng-nghyfraith
hy: հարս
ko: 며느리-자부(子婦)
ne: बुहारी
sl: snaha

# daughter’s child
source: grandchild
cy: wŷr/wyres
hy: թոռնիկ
ko: 외손주
ne: नातिनातिना
sl: vnuk/vnukinja

# daughter’s daughter
source: granddaughter
cy: wyres
hy: թոռնուհին
ko: 외손녀
ne: नातिनी
sl: vnukinja

# daughter’s husband
source: son-in-law
cy: mab yng nghyfraith
hy: փեսա
ko: 사위-여서(女壻)
sl: zet

# daughter’s son
source: grandson
cy: ŵyr
hy: թոռնիկ
ko: 외손녀
ne: नाति
sl: vnuk

# father’s brother
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 백숙부/숙부
sl: stric

# father’s child
source: half-sibling
cy: hanner brawd neu chwaer
hy: կես եղբայր
ko: 이부형제자매
sl: polbrat/polsestra

# father’s daughter
source: half-sister
cy: hanner chwaer
hy: խորթ քույր
ko: 이복자매
sl: polsestra

# father’s father
source: paternal grandfather
cy: tad-cu/taid tadol
hy: հորական պապ
ko: 조부
ne: हजुरबुवा
sl: očetov oče

# father’s mother
source: paternal grandmother
cy: mam-gu/nain tadol
hy: հորական տատիկ
ko: 조모
ne: हजुरआमा
sl: očetova mati

# father’s parent
source: paternal grandparent
cy: tad-cu/taid a mam-gu/taid tadol
hy: հորական տատիկ-պապիկ
ko: 조부모
ne: बुवा हजुरआमा
sl: očetov starš

# father’s sibling
source: aunt/uncle
cy: modryb/ewythr
hy: մորաքույր / հորեղբայր
ko: 고모/숙부
ne: काका/ठूलोबुवा
sl: teta/stric

# father’s sister
source: aunt
cy: modryb
hy: մորաքույր
ko: 고모
ne: फुपु
sl: teta

# father’s son
source: half-brother
cy: hanner brawd
hy: խորթ եղբայր
ko: 이복형제
sl: polbrat

# father’s wife
source: step-mother
cy: llys-fam
hy: խորթ մայր
ne: सौतेनी आमा
sl: mačeha

# husband’s brother
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 시숙(媤叔)
ne: जेठाजु/देवर
sl: svak

# husband’s child
source: step-child
cy: llys-blentyn
hy: խորթ երեխա
sl: pastorek/pastorka

# husband’s daughter
source: step-daughter
cy: llys-ferch
hy: խորթ դուստր
sl: pastorka

# husband’s father
source: father-in-law
cy: tad-yng-nghyfraith
hy: սկեսրայր
ko: 시아버지-시부(媤父)
ne: ससुरा
sl: tast

# husband’s mother
source: mother-in-law
cy: mam yng nghyfraith
hy: սկեսուր
ko: 시어머니-시모(媤母)
sl: tašča

# husband’s sibling
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 시숙(媤叔)/시매(媤妹)
ne: जेठाजु/देवर
sl: svak/svakinja

# husband’s sister
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 시누이
sl: svakinja

# husband’s son
source: step-son
cy: llys-fab
hy: խորթ որդի
sl: pastorek

# mother’s brother
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 외숙부
sl: stric

# mother’s child
source: half-sibling
cy: hanner brawd neu chwaer
hy: կես եղբայր
ko: 이부형제자매
sl: polbrat/polsestra

# mother’s daughter
source: half-sister
cy: hanner chwaer
hy: խորթ քույր
ko: 이부자매
sl: polsestra

# mother’s father
source: maternal grandfather
cy: taid mamol
hy: մորական պապ
ko: 외조부
sl: materin oče

# mother’s husband
source: step-father
cy: llys-tad
hy: խորթ հայր
ne: सौतेला बाबु
sl: očim

# mother’s mother
source: maternal grandmother
cy: mam-gu/nain mamol
hy: մայրական տատիկ
ko: 외조모
sl: materina mati

# mother’s parent
source: maternal grandparent
cy: tad-cu/taid neu fam-gu/nain mamol
hy: մորական պապիկ
ko: 외조부모
sl: materin starš

# mother’s sibling
source: aunt/uncle
cy: modryb/ewythr
hy: մորաքույր / հորեղբայր
ko: 이모/외숙
ne: मामा
sl: teta/stric

# mother’s sister
source: aunt
cy: modryb
hy: մորաքույր
ko: 이모
ne: सानीमा
sl: teta

# mother’s son
source: half-brother
cy: hanner brawd
hy: խորթ եղբայր
ko: 이부형제
sl: polbrat

# parent’s brother
source: uncle
cy: ewythr
hy: հորեղբայր
ko: 백숙부/숙부/외숙부
sl: stric

# parent’s child
source: half-sibling
cy: hanner brawd neu chwaer
hy: կես եղբայր
ko: 이복/이부 형제자매
sl: polbrat/polsestra

# parent’s daughter
source: half-sister
cy: hanner chwaer
hy: խորթ քույր
ko: 이복/이부 자매
sl: polsestra

# parent’s father
source: grandfather
cy: tad-cu/taid
hy: պապիկ
ko: 조부/외조부
ne: हजुरबुवा
sl: dedek

# parent’s mother
source: grandmother
cy: mam-gu/nain
hy: տատիկ
ko: 조모/외조모
ne: हजुरआमा
sl: babica

# parent’s parent
source: grandparent
cy: tad-cu/taid neu fam-gu/nain
hy: տատիկ ու պապիկ
ko: 조부모/외조부모
ne: हजुरबुवा/आमा
sl: stari starš

# parent’s sibling
source: aunt/uncle
cy: modryb/ewythr
hy: մորաքույր / հորեղբայր
ko: 고모/숙부/이모/외숙
ne: काका/ठूलोबुवा
sl: teta/stric

# parent’s sister
source: aunt
cy: modryb
hy: մորաքույր
ko: 고모(이모)
ne: फुपु
sl: teta

# parent’s son
source: half-brother
cy: hanner brawd
hy: խորթ եղբայր
ko: 이복형제/이부형제
sl: polbrat

# parent’s spouse
source: step-parent
cy: llys-riant
hy: խորթ ծնող
ne: सौतेनी अभिभावक
sl: očim/mačeha

# sibling’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 질(姪)/질녀(姪女)/생질(甥姪)/생질녀(甥姪女)
sl: nečak/nečakinja

# sibling’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 질녀(姪女)/생질녀(甥姪女)
sl: nečakinja

# sibling’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 조카-질/생질
sl: nečak

# sibling’s spouse
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 형수(兄嫂)/제수(弟嫂)/매부(姊夫)/올케/형부(兄夫)/제부(弟夫)
ne: जेठानी/देउरानी
sl: svak/svakinja

# sister’s child
source: nephew/niece
cy: nai/nith
hy: զարմիկ / զարմուհի
ko: 생질(甥姪)/생질녀(甥姪女)
sl: nečak/nečakinja

# sister’s daughter
source: niece
cy: nith
hy: զարմուհին
ko: 조카-생질녀(甥姪女)
sl: nečakinja

# sister’s husband
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 매부(妹夫)
ne: ज्वाइँ
sl: svak

# sister’s son
source: nephew
cy: nai
hy: եղբորորդին
ko: 조카-생질(甥姪)
sl: nečak

# son’s child
source: grandchild
cy: wŷr/wyres
hy: թոռնիկ
ko: 손주
ne: नातिनातिना
sl: vnuk/vnukinja

# son’s daughter
source: granddaughter
cy: wyres
hy: թոռնուհին
ko: 손녀
ne: नातिनी
sl: vnukinja

# son’s son
source: grandson
cy: ŵyr
hy: թոռնիկ
ko: 손자
ne: नाति
sl: vnuk

# son’s wife
source: daughter-in-law
cy: merch-yng-nghyfraith
hy: հարս
ko: 며느리-자부(子婦)
ne: बुहारी
sl: snaha

# spouse’s brother
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 시숙(媤叔)/처남(妻男)
ne: भाइ
sl: svak

# spouse’s child
source: step-child
cy: llys-blentyn
hy: խնամին
sl: pastorek/pastorka

# spouse’s daughter
source: step-daughter
cy: llys-ferch
hy: խորթ դուստր
sl: pastorka

# spouse’s father
source: father-in-law
cy: tad-yng-nghyfraith
hy: սկեսրայր
ko: 시부( 媤父)/장인(丈人)
ne: ससुरा
sl: tast

# spouse’s mother
source: mother-in-law
cy: mam yng nghyfraith
hy: սկեսուր
ko: 시모(媤母)/丈母(장모)
sl: tašča

# spouse’s sister
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 시누이/처형/처제
sl: svakinja

# spouse’s son
source: step-son
cy: llys-fab
hy: խորթ որդի
sl: pastorek

# spouse’s parent
source: mother/father-in-law
cy: mam/tad-yng-nghyfraith
hy: մայր/սկեսուր
ko: 시부모( 媤父母)/장인(丈人)/장모(丈母)
sl: tašča/tast

# spouse’s sibling
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 매제/매형/처형/처제/시숙/시매/올케
ne: सालो/जेठान
sl: svak/svakinja

# wife’s brother
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 처남(妻男)
ne: सालो
sl: svak

# wife’s child
source: step-child
cy: llys-blentyn
hy: խորթ երեխա
sl: pastorek/pastorka

# wife’s daughter
source: step-daughter
cy: llys-ferch
hy: խորթ դուստր
sl: pastorka

# wife’s father
source: father-in-law
cy: tad-yng-nghyfraith
hy: սկեսրայր
ko: 장인(丈人)
ne: ससुरा
sl: tast

# wife’s mother
source: mother-in-law
cy: mam yng nghyfraith
hy: սկեսուր
ko: 장모(丈母)
sl: tašča

# wife’s sibling
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 사돈(査頓)
ne: सालो/जेठान
sl: svak/svakinja

# wife’s sister
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 처형/처제
sl: svakinja

# wife’s son
source: step-son
cy: llys-fab
hy: խորթ որդի
sl: pastorek

# (a man’s) brother’s child’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a woman’s) brother’s child’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a man’s) brother’s child’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# (a woman’s) brother’s child’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# (a man’s) brother’s child’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# (a woman’s) brother’s child’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# (a man’s) brother’s daughter’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a woman’s) brother’s daughter’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a man’s) brother’s daughter’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# (a woman’s) brother’s daughter’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# brother’s daughter’s husband
source: nephew-in-law
cy: nai yng nghyfraith
hy: զարմիկ
ko: 조카사위-질서(姪壻)
sl: nečakinjin mož

# (a man’s) brother’s daughter’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# (a woman’s) brother’s daughter’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# (a man’s) brother’s son’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a woman’s) brother’s son’s child
source: great-nephew/niece
cy: gornai/gornith
hy: մեծ-եղբորորդին / զարմուհին
ko: 종손(從孫)
sl: pranečak/pranečakinja

# (a man’s) brother’s son’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# (a woman’s) brother’s son’s daughter
source: great-niece
cy: gornith
hy: մեծ զարմուհին
ko: 종손녀(從孫女)
sl: pranečakinja

# (a man’s) brother’s son’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# (a woman’s) brother’s son’s son
source: great-nephew
cy: gornai
hy: մեծ եղբորորդին
ko: 종손자(從孫子)
sl: pranečak

# brother’s son’s wife
source: niece-in-law
cy: nith yng nghyfraith
hy: զարմուհին
ko: 조카며느리-질부(姪婦)
sl: nečakova žena

# brother’s wife’s brother
source: brother-in-law
cy: brawd yng nghyfraith
hy: խնամին
ko: 사돈(査頓)총각
ne: भाइ
sl: svak

# brother’s wife’s sibling
source: brother/sister-in-law
cy: brawd/chwaer yng nghyfraith
hy: եղբայր/քույր
ko: 사돈(査頓)
ne: भाइ
sl: svak/svakinja

# brother’s wife’s sister
source: sister-in-law
cy: chwaer yng nghyfraith
hy: քույրը
ko: 사돈(査頓) 처녀
sl: svakinja

# child’s child’s child
source: great-grandchild
cy: gorwyres
hy: ծոռ
ko: 증손/외증손/진외증손/외외증손
sl: pravnuk/pravnukinja

# child’s child’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 증손녀/진외증손녀/외증손녀/외외증손녀
sl: pravnukinja

# child’s child’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 증손자/진외증손자/외증손자/외외증손자
sl: pravnuk

# child’s daughter’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 진외증손/외외증손
sl: pravnuk/pravnukinja

# child’s daughter’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 진외증손녀/외외증손녀
sl: pravnukinja

# child’s daughter’s husband
source: granddaughter’s husband
cy: gŵr y gorwyres
hy: թոռնուհու ամուսինը
ko: -손녀사위-손서(孫壻)/외손서(外(孫壻)
ne: नातिनीको श्रीमान्
sl: vnukinjin mož

# child’s daughter’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 진외증손자/외외증손자
sl: pravnuk

# child’s son’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 증손자/증손녀
sl: pravnuk/pravnukinja

# child’s son’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 증손녀/외증손녀
sl: pravnukinja

# child’s son’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 증손자/외증손자
sl: pravnuk

# child’s son’s wife
source: grandson’s wife
cy: gwraig yr ŵyr
hy: թոռան կինը
ko: 손자며느리-손부(孫婦)/외손부(外孫婦)
ne: नातिनी बुहारी
sl: vnukova žena

# daughter’s child’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 외증손/외외증손
sl: pravnuk/pravnukinja

# daughter’s child’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 외증손녀/외외증손녀
sl: pravnukinja

# daughter’s child’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 외증손자/외외증손자
sl: pravnuk

# daughter’s daughter’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 외외증손
sl: pravnuk/pravnukinja

# daughter’s daughter’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 외외증손녀
sl: pravnukinja

# daughter’s daughter’s husband
source: granddaughter’s husband
cy: gŵr y gorwyres
hy: թոռնուհու ամուսինը
ko: 외손녀
ne: नातिनीको श्रीमान्
sl: vnukinjin mož

# daughter’s daughter’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 외외증손자
sl: pravnuk

# daughter’s husband’s father
source: son-in-law’s father
cy: tad mab-yng-nghyfraith
hy: փեսայի հայրը
ko: 바깥 사돈(査頓)
sl: zetov oče

# daughter’s husband’s mother
source: son-in-law’s mother
cy: mam y mab-yng-nghyfraith
hy: փեսայի մայրը
ko: 안 사돈(査頓)
sl: zetova mati

# daughter’s husband’s parent
source: son-in-law’s parent
cy: rhiant y mab-yng-nghyfraith
hy: փեսայի ծնողը
ko: 사돈(査頓)
sl: zetov starš

# daughter’s son’s child
source: great-grandchild
cy: gorwyr/gorwyres
hy: ծոռ
ko: 외증손
sl: pravnuk/pravnukinja

# daughter’s son’s daughter
source: great-granddaughter
cy: gorwyres
hy: ծոռնուհին
ko: 외증손녀
sl: pravnukinja

# daughter’s son’s son
source: great-grandson
cy: gorwyr
hy: ծոռ
ko: 외증손자
sl: pravnuk

# daughter’s son’s wife
source: grandson’s wife
cy: gwraig yr ŵyr
hy: թոռան կինը
ko: 외손자며느리-외손부(外孫婦)
ne: नातिनी बुहारी
sl: vnukova žena

# father’s brother’s child
source: first cousin
cy: cefnder/cyfnither cyntaf
hy: առաջին զարմիկ
ko: 종형제자매(사촌)
ne: पहिलो कजिन
sl: bratranec/sestrična

# father’s brother’s daughter
source: first cousin
cy: cyfnither gyntaf
hy: առաջին զարմիկ
ko: 종자매(사촌)
ne: पहिलो कजिन
sl: sestrična

# father’s brother’s son
source: first cousin
cy: cefnder cyntaf
hy: առաջին զարմիկ
ko: 종형제(사촌)
ne: पहिलो कजिन
sl: bratranec

# father’s brother’s wife
source: aunt
cy: modryb
hy: մորաքույր
ko: 숙모
ne: काकी
sl: teta

# father’s father’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 종조부(從祖父)
sl: prastric

# father’s father’s father
source: great-grandfather
cy: hen dad-cu
hy: նախապապ
ko: 증조부
sl: pradedek

# father’s father’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 증조모
sl: prababica

# father’s father’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 증조부모
sl: pradedek/prababica

# father’s father’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 종조부/대고모
sl: prastric/prateta

# father’s father’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 대고모
sl: prateta

# father’s mother’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 진외종조부
sl: prastric

# father’s mother’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 진외증조부
sl: pradedek

# father’s mother’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 진외증조모
sl: prababica

# father’s mother’s parent
source: great-grandparent
cy: hendaid neu hennain
hy: մեծ պապիկ
ko: 진외증조부모
sl: pradedek/prababica

# father’s mother’s sibling
source: great-aunt/uncle
cy: henfodryb/henewythr
hy: մեծ մորաքույր/հորեղբայր
ko: 진외종조부/진외존이모
sl: prastric/prateta

# father’s mother’s sister
source: great-aunt
cy: henfodryb
hy: մեծ մորաքույր
ko: 진외존이모
sl: prateta

# father’s parent’s brother
source: great-uncle
cy: henewythr
hy: մեծ հորեղբայր
ko: 종조부/진외종조부
sl: prastric

# father’s parent’s father
source: great-grandfather
cy: hendaid
hy: նախապապ
ko: 증조부/진외증조부
sl: pradedek

# father’s parent’s mother
source: great-grandmother
cy: hennain
hy: մեծ տատիկ
ko: 증조모/진외증조모
sl: prababica
