Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Unzip %s to a temporary folder…
cy: Dadsipio %s i ffolder dros dro…
hy: Ապափակել %s-ը ժամանակավոր պանակ…
ko: 임시 폴더에 %s의 압축을 풉니다…
ne: %s लाई अस्थायी फोल्डरमा अनजिप गर्नुहोस्…
sl: Razširi %s v začasno mapo …

source: Copy files…
cy: Copïo ffeiliau…
hy: Պատճենել ֆայլերը…
ko: 파일 복사…
ne: फाइलहरू प्रतिलिपि गर्नुहोस्…
sl: Kopiraj datoteke …

source: No upgrade information is available.
cy: Dim gwybodaeth uwchraddio ar gael.
hy: Թարմացման մասին տեղեկություններ չկան:
ko: 업그레이드 정보가 없습니다.
ne: कुनै अपग्रेड जानकारी उपलब्ध छैन।
sl: Informacije o nadgradnji niso na voljo.

source: This is the latest version of webtrees. No upgrade is available.
cy: Dyma'r fersiwn ddiweddaraf o webtrees. Nid oes uwchraddiad ar gael.
hy: Սա webtrees-ի վերջին տարբերակն է: Թարմացում չկա:
ko: 이것은 최신 버전의 webtrees입니다. 사용 가능한 업그레이드가 없습니다.
ne: यो webtrees को नवीनतम संस्करण हो। कुनै अपग्रेड उपलब्ध छैन।
sl: To je najnovejša različica webtrees. Na voljo ni nobene posodobitve.

source: The folder %s has been created.
cy: Mae'r ffolder %s wedi'i greu.
hy: %s պանակը ստեղծվել է։
ko: 폴더 %s이(가) 생성되었습니다.
ne: फोल्डर %s सिर्जना गरिएको छ।
sl: Mapa “%s” je ustvarjena.

source: You should accept or reject all pending changes before upgrading.
cy: Dylech dderbyn neu wrthod pob newid arfaethedig cyn uwchraddio.
hy: Նախքան արդիականացումը պետք է ընդունեք կամ մերժեք բոլոր առկախ փոփոխությունները:
ko: 업그레이드하기 전에 보류중인 모든 변경 사항을 수락하거나 거부해야합니다.
ne: तपाईंले अपग्रेड गर्नु अघि सबै पेन्डिङ परिवर्तनहरू स्वीकार वा अस्वीकार गर्नुपर्छ।
sl: Pred nadgradnjo morate sprejeti ali zavrniti vse čakajoče spremembe.

source: There are no pending changes.
cy: Gwirio am gynigion newydd...
hy: Սպասվող փոփոխություններ չկան:
ko: 보류중인 변경 사항이 없습니다.
ne: त्यहाँ कुनै पनि विचाराधीन परिवर्तनहरू छैनन्।
sl: Ni čakajočih sprememb.

source: %1$s KB were downloaded in %2$s seconds.
cy: Llwythwyd %1$s KB i lawr mewn %2$s eiliad.
hy: %1$s ԿԲ ներբեռնվեց %2$s վայրկյանում:
ko: %1$s KB 를 다운로드 하는데 %2$s 초 걸렸습니다.
ne: %1$s KB %2$s सेकेन्डमा डाउनलोड गरियो।
sl: %1$s kB shranjenih v času %2$s sekund.

source: %1$s file was extracted in %2$s seconds.
cy: Tynnwyd %1$s ffeiliau mewn %2$s eiliad.
hy: %1$s ֆայլը հանվել է %2$s վայրկյանում:
ko: %1$s 파일들이 %2$s 초 안에 압축이 풀렸습니다.
ne: %1$s फाइल %2$s सेकेन्डमा निकालियो।
sl: %1$s datoteka razširjena v času %2$s sekund.

source: The upgrade is complete.
cy: Mae'r uwchraddiad wedi'i gwblhau.
hy: Թարմացումն ավարտված է:
ko: 업그레이드가 완료되었습니다.
ne: अपग्रेड पूरा भयो।
sl: Nadgradnja je dokončana.

source: continue
cy: parhau
hy: շարունակել
ko: 계속
ne: जारी राख्नुहोस्
sl: Nadaljuj

source: Filenames are not allowed to contain the character “%s”.
cy: Nid oes caniatâd i enwau ffeiliau gynnwys y nod “%s”.
hy: Ֆայլերի անունները չեն թույլատրվում պարունակել «%s» նիշը:
ko: 파일 이름에는 "%s" 문자를 사용할 수 없습니다.
ne: फाइलनामहरूलाई "%s" क्यारेक्टर समावेश गर्न अनुमति छैन।
sl: Imena datotek ne smejo vsebovati znaka “%s”.

source: Filenames are not allowed to have the extension “%s”.
cy: Nid oes caniatâd i enwau ffeiliau gael yr estyniad “%s”.
hy: Ֆայլերի անուններին չի թույլատրվում ունենալ «%s» ընդլայնում:
ko: 파일 이름에는 "%s" 확장자를 사용할 수 없습니다.
ne: फाइलनामहरूलाई "%s" विस्तार गर्न अनुमति छैन।
sl: Imena datotek ne smejo imeti končnice “%s”.

source: The file %s already exists. Use another filename.
cy: Mae'r ffeil %s yn bodoli eisoes. Defnyddiwch enw ffeil arall.
hy: %s ֆայլն արդեն գոյություն ունի: Օգտագործեք մեկ այլ ֆայլի անուն:
ko: 파일 %s이(가) 이미 존재합니다. 다른 파일 이름을 사용하십시오.
ne: फाइल %s पहिले नै अवस्थित छ। अर्को फाइल नाम प्रयोग गर्नुहोस्।
sl: Datoteka %s že obstaja. Uporabite drugo ime datoteke.

source: The file %s has been uploaded.
cy: Mae'r ffeil %s wedi'i llwytho.
hy: %s ֆայլը վերբեռնվել է:
ko: %s 파일이 업로드되었습니다.
ne: फाइल %s अपलोड गरिएको छ।
sl: Datoteka “%s” je naložena.

source: Upload media files
cy: Llwythwch ffeiliau cyfryngau i fyny
hy: Վերբեռնեք մեդիա ֆայլեր
ko: 미디어 파일 업로드
ne: मिडिया फाइलहरू अपलोड गर्नुहोस्
sl: Nalaganje medijskih datotek

source: Add a user
cy: Ychwanegu defnyddiwr
hy: Ավելացրեք օգտվող
ko: 사용자 추가
ne: प्रयोगकर्ता थप्नुहोस्
sl: Dodaj uporabnika

source: New user at %s
cy: Defnyddiwr newydd yn %s
hy: Նոր օգտվող %s-ում
ko: %s의 신규 사용자
ne: %s मा नयाँ प्रयोगकर्ता
sl: Nov uporabnik na strežniku %s

source: Visitor
cy: Ymwelydd
hy: Այցելու
ko: 방문자
ne: आगन्तुक
sl: Obiskovalec

source: Member
cy: Aelod
hy: Անդամ
ko: 회원
ne: सदस्य
sl: Član

source: Editor
cy: Golygydd
hy: Խմբագիր
ko: 편집자
ne: सम्पादक
sl: Urednik

source: Moderator
cy: Cymedrolwr
hy: Մոդերատոր
ko: 중재자
ne: मोडरेटर

source: Manager
cy: Rheolwr
hy: Կառավարիչ
ko: 관리자
ne: प्रबन्धक
sl: Upravitelj

source: Edit the user
cy: Golygu'r defnyddiwr
hy: Խմբագրել օգտվողին
ko: 사용자 편집
ne: प्रयोगकर्ता सम्पादन गर्नुहोस्
sl: Uredi uporabnika

source: Never
cy: Byth
hy: Երբեք
ko: 없음
ne: कहिले पनि होइन
sl: Nikoli

source: User administration
cy: Gweinyddiaeth defnyddwyr
hy: Օգտագործողի կառավարում
ko: 사용자 관리
ne: प्रयोगकर्ता प्रशासन
sl: Skrbništvo uporabnikov

source: My page
cy: Fy nhudalen
hy: Իմ էջը
ko: 나의 페이지
ne: मेरो पृष्ठ
sl: Moja stran

source: Set the default blocks for new users
cy: Gosodwch y blociau rhagosodedig ar gyfer defnyddwyr newydd
hy: Սահմանեք լռելյայն բլոկները նոր օգտվողների համար
ko: 새 사용자의 기본 블록을 설정하십시오
ne: नयाँ प्रयोगकर्ताहरूको लागि पूर्वनिर्धारित ब्लकहरू सेट गर्नुहोस्
sl: Nastavitev privzetih blokov za nove uporabnike

source: Change the “My page” blocks
cy: Newid y blociau “Fy nhudalen”
hy: Փոխեք «Իմ էջը» բլոկները
ko: “My page” 블록 변경
ne: मेरो पृष्ठका ब्लकहरू परिवर्तन गर्नुहोस्
sl: Spremeni bloke na strani “Moja stran”

source: The user %s has been deleted.
cy: Mae'r defnyddiwr %s wedi'i ddileu.
hy: %s օգտվողը ջնջվել է:
ko: 사용자 %s이(가) 삭제되었습니다.
ne: प्रयोगकर्ता %s मेटाइएको छ।
sl: Uporabnik %s je izbrisan.

source: Delete inactive users
cy: Dileu defnyddwyr anweithredol
hy: Ջնջել ոչ ակտիվ օգտվողներին
ko: 비활성 사용자 삭제
ne: निष्क्रिय प्रयोगकर्ताहरू हटाउनुहोस्
sl: Izbriši neaktivne uporabnike

source: User verification
cy: Gwirio defnyddiwr
hy: Օգտագործողի ստուգում
ko: 사용자 확인
ne: प्रयोगकर्ता प्रमाणिकरण
sl: Overjanje uporabnikov

source: Family with parents
cy: Teulu'r rhieni
hy: Ընտանիք ծնողների հետ
ko: 부모님이 있는 가족
ne: बुवाआमासँग परिवार
sl: Družina s starši

source: Family with adoptive parents
cy: Teulu gyda rhieni mabwysiadol
hy: Ընտանիք որդեգրող ծնողներով
ko: 양부모가 있는 가족
ne: धर्मपुत्र आमाबाबु भएको परिवार
sl: Družina s posvojitelji

source: Family with foster parents
cy: Teulu gyda rhieni maeth
hy: Ընտանիք խնամատար ծնողներով
ko: 위탁 양부모가 있는 가족
ne: धर्मपुत्र आमाबाबुसँको परिवार
sl: Družina z rejniki

source: Family with sealing parents
cy: Teulu gyda rhieni selio
hy: Ընտանիք կնքող ծնողներով
ko: 봉인 부모가 있는 가족
ne: सील गर्ने आमाबाबुको साथ परिवार
sl: Družina s pečatenimi starši

source: Family with rada parents
cy: Teulu gyda rhieni rada
hy: Ընտանիք ռադայի ծնողներով
ko: 라다 부모님이 있는 가족
ne: राडा आमाबाबुसँग परिवार
sl: Družina z radāʿ starši

source: Father’s family with %s
cy: Teulu tad gyda %s
hy: Հոր ընտանիքը %s-ով
ko: %s가 있는 아버지의 가족
ne: %s सँग बुवाको परिवार
sl: Očetova družina z osebo %s

source: Father’s family with an unknown individual
cy: Teulu tad gydag unigolyn anhysbys
hy: Հոր ընտանիքը անհայտ անձի հետ
ko: 신원을 알 수 없는 아버지의 가족
ne: अज्ञात व्यक्तिसँग बुबाको परिवार
sl: Očetova družina z neznano osebo

source: Mother’s family with %s
cy: Teulu mam gyda %s
hy: Մոր ընտանիքը %s-ով
ko: %s가 있는 어머니의 가족
ne: %s सँग आमाको परिवार
sl: Materina družina z osebo %s

source: Mother’s family with an unknown individual
cy: Teulu mam gydag unigolyn anhysbys
hy: Մոր ընտանիքը անհայտ անձի հետ
ko: 모르는 인물이 있는 어머니의 가족
ne: अज्ञात व्यक्तिसँग आमाको परिवार
sl: Materina družina z neznano osebo

source: Family with %s
cy: Teulu gyda %s
hy: Ընտանիք %s-ով
ko: %s가 있는 가족
ne: %s सँगको परिवार
sl: Družina z osebo %s

source: There are no individuals with the surname “%s”
hy: «%s» ազգանունով անհատներ չկան
ne: "%s" थर भएका कुनै पनि व्यक्ति छैनन्

source: All
cy: Y Cyfan
hy: Բոլորը
ko: 전체
ne: सबै
sl: Vse

source: No surname
hy: Ոչ մի ազգանուն
ne: उपनाम छैन

source: Families
cy: Teuluoedd
hy: Ընտանիքներ
ko: 가족
ne: परिवारहरु
sl: Družine

source: Individuals
cy: Unigolion
hy: Անհատներ
ko: 인물
ne: व्यक्तिहरू
sl: Osebe

source: Exclude individuals with “%s” as a married name
cy: Eithrio unigolion sydd â “%s” fel enw priod
hy: Բացառել «%s» ունեցող անձանց որպես ամուսնական անուն
ko: 결혼 이름이 "%s"인 인물 제외
ne: विवाहित नामको रूपमा "%s" भएका व्यक्तिहरूलाई बहिष्कार गर्नुहोस्
sl: Izključi posameznike s poročnim priimkom “%s”

source: Include individuals with “%s” as a married name
cy: Cynnwys unigolion sydd â “%s” fel enw priod
hy: Ներառեք «%s» ունեցող անհատներին որպես ամուսնական անուն
ko: 결혼 이름으로 "%s"가 있는 인물 포함
ne: विवाहित नामको रूपमा "%s" भएका व्यक्तिहरूलाई समावेश गर्नुहोस्
sl: Vključi posameznike s poročnim priimkom “%s”

source: Show the list of individuals
cy: Dangos y rhestr o unigolion
hy: Ցույց տալ անհատների ցանկը
ko: 인물 목록 표시
ne: व्यक्तिहरूको सूचि देखाउनुहोस्
sl: Prikaži seznam oseb

source: Show the list of surnames
cy: Dangos rhestr o gyfenwau
hy: Ցույց տալ ազգանունների ցանկը
ko: 가문 목록 표시
ne: थरहरूको सूचि देखाउनुहोस्
sl: Prikaži seznam priimkov

source: Ancestors
cy: Hynafiaid
hy: Նախնիներ
ko: 조상 차트
ne: पूर्वजहरू
sl: Predniki

source: A report of an individual’s ancestors, in a narrative style.
cy: Adroddiad am hynafiaid unigolyn, mewn arddull naratif.
hy: Զեկույց անհատի նախնիների մասին՝ պատմողական ոճով։
ko: 인물의 조상에 관한 대화체의 보고서.
ne: एक व्यक्तिको पुर्खाहरूको रिपोर्ट, कथा शैलीमा।
sl: Poročilo o prednikih osebe, v pripovednem slogu.

source: An alternative to the “media” tab, and an enhanced image viewer.
cy: Dewis arall yn lle'r tab “cyfryngau”, a darllenydd delwedd gwell.
hy: «Մեդիա» ներդիրի այլընտրանք և պատկերների ընդլայնված դիտում:
ko: "미디어" 탭의 대안 및 향상된 이미지 뷰어.
ne: "मिडिया" ट्याबको विकल्प, र एक परिष्कृत छवि दर्शक।
sl: Alternativa zavihku “mediji” in izboljšan pregledovalnik slik.

source: A chart of an individual’s ancestors.
cy: Siart o hynafiaid unigolyn.
hy: Անհատի նախնիների աղյուսակ.
ko: 인물의 조상 차트.
ne: व्यक्तिको पुर्खाहरूको चार्ट।
sl: Diagram prednikov osebe.

source: Ancestors of %s
cy: Hynafiaid %s
hy: %s-ի նախնիները
ko: %s의 조상
ne: %s का पुर्खाहरू
sl: Predniki osebe %s

source: Tree
cy: Coeden
hy: Ծառ
ko: 트리
ne: वृक्ष
sl: Drevo

source: Create maps using %s.
hy: Ստեղծեք քարտեզներ՝ օգտագործելով %s:
ko: %s를 사용하여 지도를 만듭니다.
ne: %s प्रयोग गरेर नक्साहरू सिर्जना गर्नुहोस्।

source: Bing™ maps
hy: Bing™ քարտեզներ
ne: Bing™ नक्सा

source: The preferences for the module “%s” have been updated.
cy: Mae'r dewisiadau ar gyfer y modiwl “%s” wedi'u diweddaru.
hy: «%s» մոդուլի նախապատվությունները թարմացվել են:
ko: "%s"모듈의 환경 설정이 업데이트되었습니다.
ne: मोड्युल "%s" को लागि प्राथमिकताहरू अद्यावधिक गरिएको छ।
sl: Nastavitve modula “%s” so posodobljene.

source: This service requires an API key.
hy: Այս ծառայության համար անհրաժեշտ է API բանալի:
ne: यो सेवालाई API कुञ्जी चाहिन्छ।

source: Bing™ webmaster tools
cy: Offer gwefeistr Bing ™
hy: Bing™ վեբ վարպետների գործիքներ
ne: Bing™ वेबमास्टर उपकरणहरू
sl: Bing™ skrbniška orodja

source: Vital records
cy: Cofnodion hanfodol
hy: Կենսական գրառումներ
ko: 중요한 기록
ne: महत्त्वपूर्ण रेकर्डहरू
sl: Vitalni zapisi

source: A report of vital records for a given date or place.
cy: Adroddiad am gofnodion hanfodol dyddiadau neu lefydd penodol.
hy: Տվյալ ամսաթվի կամ վայրի համար կենսական գրառումների հաշվետվություն:
ko: 중요한 날짜나 장소에 대한 기록의 보고서.
ne: दिइएको मिति वा स्थानको लागि महत्त्वपूर्ण अभिलेखहरूको रिपोर्ट।
sl: Poročilo o vitalnih zapisih za določen datum ali kraj.

source: Births
cy: Genedigaethau
hy: Ծնունդներ
ko: 출생
ne: जन्महरु
sl: Rojstva

source: A report of individuals who were born in a given time or place.
cy: Adroddiad am unigolion a aned ar adegau neu lefydd penodol.
hy: Հաշվետվություն անհատների մասին, ովքեր ծնվել են տվյալ ժամանակում կամ վայրում:
ko: 출생시간이나 장소에 관한 인물에 대한 보고서.
ne: उल्लेखित समय र मितिमा जन्मिएका व्यक्तिहरूको प्रतिवेदन ।
sl: Poročilo o osebah, ki so se rodile v določenem času ali kraju.

source: Branches
cy: Canghennau
hy: Մասնաճյուղեր
ko: 분기점
ne: शाखाहरू
sl: Veje

source: A list of branches of a family.
cy: Rhestr o ganghennau teulu.
hy: Ընտանիքի ճյուղերի ցանկը.
ko: 가족의 분기점 목록입니다.
ne: परिवारका शाखाहरूको सूची।
sl: Seznam družinskih vej.

source: Branches of the %s family
cy: Canghennau o'r teulu %s
hy: %s ընտանիքի մասնաճյուղեր
ko: %s 가문의 분기점
ne: %s परिवारका शाखाहरू
sl: Veje družine %s

source: Generation
cy: Cenhedlaeth
hy: Սերունդ
ko: 세대
ne: पुस्ता
sl: Generacija

source: Calendar
cy: Calendr
hy: Օրացույց
ko: 달력
ne: पात्रो
sl: Koledar

source: The calendar menu.
cy: Y ddewislen calendr.
hy: Օրացույցի մենյու.
ko: 달력 메뉴.
ne: क्यालेन्डर मेनु।
sl: Meni koledarja.

source: Day
cy: Diwrnod
hy: Օր
ko: 날짜
ne: दिन
sl: Dan

source: Month
cy: Mis
hy: Ամիս
ko: 월
ne: महिना
sl: Mesec

source: Year
cy: Blwyddyn
hy: Տարի
ko: 년
ne: बर्ष
sl: Leto

source: Burials
cy: Claddedigaethau
hy: Թաղումներ
ko: 매장
ne: दाहसंस्कार
sl: Pokopi

source: A report of individuals who were buried in a given place.
cy: Adroddiad am unigolion a gladdwyd mewn mannau penodol.
hy: Տվյալ վայրում թաղված անձանց մասին հաշվետվություն։
ko: 특정 장소에 매장 된 인물에 대한 보고서.
ne: दिइएको ठाउँमा दफनाइएका व्यक्तिहरूको रिपोर्ट।
sl: Poročilo o osebah, ki so pokopane na določenem kraju.

source: Census assistant
cy: Cynorthwyydd cyfrifiad
hy: Մարդահամարի օգնական
ko: 인구조사 도우미
ne: जनगणना सहायक
sl: Pomočnik popisa

source: An alternative way to enter census transcripts and link them to individuals.
cy: Ffordd arall o nodi trawsgrifiadau cyfrifiad a'u cysylltu ag unigolion.
hy: Մարդահամարի արձանագրությունները մուտքագրելու և անհատների հետ կապելու այլընտրանքային միջոց:
ko: 인구조사 사본을 입력하고 인물과 연결하는 다른 방법.
ne: जनगणना ट्रान्सक्रिप्टहरू प्रविष्ट गर्न र व्यक्तिहरूलाई लिङ्क गर्ने वैकल्पिक तरिका।
sl: Alternativni način za vnos prepisov popisov in njihovo povezovanje z osebami.

source: Remove
cy: Tynnu
hy: Հեռացնել
ko: 제거
ne: हटाउनुहोस्
sl: Odstrani

source: Changes
cy: Newidiadau
hy: Փոփոխություններ
ko: 변경
ne: परिवर्तन
sl: Spremembe

source: A report of recent and pending changes.
cy: Adroddiad am newidiadau diweddar a chynigion newydd
hy: Վերջին և սպասվող փոփոխությունների հաշվետվություն:
ko: 최근 및 보류중인 변경 사항에 대한 보고서입니다.
ne: भर्खरको र विचाराधीन परिवर्तनहरूको रिपोर्ट।
sl: Poročilo o nedavnih in čakajočih spremembah.

source: An alternative way to display charts.
cy: Ffordd arall o dangos siartiau.
hy: Գծապատկերների ցուցադրման այլընտրանքային միջոց:
ko: 차트를 표시하는 다른 방법입니다.
ne: चार्ट देखिने वैकल्पिक तरिका ।
sl: Alternativni način prikaza diagramov.

source: Pedigree
cy: Tras
hy: Տոհմ
ko: 가계도
ne: वंशावली
sl: Rodovnik

source: Descendants
cy: Disgynyddion
hy: Հետնորդներ
ko: 후손 차트
ne: संततिहरु
sl: Potomci

source: Hourglass chart
cy: Siart Awrwydr
hy: Ավազի ժամացույցի աղյուսակ
ko: 양방향 차트
ne: घन्टा चार्ट
sl: Diagram peščene ure

source: Interactive tree of %s
cy: Cart ryngweithiol %s
hy: %s-ի ինտերակտիվ ծառ
ko: %s의 범위형 가계도
ne: %s को पारस्परिक वृक्ष
sl: Interaktivno drevo osebe %s

source: Interactive tree
cy: Cart ryngweithiol
hy: Ինտերակտիվ ծառ
ko: 범위형 가계도
ne: पारस्परिक वृक्ष
sl: Interaktivno drevo

source: You must select an individual and a chart type in the block preferences
cy: Rhaid i chi ddewis unigolyn a'r math o siart yn y dewisiadau bloc
hy: Բլոկի նախապատվություններում դուք պետք է ընտրեք անհատ և գծապատկերի տեսակ
ko: 블록 환경 설정에서 인물 및 차트 유형을 선택해야합니다
ne: तपाईंले ब्लक प्राथमिकताहरूमा एक व्यक्ति र चार्ट प्रकार चयन गर्नुपर्छ
sl: V nastavitvah bloka morate izbrati osebo in vrsto diagrama

source: The charts menu.
cy: Y ddewislen siartiau.
hy: Գծապատկերների ընտրացանկը.
ko: 차트 메뉴.
ne: चार्ट मेनु।
sl: Meni diagramov.

source: Check for new version
hy: Ստուգեք նոր տարբերակի համար
ne: नयाँ संस्करणको लागि जाँच गर्नुहोस्

source: Send an email to all administrators when an upgrade is available.
hy: Նամակ ուղարկեք բոլոր ադմինիստրատորներին, երբ թարմացումը հասանելի լինի:
ne: अपग्रेड उपलब्ध हुँदा सबै प्रशासकहरूलाई इमेल पठाउनुहोस्।

source: Allow other modules to edit text using a “WYSIWYG” editor, instead of using HTML codes.
cy: Caniatáu i fodiwlau eraill olygu testun gan ddefnyddio golygydd “WYSIWYG”, yn lle defnyddio codau HTML.
hy: Թույլ տվեք այլ մոդուլներին խմբագրել տեքստը «WYSIWYG» խմբագրիչի միջոցով՝ HTML կոդերի փոխարեն:
ko: 다른 모듈이 HTML 코드를 사용하는 대신 "WYSIWYG" 편집기를 사용하여 텍스트를 편집할 수 있도록 합니다.
ne: अन्य मोड्युलहरूलाई HTML कोडहरू प्रयोग गर्नुको सट्टा "WYSIWYG" सम्पादक प्रयोग गरेर पाठ सम्पादन गर्न अनुमति दिनुहोस्।
sl: Dovoli drugim modulom urejanje besedila z urejevalnikom “WYSIWYG” namesto z uporabo kod HTML.

source: Select records from your family tree and save them as a GEDCOM file.
cy: Dewiswch gofnodion o'ch cart achau a'u cadw fel ffeil GEDCOM.
hy: Ընտրեք գրառումները ձեր տոհմածառից և պահեք դրանք որպես GEDCOM ֆայլ:
ko: 가계도에서 레코드를 선택하고 GEDCOM 파일로 저장하십시오.
ne: तपाईंको पारिवारिक रूखबाट रेकर्डहरू चयन गर्नुहोस् र तिनीहरूलाई GEDCOM फाइलको रूपमा बचत गर्नुहोस्।
sl: Izberite zapise iz svojega družinskega drevesa in jih shranite kot datoteko GEDCOM.

source: Add to the clippings cart
cy: Ychwanegwch at y drol toriadau
hy: Ավելացրեք հատվածների զամբյուղին
ko: 클리핑 카트에 추가
ne: क्लिपिङ्स कार्टमा थप्नुहोस्
sl: Dodaj v košarico za izrezke

source: Empty the clippings cart
cy: Gwagwch y drol toriadau
hy: Դատարկեք կտրվածքների սայլակը
ko: 클리핑 카트 비우기
ne: क्लिपिङ्स कार्ट खाली गर्नुहोस्
sl: Izprazni košarico za izrezke

source: Download
cy: Llwytho i lawr
hy: Բեռնել
ko: 다운로드
ne: डाऊनलोड
sl: Prenos

source: Clippings cart
cy: Cart toriadau
hy: Հատվածների սայլ
ko: 클리핑 카트
ne: क्लिपिङ्स कार्ट
sl: Košarica za izrezke

source: Family tree clippings cart
cy: Cart toriadau cart achau
hy: Տոհմածառի հատվածների սայլ
ko: 가계도 클리핑 카트
ne: पारिवारिक रूख क्लिपिंग्स कार्ट
sl: Košarica za izreze družinskega drevesa

source: %s and their children
cy: %s a'u plant
hy: %s և նրանց երեխաները
ko: %s 와 그들의 자녀
ne: %s र तिनीहरूका छोराछोरी
sl: %s in njuni otroci

source: %s and their descendants
cy: %s a'u disgynyddion
hy: %s և նրանց ժառանգները
ko: %s 와 그들의 자손
ne: %s र तिनीहरूका सन्तानहरू
sl: %s in njuni potomci

source: Add %s to the clippings cart
cy: Ychwanegu %s at y drol toriadau
hy: Ավելացնել %s հատվածների զամբյուղին
ko: 클리핑 카트에 %s 추가
ne: क्लिपिङ्स कार्टमा %s थप्नुहोस्
sl: Dodaj %s v košarico za izrezke

source: %s, her parents and siblings
cy: %s, ei rhieni a'i brodyr a'i chwiorydd
hy: %s, նրա ծնողներն ու քույրերն ու քույրերը
ko: %s, 그녀의 부모와 형제자매
ne: %s, उनका आमाबुवा तथा भाइबहिनीहरू
sl: %s, njeni starši in bratje/sestre

source: %s, her spouses and children
cy: %s, ei phriod a'i phlant
hy: %s, նրա ամուսինները և երեխաները
ko: %s, 그녀의 배우자와 자녀들
ne: %s, उनका श्रीमान् र छोराछोरीहरू
sl: %s, njeni partnerji in otroci

source: %s and her ancestors
cy: %s a'i hynafiaid
hy: %s և նրա նախնիները
ko: %s 와 그녀의 조상
ne: %s र उनका पुर्खाहरू
sl: %s in njeni predniki

source: %s, her ancestors and their families
cy: %s, ei chyndeidiau a'u teuluoedd
hy: %s, նրա նախնիները և նրանց ընտանիքները
ko: %s, 그녀의 조상 및 그들의 가족
ne: %s, उनका पुर्खा र तिनीहरूका परिवार
sl: %s, njeni predniki in njihove družine

source: %s, her spouses and descendants
cy: %s, ei phriod a'i disgynyddion
hy: %s, նրա ամուսինները և ժառանգները
ko: %s, 그녀의 배우자와 후손
ne: %s, उनका पति र सन्ततिहरू
sl: %s, njeni partnerji in potomci

source: %s, his parents and siblings
cy: %s, ei rieni a'i frodyr a'i chwiorydd
hy: %s, նրա ծնողներն ու քույրերն ու եղբայրները
ko: %s, 그의 부모와 형제자매
ne: %s, उहाँका आमाबुवा र भाइबहिनीहरू
sl: %s, njegovi starši in bratje/sestre

source: %s, his spouses and children
cy: %s, ei briod a'i blant
hy: %s, նրա ամուսիններն ու երեխաները
ko: %s, 그의 배우자와 자녀들
ne: %s, उहाँकी श्रीमती र छोराछोरीहरू
sl: %s, njegove partnerke in otroci

source: %s and his ancestors
cy: %s a'i hynafiaid
hy: %s և նրա նախնիները
ko: %s 와 그의 조상
ne: %s र उनका पुर्खाहरू
sl: %s in njegovi predniki

source: %s, his ancestors and their families
cy: %s, ei hynafiaid a'u teuluoedd
hy: %s, նրա նախնիները և նրանց ընտանիքները
ko: %s, 그의 조상 및 그들의 가족
ne: %s, उहाँका पुर्खा र तिनीहरूका परिवार
sl: %s, njegovi predniki in njihove družine

source: %s, his spouses and descendants
cy: %s, ei briod a'i ddisgynyddion
hy: %s, նրա ամուսիններն ու ժառանգները
ko: %s, 그의 배우자와 후손
ne: %s, उहाँकी श्रीमती र सन्ततिहरू
sl: %s, njegove partnerke in potomci

source: %s and the individuals that reference it.
cy: %s a'r unigolion sy'n cyfeirio ato.
hy: %s և այն անհատները, որոնք հղում են անում դրան:
ko: %s 및 이를 참조하는 인물.
ne: %s र यसलाई सान्दर्भिक मान्ने व्यक्तिहरू ।
sl: %s in osebe, ki se na osebo sklicujejo.

source: clouds
cy: cymylau
hy: ամպեր
ne: बादल
sl: Oblaki

source: colors
cy: lliwiau
hy: գույները
ne: रंगहरू
sl: Barve

source: Palette
cy: Palet
hy: Ներկապնակ
ne: रङदानी
sl: Paleta

source: Aqua Marine
cy: Gwyrddlas y Môr
hy: Aqua Marine կապույտ
ne: अक्वा मरिन
sl: Akvamarin

source: Ash
cy: Lludw
hy: Աշ
ne: खरानी
sl: Pepel

source: Belgian Chocolate
cy: Siocled Belg
hy: Բելգիական շոկոլադ
ne: बेल्जियम चकलेट
sl: Belgijska čokolada

source: Blue Lagoon
cy: Morlyn Glas
hy: Կապույտ ծովածոց
ne: ब्लु लगुन
sl: Morda laguna

source: Blue Marine
cy: Glas y Môr
hy: Կապույտ ծովային
ne: ब्लु मरिन
sl: Mornariško modra

source: Coffee and Cream
cy: Coffi a Hufen
hy: Սուրճ և սերուցք
ne: कफी र क्रीम
sl: Kava in smetana

source: Cold Day
cy: Diwrnod Oer
hy: Սառը օր
ne: जाडो दिन
sl: Hladen dan

source: Green Beam
cy: Trawst Gwyrdd
hy: Կանաչ ճառագայթ
ne: ग्रीन बीम
sl: Zeleni žarek

source: Mediterranio
hy: Միջերկրական
ne: भूमध्य
sl: Sredozemlje

source: Mercury
cy: Arian byw
hy: Մերկուրի
ne: बुध
sl: Merkur

source: Nocturnal
cy: Nosol
hy: Գիշերային
ne: निशाचर
sl: Nočno

source: Olivia
hy: Օլիվիա
ne: ओलिभिया
sl: Olivija

source: Pink Plastic
cy: Plastig Pinc
hy: Վարդագույն Պլաստիկ
ne: पिन्क प्लास्टिक
sl: Roza plastika

source: Sage
hy: իմաստուն
ne: ऋषि
sl: Žajbelj

source: Shiny Tomato
cy: Tomato Sgleiniog
hy: Փայլուն լոլիկ
ne: साइनी टोमाटो
sl: Sijoči paradižnik

source: Teal Top
cy: Corhwyad
hy: Թեյլ վերնաշապիկ
ne: टिल शीर्ष
sl: Modrozeleni vrh

source: Compact tree
cy: Cart cryno
hy: Կոմպակտ ծառ
ko: 컴팩트 트리
ne: कम्प्याक्ट वंशवृक्ष
sl: Kompaktno drevo

source: A chart of an individual’s ancestors, as a compact tree.
cy: Siart o hynafiaid unigolyn, fel cart cryno.
hy: Անհատի նախնիների աղյուսակը՝ որպես կոմպակտ ծառ:
ko: 콤팩트 트리 형태의 인물의 조상 차트.
ne: कम्प्याक्ट वृक्षका रूपमा व्यक्तिको पुर्खाहरू चार्टमा ।
sl: Diagram prednikov osebe, oblikovan kot drevo.

source: Compact tree of %s
cy: Cart cryno o %s
hy: %s-ի կոմպակտ ծառ
ko: %s의 컴팩트 트리
ne: %s को कम्प्याक्ट वंशवृक्ष
sl: Kompaktno drevo osebe %s

source: Contact information
cy: Manylion cyswllt
hy: Կոնտակտային տվյալներ
ko: 연락처 정보
ne: सम्पर्क जानकारी
sl: Kontaktni podatki

source: A link to the site contacts.
cy: Dolen i gysylltiadau'r wefan.
hy: Հղում դեպի կայքի կոնտակտներ:
ko: 사이트 연락처에 대한 링크입니다.
ne: साइट सम्पर्क लिङ्क।
sl: Povezava do kontaktnih podatkov spletišča.

source: For technical support or genealogy questions contact %s.
cy: Am gymorth technegol neu ymholiadau i'r achau, cysylltwch â %s.
hy: Տեխնիկական աջակցության կամ ծագումնաբանական հարցերի համար կապվեք %s-ի հետ:
ko: 기술 지원 또는 계보 관련 질문은 %s에 문의하십시오.
ne: प्राविधिक सहयोग वा वंशावली प्रश्नहरूको लागि %s लाई सम्पर्क गर्नुहोस्।
sl: Za tehnično podporo ali rodoslovna vprašanja se obrnite na %s.

source: For help with genealogy questions contact %s.
cy: I gael gymorth gyda materion achau, cysylltwch â %s.
hy: Ծագումնաբանական հարցերի հետ կապված օգնության համար դիմեք %s:
ko: 계보 질문에 대한 도움이 필요하면 %s에게 문의하십시오.
ne: वंशावलीमा मद्दतको लागि %s लाई सम्पर्क गर्नुहोस्।
sl: Za rodoslovna vprašanja se obrnite na %s.

source: For technical support and information contact %s.
cy: Am gymorth a gwybodaeth dechnegol, cysylltwch â %s.
hy: Տեխնիկական աջակցության և տեղեկատվության համար կապվեք %s-ի հետ:
ko: 기술 지원 및 정보는 %s에 문의하십시오.
ne: प्राविधिक सहयोग र जानकारीको लागि %s लाई सम्पर्क गर्नुहोस्।
sl: Za tehnično pomoč in informacije se obrnite na %s.
