Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Place names can change over time. In genealogy, it is customary to use the current name for a town or country. The historic name can be shown in sources, notes, etc.
hy: Տեղանունները կարող են փոխվել ժամանակի ընթացքում: Ծագումնաբանության մեջ ընդունված է օգտագործել քաղաքի կամ երկրի ներկայիս անվանումը։ Պատմական անունը կարելի է ցույց տալ աղբյուրներում, նշումներում և այլն։
ko: 장소 이름은 시간이 지남에 따라 변경될 수 있습니다. 족보에서는 마을이나 국가의 현재 이름을 사용하는 것이 관례입니다. 역사적 이름은 출처, 메모 등에 표시할 수 있습니다.
ne: समय अनुसार ठाउँको नाम परिवर्तन हुन सक्छ। वंशावलीमा, शहर वा देशको लागि हालको नाम प्रयोग गर्ने प्रचलन छ। ऐतिहासिक नाम स्रोत, नोट, आदि मा देखाउन सकिन्छ।

source: Where a user is associated to an individual record in a family tree and has a role of member, editor, or moderator, you can prevent them from accessing the details of distant, living relations. You specify the number of relationship steps that the user is allowed to see.
cy: Lle mae defnyddiwr yn gysylltiedig â chofnod unigol mewn cart achau a bod ganddo rôl fel aelod, golygydd, neu gymedrolwr, gallwch eu hatal rhag darllen manylion perthnasau byw pell. Chi sy'n nodi nifer y camau perthynas y mae caniatâd i'r defnyddiwr eu gweld.
hy: Եթե օգտատերը կապված է տոհմածառի առանձին գրառումների հետ և ունի անդամի, խմբագրի կամ վարողի դեր, դուք կարող եք թույլ չտալ նրան մուտք գործել հեռավոր, կենդանի հարաբերությունների մանրամասները: Դուք նշում եք հարաբերությունների քայլերի քանակը, որոնք օգտատերը կարող է տեսնել:
ko: 사용자가 가계도의 개별 레코드에 연결되어 있고 구성원, 편집자 또는 중재자 역할을하는 경우, 먼 관계에있는 세부 정보에 액세스하지 못하게 할 수 있습니다. 사용자가 볼 수있는 관계 단계 수를 지정합니다.
ne: जहाँ एक प्रयोगकर्ता पारिवारिक रूखमा व्यक्तिगत रेकर्डसँग सम्बन्धित छ र सदस्य, सम्पादक, वा मध्यस्थकर्ताको भूमिका छ, तपाईंले तिनीहरूलाई टाढा, जीवित सम्बन्धहरूको विवरणहरू पहुँच गर्नबाट रोक्न सक्नुहुन्छ। तपाईंले प्रयोगकर्तालाई हेर्न अनुमति दिइएको सम्बन्ध चरणहरूको संख्या निर्दिष्ट गर्नुहोस्।
sl: Če je uporabnik povezan s posameznim zapisom v družinskem drevesu in ima vlogo člana, urednika ali moderatorja, mu lahko preprečite dostop do podrobnosti razmerij z oddaljenimi, živimi osebami. Določite število korakov razmerja, ki jih uporabnik lahko vidi.

source: For example, if you specify a path length of 2, the individual will be able to see their grandson (child, child), their aunt (parent, sibling), their step-daughter (spouse, child), but not their first cousin (parent, sibling, child).
cy: Er enghraifft, os nodwch hyd llwybr o 2, bydd yr unigolyn yn gallu gweld ei ŵyr (plentyn, plentyn), ei m/fodryb (rhiant, brawd neu chwaer), ei ll/lysferch (priod, plentyn), ond nid ei ch/gefnder cyntaf (rhiant, brawd neu chwaer, plentyn).
hy: Օրինակ, եթե դուք նշեք 2 ուղու երկարությունը, անհատը կկարողանա տեսնել իր թոռանը (երեխա, երեխա), մորաքրոջը (ծնող, քույր կամ քույր), խորթ դստերը (ամուսին, երեխա), բայց ոչ իր առաջին զարմիկին (ծնող, քույր կամ քույր, երեխա):
ko: 예를 들어 경로 길이를 2로 지정하면 개인은 손자(자녀, 자녀), 이모(부모, 형제자매), 의붓딸(배우자, 자녀)을 볼 수 있지만 사촌은 볼 수 없습니다. (부모, 형제, 자녀).
ne: उदाहरणका लागि, यदि तपाईंले 2 को पथ लम्बाइ निर्दिष्ट गर्नुभयो भने, व्यक्तिले आफ्नो नाति (बच्चा, बच्चा), तिनीहरूको काकी (आमाबाबु, भाइबहिनी), तिनीहरूको सौतेनी छोरी (पति/पत्नी, बच्चा) देख्न सक्षम हुनेछ, तर तिनीहरूको पहिलो चचेरे भाईलाई होइन। (अभिभावक, भाइबहिनी, छोराछोरी)।
sl: Na primer, če določite dolžino poti 2, bo oseba lahko videla svojega vnuka (otrok, otrok), svojo teto (starš, brat/sestra), svojo pastorko (zakonec, otrok), ne pa tudi svojega prvega bratranca (starš, brat/sestra, otrok).

source: Note: longer path lengths require a lot of calculation, which can make your website run slowly for these users.
cy: Sylwch: mae angen cyfrifo llawer ar hyd llwybrau hirach, sy'n gallu gwneud i'ch gwefan redeg yn araf i'r defnyddwyr hyn.
hy: Նշում. ավելի երկար ճանապարհների երկարությունները պահանջում են շատ հաշվարկներ, ինչը կարող է ստիպել ձեր վեբկայքը դանդաղ աշխատել այս օգտվողների համար:
ko: 참고: 경로 길이가 길면 많은 계산이 필요하므로 이러한 사용자는 웹사이트가 느리게 실행될 수 있습니다.
ne: नोट: लामो बाटोको लम्बाइलाई धेरै गणना चाहिन्छ, जसले तपाईंको वेबसाइटलाई यी प्रयोगकर्ताहरूका लागि बिस्तारै चलाउन सक्छ।
sl: Opomba: Daljše poti zahtevajo veliko izračunov, zaradi česar lahko spletišče za te uporabnike deluje počasi.

source: Restrictions can be added to records and/or facts. They restrict who can view the data and who can edit it.
cy: Mae modd ychwanegu cyfyngiadau at gofnodion a/neu ffeithiau. Maen nhw'n cyfyngu ar bwy sy'n gallu gweld y data a phwy all ei olygu.
hy: Սահմանափակումները կարող են ավելացվել գրառումներին և/կամ փաստերին: Նրանք սահմանափակում են, թե ով կարող է դիտել տվյալները և ովքեր կարող են խմբագրել դրանք:
ko: 기록 또는 정보에 제한을 추가 할 수 있습니다. 데이터를 볼 수있는 사람과 편집 할 수있는 사람을 제한합니다.
ne: प्रतिबन्धहरू रेकर्ड र/वा तथ्यहरूमा थप्न सकिन्छ। तिनीहरूले डेटा कसले हेर्न सक्छ र कसले यसलाई सम्पादन गर्न सक्छ भनेर प्रतिबन्धित गर्दछ।
sl: Zapisom in/ali dejstvom je mogoče dodati omejitve. Te omejijo, kdo si lahko ogleda podatke in kdo jih lahko ureja.

source: Note that if a user account is linked to a record, then that user will always be able to view that record.
cy: Sylwch, os yw cyfrif defnyddiwr wedi'i gysylltu â chofnod, yna bydd y defnyddiwr hwnnw bob amser yn gallu gweld y cofnod hwnnw.
hy: Նկատի ունեցեք, որ եթե օգտվողի հաշիվը կապված է գրառումների հետ, ապա այդ օգտվողը միշտ կկարողանա դիտել այդ գրառումը:
ko: 사용자 계정이 레코드에 연결된 경우 해당 사용자는 항상 해당 레코드를 볼 수 있습니다.
ne: नोट गर्नुहोस् कि यदि प्रयोगकर्ता खाता रेकर्डमा लिङ्क गरिएको छ भने, त्यस प्रयोगकर्ताले सधैं त्यो रेकर्ड हेर्न सक्षम हुनेछ।
sl: Če je uporabniški račun povezan z zapisom, si bo ta uporabnik vedno lahko ogledal ta zapis.

source: In many cultures it is customary to have a traditional name spelled in the traditional characters and also a romanized version of the name as it would be spelled or pronounced in languages based on the Latin alphabet, such as English.<br><br>If you prefer to use a non-Latin alphabet such as Hebrew, Greek, Russian, Chinese, or Arabic to enter the name in the standard name fields, then you can use this field to enter the same name using the Latin alphabet. Both versions of the name will appear in lists and charts.<br><br>Although this field is labeled “Romanized”, it is not restricted to containing only characters based on the Latin alphabet. This might be of use with Japanese names, where three different alphabets may occur.
cy: Mewn llawer o ddiwylliannau mae'n arferol cael enw traddodiadol wedi'i sillafu yn y nodau traddodiadol a hefyd fersiwn wedi'i rufeinio o'r enw fel y byddai'n cael ei sillafu neu ei ynganu mewn ieithoedd sy'n seiliedig ar yr wyddor Ladin, fel y Gymraeg.<br><br> Os yw'n well gennych ddefnyddio wyddor nad yw'n Lladin fel Hebraeg, Groeg, Rwseg, Tsieineaidd neu Arabeg i nodi'r enw yn y meysydd enw safonol, yna gallwch ddefnyddio'r maes hwn i nodi'r un enw gan ddefnyddio'r wyddor Ladin. Bydd y ddau fersiwn o'r enw yn ymddangos mewn rhestrau a siartiau.<br><br> Er bod y maes hwn wedi'i labelu'n “Rhufeiniedig”, nid yw'n gyfyngedig i gynnwys nodau yn unig sy'n seiliedig ar yr wyddor Ladin. Gallai hyn fod o ddefnydd gydag enwau Japaneaidd, lle gall tri wyddor wahanol ddigwydd.
hy: Շատ մշակույթներում ընդունված է ավանդական անուն գրել ավանդական գրանշաններով, ինչպես նաև անվան հռոմեական տարբերակ, ինչպես դա կուղղվի կամ արտասանվի լատինական այբուբենի վրա հիմնված լեզուներով, օրինակ՝ անգլերենով:<br><br>Եթե նախընտրում եք օգտագործել ոչ լատինատառ այբուբեն, ինչպիսիք են եբրայերեն, հունարեն, ռուսերեն, չինարեն կամ արաբերեն, ապա կարող եք մուտքագրել նույն անունը ալֆա անվանման դաշտում: Անվան երկու տարբերակները կհայտնվեն ցուցակներում և գծապատկերներում:<br><br>Չնայած այս դաշտը պիտակավորված է «Ռոմանիզացված», այն չի սահմանափակվում միայն լատինատառ այբուբենի վրա հիմնված նիշեր պարունակելու համար: Սա կարող է օգտագործվել ճապոնական անունների հետ, որտեղ կարող են լինել երեք տարբեր այբուբեններ:
ko: 많은 문화권에서는 영어와 같은 라틴 알파벳을 기반으로 하는 언어에서 철자 또는 발음되는 것과 같이 전통적인 이름을 전통적인 문자로 철자하고 로마자로 표기하는 것이 관례입니다.<br><br>만약 히브리어, 그리스어, 러시아어, 중국어 또는 아랍어와 같은 비라틴 알파벳을 사용하여 표준 이름 필드에 이름을 입력하려는 경우 이 필드에 라틴 알파벳을 사용하여 동일한 이름을 입력할 수 있습니다. 두 가지 버전의 이름이 목록과 차트에 표시됩니다.<br><br>이 필드에 "로마자 표기"라고 표시되어 있지만 라틴 알파벳을 기반으로 한 문자만 포함하도록 제한되지는 않습니다. 이것은 세 개의 다른 알파벳이 나타날 수 있는 일본어 이름과 함께 사용할 수 있습니다.
ne: धेरै संस्कृतिहरूमा परम्परागत वर्णहरूमा परम्परागत नामको हिज्जे र नामको रोमनीकृत संस्करण हुने चलन छ किनकि यसलाई अंग्रेजी जस्ता ल्याटिन वर्णमालामा आधारित भाषाहरूमा हिज्जे वा उच्चारण गरिन्छ।<br><br>यदि तपाईं मानक नाम क्षेत्रहरूमा नाम प्रविष्ट गर्न हिब्रू, ग्रीक, रूसी, चिनियाँ, वा अरबी जस्ता गैर-ल्याटिन वर्णमाला प्रयोग गर्न रुचाउनु हुन्छ, त्यसपछि तपाईंले ल्याटिन वर्णमाला प्रयोग गरेर उही नाम प्रविष्ट गर्न यो क्षेत्र प्रयोग गर्न सक्नुहुन्छ। नामको दुवै संस्करणहरू सूची र चार्टहरूमा देखा पर्नेछ।<br><br>यद्यपि यो क्षेत्रलाई "रोमनाइज्ड" लेबल गरिएको छ, यो ल्याटिन वर्णमालामा आधारित वर्णहरू मात्र समावेश गर्न प्रतिबन्धित छैन। यो जापानी नामहरूको साथ प्रयोगको हुन सक्छ, जहाँ तीन फरक अक्षरहरू हुन सक्छन्।
sl: V mnogih kulturah je običajno, da se tradicionalno ime zapiše s tradicionalnimi znaki, pa tudi v romanizirani različici imena, kot bi se zapisalo ali izgovorilo v jezikih (npr. angleščina), ki temeljijo na latinici.<br><br>Če za vnos imena v standardna polja za ime raje uporabite tradicionalne znake iz jezikov, kot so hebrejščina, grščina, ruščina, kitajščina ali arabščina, lahko v to polje vnesete isto ime z latinico. Obe različici imena se bosta prikazali na seznamih in v diagramih.<br><br>Čeprav je to polje označeno kot “romanizirano”, ni omejeno le na znake, ki temeljijo na latinici. To je lahko uporabno pri japonskih imenih, kjer se lahko pojavijo tri različne abecede.

source: Each source records specific events, generally for a given date range and for a place jurisdiction. For example a Census records census events and church records record birth, marriage, and death events.<br><br>Select the events that are recorded by this source from the list of events provided. The date should be specified in a range format such as <i>FROM 1900 TO 1910</i>. The place jurisdiction is the name of the lowest jurisdiction that encompasses all lower-level places named in this source. For example, “Oneida, Idaho, USA” would be used as a source jurisdiction place for events occurring in the various towns within Oneida County. “Idaho, USA” would be the source jurisdiction place if the events recorded took place not only in Oneida County but also in other counties in Idaho.
cy: Mae pob ffynhonnell yn cofnodi digwyddiadau penodol, yn gyffredinol ar gyfer ystod dyddiad penodol ac ar gyfer awdurdodaeth lle. Er enghraifft, mae Cyfrifiad yn cofnodi digwyddiadau cyfrifiad ac mae cofnodion eglwys yn cofnodi digwyddiadau genedigaeth, priodas a marwolaeth.<br><br> Dewiswch y digwyddiadau sy'n cael eu cofnodi gan y ffynhonnell hon o'r rhestr o ddigwyddiadau a ddarperir. Dylai'r dyddiad gael ei nodi mewn fformat amrediad fel <i>O 1900 I 1910</i> . Yr awdurdodaeth le yw enw'r awdurdodaeth isaf sy'n cwmpasu'r holl leoedd lefel is sy'n cael eu henwi yn y ffynhonnell hon. Er enghraifft, byddai “Oneida, Idaho, UDA” yn cael ei ddefnyddio fel man awdurdodaeth ffynhonnell ar gyfer digwyddiadau sy'n digwydd yn y gwahanol drefi yn Oneida County. “Idaho, UDA” fyddai’r lle awdurdodaeth ffynhonnell pe bai’r digwyddiadau a gofnodwyd yn digwydd nid yn unig yn Oneida County ond hefyd mewn siroedd eraill yn Idaho.
hy: Յուրաքանչյուր աղբյուր գրանցում է կոնկրետ իրադարձություններ, ընդհանուր առմամբ, տվյալ ամսաթվերի և վայրի իրավասության համար: Օրինակ՝ մարդահամարը գրանցում է մարդահամարի իրադարձությունները, իսկ եկեղեցում գրանցվում են ծննդյան, ամուսնության և մահվան դեպքերը:<br><br>Ընտրեք այն իրադարձությունները, որոնք գրանցված են այս աղբյուրի կողմից տրամադրված իրադարձությունների ցանկից: Ամսաթիվը պետք է նշվի միջակայքի ձևաչափով, ինչպիսին է <i>1900-ից մինչև 1910 թվականը</i>: Տեղի իրավասությունը ամենացածր իրավասության անունն է, որն ընդգրկում է այս աղբյուրում նշված բոլոր ցածր մակարդակի վայրերը: Օրինակ՝ «Օնեիդա, Այդահո, ԱՄՆ» կօգտագործվի որպես Օնեիդա շրջանի տարբեր քաղաքներում տեղի ունեցող իրադարձությունների աղբյուրի իրավասության վայր: «Այդահո, ԱՄՆ»-ը կլիներ աղբյուրի իրավասության վայրը, եթե արձանագրված իրադարձությունները տեղի ունենային ոչ միայն Օնեիդա գավառում, այլև Այդահոյի այլ շրջաններում:
ko: 각 출처는 일반적으로 지정된 날짜 범위 및 장소 관할 구역에 대한 특정 이벤트를 기록합니다. 예를 들어 인구 조사는 인구 조사 사건을 기록하고 교회 기록은 출생, 결혼 및 사망 사건을 기록합니다.<br><br>제공된 이벤트 목록에서 이 출처가 기록한 이벤트를 선택하십시오. 날짜는 <i>FROM 1900 TO 1910<과 같은 범위 형식으로 지정해야 합니다.
ne: प्रत्येक स्रोतले विशेष घटनाहरू रेकर्ड गर्दछ, सामान्यतया दिइएको मिति दायरा र स्थान क्षेत्राधिकारको लागि। उदाहरणका लागि जनगणनाले जनगणनाका घटनाहरू रेकर्ड गर्छ र चर्चले जन्म, विवाह र मृत्युका घटनाहरू रेकर्ड गर्छ।<br><br>प्रदान गरिएका घटनाहरूको सूचीबाट यो स्रोतद्वारा रेकर्ड गरिएका घटनाहरू चयन गर्नुहोस्। मिति दायरा ढाँचामा निर्दिष्ट गरिनु पर्छ जस्तै <i>1900 देखि 1910</i>। स्थान क्षेत्राधिकार भनेको सबैभन्दा तल्लो अधिकार क्षेत्रको नाम हो जसले यस स्रोतमा नाम गरिएका सबै तल्लो-स्तरका स्थानहरूलाई समेट्छ। उदाहरणका लागि, "Oneida, Idaho, USA" लाई Oneida काउन्टी भित्रका विभिन्न सहरहरूमा हुने घटनाहरूका लागि स्रोत अधिकार क्षेत्रको रूपमा प्रयोग गरिनेछ। "Idaho, USA" स्रोत क्षेत्राधिकार स्थान हुनेछ यदि रेकर्ड गरिएका घटनाहरू Oneida County मा मात्र नभएर Idaho का अन्य काउन्टीहरूमा पनि भएमा।
sl: Vsak vir beleži določene dogodke, običajno za določeno časovno obdobje in za določeno krajevno jurisdikcijo. Na primer, popis prebivalstva beleži dogodke popisa, cerkveni zapisi pa beležijo dogodke rojstva, poroke in smrti.<br><br>S seznama dogodkov izberite dogodke, ki jih beleži ta vir. Datum mora biti naveden v obliki razpona, kot je <i>OD 1900 DO 1910</i>. Krajevna jurisdikcija je ime najnižje jurisdikcije, ki zajema vse kraje nižje ravni, navedene v tem viru. Na primer, “Bloke, Notranjska, Slovenija” bi se uporabilo kot izvorni kraj jurisdikcije za dogodke, ki se zgodijo v različnih mestih znotraj občine Bloke. “Notranjska, Slovenija” bi bilo izvorni kraj jurisdikcije, če se zabeleženi dogodki niso zgodili le v občini Bloke, temveč tudi v drugih občinah na Notranjskem.

source: The <b>surname</b> field contains a name that is used for sorting and grouping. It can be different to the individual’s actual surname which is always taken from the <b>name</b> field. This field can be used to sort surnames with or without a prefix (Gogh / van Gogh) and to group spelling variations or inflections (Kowalski / Kowalska). If an individual needs to be listed under more than one surname, each name should be separated by a comma.
cy: Mae'r maes <b>cyfenw</b> yn cynnwys enw sy'n cael ei ddefnyddio ar gyfer didoli a grwpio. Gall fod yn wahanol i gyfenw gwirioneddol yr unigolyn sydd bob amser yn cael ei gymryd o'r maes <b>enw</b>. Mae modd defnyddio'r maes hwn i ddidoli cyfenwau gyda rhagddodiad neu hebddo (Gogh / van Gogh) ac i grwpio amrywiadau sillafu neu ffurfdroadau (Kowalski / Kowalska). Os oes angen rhestru unigolyn o dan fwy nag un cyfenw, dylai coma wahanu pob enw.
hy: <b>ազգանուն</b> դաշտը պարունակում է անուն, որն օգտագործվում է տեսակավորման և խմբավորման համար: Այն կարող է տարբերվել անհատի իրական ազգանունից, որը միշտ վերցված է <b>name</b> դաշտից: Այս դաշտը կարող է օգտագործվել ազգանունները նախածանցով կամ առանց նախածանցով (Գոգ / վան Գոգ) տեսակավորելու և ուղղագրական տատանումները կամ ճեղքերը խմբավորելու համար (Կովալսկի / Կովալսկա): Եթե անհատը պետք է ցուցակագրվի մեկից ավելի ազգանվան տակ, յուրաքանչյուր անուն պետք է բաժանվի ստորակետով:
ko: <b>가문이름</b> 필드에는 정렬 및 그룹화에 사용되는 이름이 있습니다. 항상 <b>이름</b> 입력란에서 가져온 개인의 실제 가문이름과 다를 수 있습니다. 이 필드는 접두사 (Gogh / van Gogh)가 있거나 없는 가문이름을 정렬하고 철자 변형 또는 변곡 (Kowalski / Kowalska)을 그룹화하는 데 사용할 수 있습니다. 개인을 둘 이상의 가문이름 아래에 나열해야하는 경우 각 이름은 쉼표로 구분해야합니다.
ne: <b>उपनाम</b> फिल्डमा एक नाम समावेश छ जुन क्रमबद्ध र समूहीकरणको लागि प्रयोग गरिन्छ। यो व्यक्तिको वास्तविक थर भन्दा फरक हुन सक्छ जुन सधैँ <b>नाम</b> क्षेत्रबाट लिइन्छ। यो क्षेत्र उपसर्ग (गोग / भ्यान गग) संग वा बिना उपसर्ग क्रमबद्ध गर्न र हिज्जे भिन्नता वा विच्छेदन (कोवाल्स्की / कोवाल्स्का) को समूहमा प्रयोग गर्न सकिन्छ। यदि एक व्यक्तिलाई एक भन्दा बढी थर अन्तर्गत सूचीबद्ध गर्न आवश्यक छ भने, प्रत्येक नाम अल्पविरामद्वारा छुट्याउनुपर्छ।
sl: Polje <b>priimek</b> vsebuje različico priimka, ki se uporablja za razvrščanje in združevanje. Lahko se razlikuje od dejanskega priimka posameznika, ki je vedno vzet iz polja <b>ime</b>. To polje lahko uporabite za razvrščanje priimkov s predpono ali brez nje (Gogh / van Gogh) in za združevanje črkovalnih različic ali pregibov (Kowalski / Kowalska). Če je treba posameznika navesti pod več kot enim priimkom, naj bodo vse različice ločene z vejico.

source: previous
cy: blaenorol
hy: նախորդ
ko: 이전
ne: अघिल्लो
sl: Nazaj

source: Share
hy: Կիսվել
ko: 공유
ne: सेयर गर्नुहोस्

source: Add a name
cy: Ychwanegu enw
hy: Ավելացրեք անուն
ko: 이름 추가
ne: नाम थप्नुहोस्
sl: Dodaj ime

source: Edit the sex
hy: Խմբագրել սեռը
ne: लिंग सच्याउनुहोस्

source: Are you sure you want to delete this fact?
cy: Ydych chi'n siŵr eich bod chi am ddileu'r ffaith hon?
hy: Իսկապե՞ս ուզում եք ջնջել այս փաստը?
ko: 이 정보를 삭제 하시겠습니까?
ne: के तपाइँ यो तथ्य मेटाउन निश्चित हुनुहुन्छ ?
sl: Ste prepričani, da želite izbrisati to dejstvo?

source: Delete this name
cy: Dileu'r enw hwn
hy: Ջնջել այս անունը
ko: 이름 삭제
ne: यो नाम मेट्नुहोस्
sl: Izbriši to ime

source: This individual has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r unigolyn hwn wedi'i ddileu. Dylech adolygu'r dileu ac yna ei %1$s neu ei %2$s.
hy: Այս անհատը ջնջվել է: Դուք պետք է վերանայեք ջնջումը, այնուհետև %1$s կամ %2$s այն:
ko: 이 인물이 삭제되었습니다. 삭제를 검토 한 다음 %1$s 또는 %2$s 해야 합니다.
ne: यो व्यक्ति मेटाइएको छ। तपाईंले मेटाउने समीक्षा र त्यसपछि %1$s वा %2$s यसलाई समीक्षा गर्नुपर्छ।
sl: Ta oseba je izbrisana. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This individual has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r unigolyn hwn wedi'i ddileu. Bydd angen i'r cymedrolwr adolygu'r dileu.
hy: Այս անհատը ջնջվել է: Ջնջումը պետք է վերանայվի մոդերատորի կողմից:
ko: 이 인물이 삭제되었습니다. 중재자가 삭제를 검토해야합니다.
ne: यो व्यक्ति मेटाइएको छ। मेटाउने कार्यलाई मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta oseba je izbrisana. Izbris mora pregledati moderator.

source: This individual has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r unigolyn hwn wedi'i olygu. Dylech adolygu'r newidiadau ac yna eu %1$s neu eu %2$s nhw.
hy: Այս անհատը խմբագրվել է: Դուք պետք է վերանայեք փոփոխությունները, այնուհետև %1$s կամ %2$s դրանք:
ko: 이 인물은 편집되었습니다. 변경 사항을 검토 한 다음 %1$s 또는 %2$s 변경해야합니다.
ne: यो व्यक्ति सम्पादन गरिएको छ। तपाईंले परिवर्तनहरूको समीक्षा गर्नुपर्छ र त्यसपछि %1$s वा %2$s तिनीहरूलाई।
sl: Ta oseba je urejena. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This individual has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r unigolyn hwn wedi'i olygu. Mae angen i'r cymedrolwr adolygu'r newidiadau.
hy: Այս անհատը խմբագրվել է: Փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից:
ko: 이 인물은 편집되었습니다. 중재자가 변경 사항을 검토해야합니다.
ne: यो व्यक्ति सम्पादन गरिएको छ। परिवर्तनहरू एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ta oseba je urejena. Spremembe mora pregledati moderator.

source: Skip to content
cy: Mynd i'r cynnwys
hy: Անցնել բովանդակությանը
ko: 내용으로 건너 뛰기
ne: सामग्रीमा जानुहोस्
sl: Preskoči na vsebino

source: Play
cy: Chwarae
hy: Խաղալ
ko: 재생
ne: बजाउनुहोस्
sl: Predvajaj

source: Stop
cy: Atal
hy: Դադարեցրեք
ko: 정지
ne: बन्द गर्नुहोस्
sl: Ustavi

source: This website is temporarily unavailable
cy: Nid yw'r wefan hon ar gael dros dro
hy: Այս կայքը ժամանակավորապես անհասանելի է
ko: 이 웹 사이트는 일시적으로 이용할 수 없습니다
ne: यो वेबसाइट अस्थायी रूपमा अनुपलब्ध छ
sl: To spletišče trenutno ni na voljo

source: This website is down for maintenance. You should <a href="index.php">try again</a> in a few minutes.
cy: Mae'r wefan hon wedi ei chau ar gyfer cynnal a chadw. Rhowch <a href="index.php">gynnig arall arni</a> ymhen ychydig funudau.
hy: Այս կայքը անջատված է սպասարկման համար: Դուք պետք է <a href="index.php">փորձեք նորից</a> մի քանի րոպեից:
ko: 이 웹 사이트는 유지 관리를 위해 다운되었습니다. 몇 분 안에 <a href="index.php">다시 시도</a> 해야합니다.
ne: यो वेबसाइट मर्मतका लागि बन्द छ। तपाईंले केही मिनेटमा <a href="index.php">फेरि प्रयास गर्नुपर्छ</a>।
sl: To spletno mesto je zaradi vzdrževanja nedostopno. Čez nekaj minut <a href="index.php">poskusite znova</a>.

source: Setup wizard for webtrees
cy: Dewin gosod webtrees
hy: Վեբ ծառերի տեղադրման հրաշագործ
ko: WebTrees의 설치 마법사
ne: वेबट्रीहरूको लागि विजार्ड सेटअप गर्नुहोस्
sl: Čarovnik za nastavitev webtrees

source: Anniversary
cy: Dathliad
hy: տարեդարձ
ko: 기념일
ne: वार्षिकोत्सव
sl: Obletnica

source: No records to display
cy: Dim cofnodion i'w dangos
hy: Ցուցադրման գրառումներ չկան
ko: 표시할 레코드가 없습니다
ne: देखाउन कुनै रेकर्ड छैन
sl: Ni zapisov za prikaz

source: Showing %1$s to %2$s of %3$s
cy: Yn dangos %1$s i %2$s o %3$s
hy: Ցուցադրվում է %1$s-ից մինչև %2$s %3$s-ից
ko: %3$s의 %1$s ~ %2$s 표시
ne: %3$s को %1$s देखि %2$s देखाउँदै
sl: Prikazanih %1$s do %2$s od %3$s

source: (filtered from %s total entries)
cy: (wedi'i hidlo o gyfanswm o %s cofnod)
hy: (զտված է %s ընդհանուր գրառումներից)
ko: (전체 항목 %s에서 필터링)
ne: (%s कुल प्रविष्टिहरूबाट फिल्टर गरिएको)
sl: (filtrirano izmed %s vnosov)

source: Display %s
cy: Dangos %s
hy: Ցուցադրել %s
ko: %s 표시
ne: %s देखाउनुहोस्
sl: Prikaži %s

source: Loading…
cy: Llwytho…
hy: Բեռնվում է…
ko: 불러오는중…
ne: लोड भईरहेको छ…
sl: Nalaganje …

source: Both alive
cy: Y ddau yn fyw
hy: Երկուսն էլ ողջ են
ko: 부부 모두 생존
ne: दुवै जीवित
sl: Oba živa

source: Show couples where only the female partner is dead.
cy: Dangos cyplau lle mai dim ond y partner benywaidd sy'n farw.
hy: Ցույց տվեք զույգերին, որտեղ միայն կին գործընկերն է մահացած:
ko: 여성 파트너만 사망한 커플을 표시합니다.
ne: महिला पार्टनर मात्र मरेको जोडीहरू देखाउनुहोस्।
sl: Prikaži pare, pri katerih je partnerka mrtva.

source: Widower
cy: Gweddw
hy: այրի
ko: 배우자와 사별한 남편
ne: विधुर
sl: Vdovec

source: Show couples where only the male partner is dead.
cy: Dangos cyplau lle mai dim ond y partner gwrywaidd sydd wedi marw.
hy: Ցույց տվեք զույգերին, որտեղ միայն տղամարդ գործընկերն է մահացած:
ko: 남성 파트너만 사망한 커플을 표시합니다.
ne: पुरुष पार्टनर मात्र मरेको जोडीलाई देखाउनुहोस्।
sl: Prikaži pare, pri katerih je partner mrtev.

source: Widow
cy: Gweddw
hy: Այրի
ko: 배우자와 사별한 부인
ne: विधवा
sl: Vdova

source: Show individuals who are dead or couples where both partners are dead.
cy: Dangos unigolion sy'n farw neu'n gyplau lle mae'r ddau bartner wedi marw.
hy: Ցույց տվեք մահացած անհատներին կամ զույգերին, որտեղ երկու գործընկերներն էլ մահացած են:
ko: 사망한 인물 또는 두 파트너가 사망한 커플을 표시합니다.
ne: मृतक भएका व्यक्तिहरू वा दुवै साझेदारहरू मरेका जोडीहरू देखाउनुहोस्।
sl: Prikaži mrtve osebe ali pare, pri katerih sta mrtva oba partnerja.

source: Both dead
cy: Y ddau wedi marw
hy: Երկուսն էլ մահացած
ko: 부부 모두 사망
ne: दुवैको मृत्यु
sl: Oba mrtva

source: Show “roots” couples or individuals. These individuals may also be called “patriarchs”. They are individuals who have no parents recorded in the database.
cy: Dangos cyplau neu unigolion “gwreiddiau”. Mae modd galw'r unigolion hyn hefyd yn “batriarchiaid”. Maen nhw'n unigolion nad oes ganddyn nhw unrhyw rieni wedi'u cofnodi yn y gronfa ddata.
hy: Ցույց տալ «արմատներ» զույգերին կամ անհատներին: Այս անհատներին կարելի է անվանել նաև «պատրիարքներ»: Նրանք անհատներ են, ովքեր չունեն տվյալների բազայում գրանցված ծնողներ:
ko: "최상위 조상" 부부 또는 인물을 표시합니다. 이 사람들은 또한“시조”라고도 합니다. 그들은 데이터베이스에 부모가 기록되어 있지 않은 개인입니다.
ne: "मूल" जोडी वा व्यक्तिहरू देखाउनुहोस्। यी व्यक्तिहरूलाई "कुलपिता" पनि भनिन्छ। तिनीहरू ती व्यक्तिहरू हुन् जसको डाटाबेसमा रेकर्ड गरिएको कुनै अभिभावक छैन।
sl: Prikaži “koreninske” pare ali posameznike oz. “začetnike”. Gre za posameznike, ki v podatkovni bazi nimajo zapisanih staršev.

source: Roots
cy: Gwreiddiau
hy: Արմատներ
ko: 시조(or 가족 구성원 중 부모가 없는 최고령 인물)
ne: जराहरू
sl: Korenine
