Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

# mother’s father’s sister’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외내종숙/외내종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# mother’s mother’s brother’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# mother’s mother’s brother’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# mother’s mother’s brother’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외종숙/외외종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# mother’s mother’s sister’s daughter
source: first cousin once removed ascending
cy: cyfnither gyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외이종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: sestrična enkrat zamaknjena naraščajoče

# mother’s mother’s sister’s son
source: first cousin once removed ascending
cy: cefnder cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외이종숙
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec enkrat zamaknjen naraščajoče

# mother’s mother’s sister’s child
source: first cousin once removed ascending
cy: cefnder/cyfnither cyntaf gradd un esgynnol
hy: առաջին զարմիկը մեկ անգամ հեռացվել է աճող
ko: 외외이종숙/외외이종이모
ne: पहिलो कजिन एक पटक बढ्दो क्रममा हटाइयो
sl: bratranec/sestrična enkrat zamaknjen/a naraščajoče

# grandfather’s brother’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 재종자매/내재종형제자매
sl: druga sestrična

# grandfather’s brother’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 재종형제/내재종형제
sl: drugi bratranec

# grandfather’s brother’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제자매/내재종형제자매
sl: drugi bratranec/sestrična

# grandfather’s sister’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 내재종자매/내내재종자매
sl: druga sestrična

# grandfather’s sister’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 내재종형제/내내재종형제
sl: drugi bratranec

# grandfather’s sister’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 내재종형제자매/내내재종형제자매
sl: drugi bratranec/sestrična

# grandfather’s sibling’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 재종자매/내재종자매/내내재종자매
sl: druga sestrična

# grandfather’s sibling’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 재종형제/내재종형제/내내재종형제
sl: drugi bratranec

# grandfather’s sibling’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제자매/내재종형제자매/내내재종형제자매
sl: drugi bratranec/sestrična

# grandmother’s brother’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 진외종자매/진외내종자매
sl: druga sestrična

# grandmother’s brother’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 진외종형제/진외내종형제
sl: drugi bratranec

# grandmother’s brother’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 진외종형제자매/진외내종형제자매
sl: drugi bratranec/sestrična

# grandmother’s sister’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 진외이종자매/진외이내종자매
sl: druga sestrična

# grandmother’s sister’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 진외이종형제/진외이내종형제
sl: drugi bratranec

# grandmother’s sister’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 진외이종형제자매/진외이내종형제자매
sl: drugi bratranec/sestrična

# grandmother’s sibling’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 진외종자매/진외내종자매/진외이종자매/진외이내종자매
sl: druga sestrična

# grandmother’s sibling’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 진외종형제/진외내종형제/진외이종형제/진외이내종형제
sl: drugi bratranec

# grandmother’s sibling’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 진외종형제자매/진외내종형제자매/진외이종형제자매/진외이내종형제자매
sl: drugi bratranec/sestrična

# grandparent’s brother’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 재종자매/내재종자매/진외종자매/진외내종자매
sl: druga sestrična

# grandparent’s brother’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 재종형제/내재종형제/진외종형제/진외내종형제
sl: drugi bratranec

# grandparent’s brother’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제자매/내재종형제자매/진외종형제자매/진외내종형제자매
sl: drugi bratranec/sestrična

# grandparent’s sister’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 내재종자매/내내재종자매/진외이종자매/진외이내종자매
sl: druga sestrična

# grandparent’s sister’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 내재종형제/내내재종형제/진외이종형제/진외이내종형제
sl: drugi bratranec

# grandparent’s sister’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 내재종형제자매/내내재종형제자매/진외이종형제자매/진외이내종형제자매
sl: drugi bratranec/sestrična

# grandparent’s sibling’s granddaughter
source: second cousin
cy: ail gyfnither
hy: երկրորդ զարմիկ
ko: 재종자매/내재종자매/내내재종자매/진외종자매/진외내종자매/진외이종자매/진외이내종자매
sl: druga sestrična

# grandparent’s sibling’s grandson
source: second cousin
cy: ail gefnder
hy: երկրորդ զարմիկ
ko: 재종형제/내재종형제/내내재종형제/진외종형제/진외내종형제/진외이종형제/진외이내종형제
sl: drugi bratranec

# grandparent’s sibling’s grandchild
source: second cousin
cy: ail gefnder/cyfnither
hy: երկրորդ զարմիկ
ko: 재종형제자매/내재종형제자매/내내재종형제자매/진외종형제자매/진외내종형제자매/진외이종형제자매/진외이내종형제자매
sl: drugi bratranec/sestrična

# great-grandfather’s brother
source: great-great-uncle
cy: gorhenewyrth
hy: մեծ-մեծ հորեղբայր
ko: 종중조부
sl: praprastric

# great-grandmother’s brother
source: great-great-uncle
cy: gorhenewyrth
hy: մեծ-մեծ հորեղբայր
ko: 진외종조부
sl: praprastric

# great-grandparent’s brother
source: great-great-uncle
cy: gorhenewyrth
hy: մեծ-մեծ հորեղբայր
ko: 종증조부
sl: praprastric

source: great-great-aunt
cy: gorhenfodryb
hy: մեծ-մեծ մորաքույր
ko: 왕대고모(王大姑母),진외증존이모(陳外曾尊姨母)/외증존고모(外曾外尊姑母)/외외증존이모(外外曾尊姨母)
sl: praprateta

source: great-great-aunt/uncle
cy: gorhenfodryb/ewyrth
hy: մեծ-հորաքույր/հորեղբայր
ko: 왕대고모(王大姑母),진외증존이모(陳外曾尊姨母)/외증존고모(外曾外尊姑母)/외외증존이모(外外曾尊姨母)/증종조부(曾從祖父)/진외증종조부((陳外曾從祖父)/외외증종조부(外外曾從祖父)
sl: praprastric/praprateta

# great-great-grandfather’s brother
source: great-great-great-uncle
cy: gorgorhenewythr
hy: մեծ-մեծ-մեծ-հորեղբայր
ko: 종고조부
sl: prapraprastric

# great-great-grandmother’s brother
source: great-great-great-uncle
cy: gorgorhenewythr
hy: մեծ-մեծ-մեծ-հորեղբայր
ko: 진외종고조부
sl: prapraprastric

# great-great-grandparent’s brother
source: great-great-great-uncle
cy: gorgorhenewythr
hy: մեծ-մեծ-մեծ-հորեղբայր
ko: 종조부/진외종조부
sl: prapraprastric

source: great-great-great-aunt
cy: gorgorhenfodryb
hy: մեծ-մեծ-մեծ մորաքույր
ko: 고대고모(高大姑母),진증외고존이모(陳曾外高尊姨母)/외증외고존고모(外曾外高尊姑母)/외외증외고존이모(外外曾尊高姨母)
sl: prapraprateta

source: great-great-great-aunt/uncle
cy: gorgorhenfodryb/ewythr
hy: մեծ-մեծ-մեծ մորաքույր/հորեղբայր
ko: 고대고모(高大姑母)/종고조부(從高祖父)
sl: prapraprastric/prapraprateta

# great-great-great-grandfather’s brother
source: great ×4 uncle
cy: ×4 gorewythr
hy: մեծ ×4 հորեղբայր
ko: 종현조부(從玄祖父)
ne: महान ×4 काका
sl: 4 × prastric

# great-great-great-grandmother’s brother
source: great ×4 uncle
cy: ×4 gorewythr
hy: մեծ ×4 հորեղբայր
ko: 진외종현조부
ne: महान ×4 काका
sl: 4 × prastric

# great-great-great-grandparent’s brother
source: great ×4 uncle
cy: ×4 gorewythr
hy: մեծ ×4 հորեղբայր
ko: 종현조부/진외종현조부
ne: महान ×4 काका
sl: 4 × prastric

source: great ×4 aunt
cy: ×4 gorfodryb
hy: մեծ ×4 մորաքույր
ko: 현대고모(玄大姑母)
ne: महान ×4 काकी
sl: 4 × prateta

source: great ×4 aunt/uncle
cy: ×4 gorfodryb/gotewythr
hy: մեծ ×4 մորաքույր / հորեղբայր
ko: 현대고모(玄大姑母)/종현조부(從玄祖父)
ne: महान ×4 काकी/काका
sl: 4 × prastric/prateta

# great ×4 grandfather’s brother
source: great ×5 uncle
cy: ×5 gorewythr
hy: մեծ ×5 հորեղբայր
ko: 종6대조부(從6代祖父)
ne: महान ×5 काका
sl: 5 × prastric

# great ×4 grandmother’s brother
source: great ×5 uncle
cy: ×5 gorewythr
hy: մեծ ×5 հորեղբայր
ko: 진외종현조부
ne: महान ×5 काका
sl: 5 × prastric

# great ×4 grandparent’s brother
source: great ×5 uncle
cy: ×5 gorewythr
hy: մեծ ×5 հորեղբայր
ko: 종현조부/진외종현조부
ne: महान ×5 काका
sl: 5 × prastric

source: great ×5 aunt
cy: ×5 gorfodryb
hy: մեծ × 5 մորաքույր
ko: 현대고모(玄大姑母)
ne: महान ×5 काकी
sl: 5 × prateta

source: great ×5 aunt/uncle
cy: ×5 gorfodryb/ewythr
hy: մեծ × 5 մորաքույր / հորեղբայր
ko: 6代(대) 대고모/종조부
ne: महान ×5 काकी/काका
sl: 5 × prastric/prateta

# great ×5 grandfather’s brother
source: great ×6 uncle
cy: ×6 gorewythr
hy: մեծ ×6 հորեղբայր
ko: 종6대조부(從6代祖父)
sl: 6 × prastric

# great ×5 grandmother’s brother
source: great ×6 uncle
cy: ×6 gorewythr
hy: մեծ ×6 հորեղբայր
ko: 진외6대종조부
sl: 6 × prastric

# great ×5 grandparent’s brother
source: great ×6 uncle
cy: ×6 gorewythr
hy: մեծ ×6 հորեղբայր
ko: 종6대조부/진외종6대조부
sl: 6 × prastric

source: great ×6 aunt
cy: ×6 gorfodryb
hy: մեծ × 6 մորաքույր
ko: 6대 대고모
ne: महान ×6 काकी
sl: 6 × prateta

source: great ×6 aunt/uncle
cy: ×6 gorfodryb/ewythr
hy: մեծ ×6 մորաքույր / հորեղբայր
ko: 6대 대고모/종6대조부
ne: महान ×6 काकी/काका
sl: 6 × prastric/prateta

# great ×6 grandfather’s brother
source: great ×7 uncle
cy: ×7 gorewyrth
hy: մեծ ×7 հորեղբայր
ko: 종9대조부
sl: 7 × prastric

# great ×6 grandmother’s brother
source: great ×7 uncle
cy: ×7 gorewyrth
hy: մեծ ×7 հորեղբայր
ko: 진외종9대조부
sl: 7 × prastric

# great ×6 grandparent’s brother
source: great ×7 uncle
cy: ×7 gorewyrth
hy: մեծ ×7 հորեղբայր
ko: 종9대조부/진외종9대조부
sl: 7 × prastric

source: great ×7 aunt
cy: ×7 gorfodryb
hy: մեծ × 7 մորաքույր
ko: 7대 대고모
sl: 7 × prateta

source: great ×7 aunt/uncle
cy: ×7 gorfodryb/ewyrth
hy: մեծ × 7 մորաքույր / հորեղբայր
ko: 7대 대고모/종7대조부
sl: 7 × prastric/prateta

source: great ×%s uncle
cy: ×%s gorewyrth
hy: մեծ ×%s հորեղբայր
ko: 종%s대조부(從◇代祖父)
ne: महान ×%s काका
sl: %s × prastric

source: great ×%s aunt
cy: ×%s henfodryb
hy: մեծ ×%s մորաքույր
ko: %s代(대) 대고모(大姑母)
ne: महान ×%s काकी
sl: %s × prateta

source: great ×%s aunt/uncle
cy: ×%s henfodryb/henewythr
hy: մեծ ×%s մորաքույր/հորեղբայր
ko: %s代(대) 대고모(大姑母)/종조부(從祖父)
ne: महान ×%s काकी/काका
sl: %s × prastric/prateta

# great ×(%s-1) grandfather’s brother
source: great ×%s uncle
cy: ×%s gorewyrth
hy: մեծ ×%s հորեղբայր
ko: 종%s대조부(從◇代祖父)
ne: महान ×%s काका
sl: %s × prastric

# great ×(%s-1) grandmother’s brother
source: great ×%s uncle
cy: ×%s gorewyrth
hy: մեծ ×%s հորեղբայր
ko: 진외종%s대조부
ne: महान ×%s काका
sl: %s × prastric

# great ×(%s-1) grandparent’s brother
source: great ×%s uncle
cy: ×%s gorewyrth
hy: մեծ ×%s հորեղբայր
ko: %s代(대) 종조부((從祖父)/진외종조부(陳外從祖父)
ne: महान ×%s काका
sl: %s × prastric

# (a man’s) brother’s great-grandson
source: great-great-nephew
cy: gorhennai
hy: մեծ եղբորորդի
ko: 재종손자
sl: prapranečak

# (a man’s) sister’s great-grandson
source: great-great-nephew
cy: gorhennai
hy: մեծ եղբորորդի
ko: 내재종손자
sl: prapranečak

# (a woman’s) great-great-nephew
source: great-great-nephew
cy: gorhennai
hy: մեծ եղբորորդի
ko: 내재종손자
sl: prapranečak

# (a man’s) brother’s great-granddaughter
source: great-great-niece
cy: gorhennith
hy: մեծ-մեծ զարմուհի
ko: 재종손녀
sl: prapranečakinja

# (a man’s) sister’s great-granddaughter
source: great-great-niece
cy: gorhennith
hy: մեծ-մեծ զարմուհի
ko: 내재종손녀
sl: prapranečakinja

# (a woman’s) great-great-niece
source: great-great-niece
cy: gorhennith
hy: մեծ-մեծ զարմուհի
ko: 내재종손
sl: prapranečakinja

# (a man’s) brother’s great-grandchild
source: great-great-nephew/niece
cy: gorhennain/nith
hy: մեծ-մեծ-եղբորորդին / զարմուհին
ko: 내종손
sl: prapranečak/prapranečakinja

# (a man’s) sister’s great-grandchild
source: great-great-nephew/niece
cy: gorhennain/nith
hy: մեծ-մեծ-եղբորորդին / զարմուհին
ko: 내재종손
sl: prapranečak/prapranečakinja

# (a woman’s) great-great-nephew/niece
source: great-great-nephew/niece
cy: gorhennain/nith
hy: մեծ-մեծ-եղբորորդին / զարմուհին
ko: 내재종손
sl: prapranečak/prapranečakinja

# (a man’s) brother’s great-great-grandson
source: great-great-great-nephew
cy: gorgorhennai
hy: մեծ-մեծ-մեծ եղբորորդի
ko: 삼종손자
sl: praprapranečak

# (a man’s) sister’s great-great-grandson
source: great-great-great-nephew
cy: gorgorhennai
hy: մեծ-մեծ-մեծ եղբորորդի
ko: 내삼종손자
sl: praprapranečak

# (a woman’s) great-great-great-nephew
source: great-great-great-nephew
cy: gorgorhennai
hy: մեծ-մեծ-մեծ եղբորորդի
ko: 내삼종손자
sl: praprapranečak

# (a man’s) brother’s great-great-granddaughter
source: great-great-great-niece
cy: gorgorhennith
hy: մեծ-մեծ-մեծ զարմուհի
ko: 삼종손녀
sl: praprapranečakinja

# (a man’s) sister’s great-great-granddaughter
source: great-great-great-niece
cy: gorgorhennith
hy: մեծ-մեծ-մեծ զարմուհի
ko: 내삼종손녀
sl: praprapranečakinja

# (a woman’s) great-great-great-niece
source: great-great-great-niece
cy: gorgorhennith
hy: մեծ-մեծ-մեծ զարմուհի
ko: 내삼종손녀
sl: praprapranečakinja

# (a man’s) brother’s great-great-grandchild
source: great-great-great-nephew/niece
cy: gorgorhennai/nith
hy: մեծ-մեծ-մեծ-եղբորորդի/եղբորորդի
ko: 삼종손
sl: praprapranečak/praprapranečakinja

# (a man’s) sister’s great-great-grandchild
source: great-great-great-nephew/niece
cy: gorgorhennai/nith
hy: մեծ-մեծ-մեծ-եղբորորդի/եղբորորդի
ko: 내삼종손
sl: praprapranečak/praprapranečakinja

# (a woman’s) great-great-great-nephew/niece
source: great-great-great-nephew/niece
cy: gorgorhennai/nith
hy: մեծ-մեծ-մեծ-եղբորորդի/եղբորորդի
ko: 내삼종손
sl: praprapranečak/praprapranečakinja

# (a man’s) brother’s great-great-great-grandson
source: great ×4 nephew
cy: ×4 gornai
hy: մեծ × 4 եղբորորդին
ko: 내종손(來從孫)
ne: महान ×4 भतिजा
sl: 4 × pranečak

# (a man’s) sister’s great-great-great-grandson
source: great ×4 nephew
cy: ×4 gornai
hy: մեծ × 4 եղբորորդին
ko: 내이손(來離孫)
ne: महान ×4 भतिजा
sl: 4 × pranečak

# (a woman’s) great ×4 nephew
source: great ×4 nephew
cy: ×4 gornai
hy: մեծ × 4 եղբորորդին
ko: 내이손(來離孫)
ne: महान ×4 भतिजा
sl: 4 × pranečak

# (a man’s) brother’s great-great-great-granddaughter
source: great ×4 niece
cy: ×4 gornith
hy: մեծ × 4 զարմուհին
ko: 내종손녀(來從孫女)
ne: महान ×4 भतिजी
sl: 4 × pranečakinja

# (a man’s) sister’s great-great-great-granddaughter
source: great ×4 niece
cy: ×4 gornith
hy: մեծ × 4 զարմուհին
ko: 내이손녀(來離孫女)
ne: महान ×4 भतिजी
sl: 4 × pranečakinja

# (a woman’s) great ×4 niece
source: great ×4 niece
cy: ×4 gornith
hy: մեծ × 4 զարմուհին
ko: 내이손녀(來離孫女)
ne: महान ×4 भतिजी
sl: 4 × pranečakinja

# (a man’s) brother’s great-great-great-grandchild
source: great ×4 nephew/niece
cy: ×4 gornai/gornith
hy: մեծ ×4 եղբորորդին / զարմուհին
ko: 내종손(來從孫)
ne: महान ×4 भतिजा/भतिजी
sl: 4 × pranečak/pranečakinja

# (a man’s) sister’s great-great-great-grandchild
source: great ×4 nephew/niece
cy: ×4 gornai/gornith
hy: մեծ ×4 եղբորորդին / զարմուհին
ko: 내이손(來離孫)
ne: महान ×4 भतिजा/भतिजी
sl: 4 × pranečak/pranečakinja

# (a woman’s) great ×4 nephew/niece
source: great ×4 nephew/niece
cy: ×4 gornai/gornith
hy: մեծ ×4 եղբորորդին / զարմուհին
ko: 내종손(來從孫)
ne: महान ×4 भतिजा/भतिजी
sl: 4 × pranečak/pranečakinja

# (a man’s) brother’s great ×4 grandson
source: great ×5 nephew
cy: ×5 gornai
hy: մեծ × 5 եղբորորդին
ko: 5종손자
ne: महान ×5 भतिजा
sl: 5 × pranečak

# (a man’s) sister’s great ×4 grandson
source: great ×5 nephew
cy: ×5 gornai
hy: մեծ × 5 եղբորորդին
ko: 내5종손
ne: महान ×5 भतिजा
sl: 5 × pranečak

# (a woman’s) great ×5 nephew
source: great ×5 nephew
cy: ×5 gornai
hy: մեծ × 5 եղբորորդին
ko: 5종손/내5종손
ne: महान ×5 भतिजा
sl: 5 × pranečak

# (a man’s) brother’s great ×4 granddaughter
source: great ×5 niece
cy: ×5 gornith
hy: մեծ × 5 զարմուհի
ko: 5종손녀
ne: महान ×5 भतिजी
sl: 5 × pranečakinja

# (a man’s) sister’s great ×4 granddaughter
source: great ×5 niece
cy: ×5 gornith
hy: մեծ × 5 զարմուհի
ko: 내5종손녀
ne: महान ×5 भतिजी
sl: 5 × pranečakinja

# (a woman’s) great ×5 niece
source: great ×5 niece
cy: ×5 gornith
hy: մեծ × 5 զարմուհի
ko: 5종손녀
ne: महान ×5 भतिजी
sl: 5 × pranečakinja

# (a man’s) brother’s great ×4 grandchild
source: great ×5 nephew/niece
cy: ×5 gornai/gornith
hy: մեծ × 5 եղբորորդին / զարմուհին
ko: 5종손
ne: महान ×5 भतिजा/भतिजी
sl: 5 × pranečak/pranečakinja

# (a man’s) sister’s great ×4 grandchild
source: great ×5 nephew/niece
cy: ×5 gornai/gornith
hy: մեծ × 5 եղբորորդին / զարմուհին
ko: 내5종손
ne: महान ×5 भतिजा/भतिजी
sl: 5 × pranečak/pranečakinja

# (a woman’s) great ×5 nephew/niece
source: great ×5 nephew/niece
cy: ×5 gornai/gornith
hy: մեծ × 5 եղբորորդին / զարմուհին
ko: 5종손/내5종손
ne: महान ×5 भतिजा/भतिजी
sl: 5 × pranečak/pranečakinja

# (a man’s) brother’s great ×(%s-1) grandson
source: great ×%s nephew
cy: ×%s gorwyr
hy: մեծ ×%s զարմիկ
ko: %s종손자(從孫子)
ne: महान ×%s भतिजा
sl: %s × pranečak

# (a man’s) sister’s great ×(%s-1) grandson
source: great ×%s nephew
cy: ×%s gorwyr
hy: մեծ ×%s զարմիկ
ko: 내%s종손자(內從◎孫子)
ne: महान ×%s भतिजा
sl: %s × pranečak

# (a woman’s) great ×%s nephew
source: great ×%s nephew
cy: ×%s gorwyr
hy: մեծ ×%s զարմիկ
ko: %s종손자(◇從孫子)
ne: महान ×%s भतिजा
sl: %s × pranečak

# (a man’s) brother’s great ×(%s-1) granddaughter
source: great ×%s niece
cy: ×%s gornith
hy: մեծ ×%s զարմուհի
ko: %s종손녀(◇從孫女)
ne: महान ×%s भान्जी
sl: %s × pranečakinja

# (a man’s) sister’s great ×(%s-1) granddaughter
source: great ×%s niece
cy: ×%s gornith
hy: մեծ ×%s զարմուհի
ko: 내%s종손녀(內◇從孫女)
ne: महान ×%s भान्जी
sl: %s × pranečakinja

# (a woman’s) great ×%s niece
source: great ×%s niece
cy: ×%s gornith
hy: մեծ ×%s զարմուհի
ko: %s종손녀(◇從孫女))
ne: महान ×%s भान्जी
sl: %s × pranečakinja

# (a man’s) brother’s great ×(%s-1) grandchild
source: great ×%s nephew/niece
cy: ×%s gorwyr/gornith
hy: մեծ ×%s եղբորորդին / զարմուհին
ko: %s종손(◇從孫)/내종손(內◇從孫)
ne: महान ×%s भतिजा/भतिजी
sl: %s × pranečak/pranečakinja

# (a man’s) sister’s great ×(%s-1) grandchild
source: great ×%s nephew/niece
cy: ×%s gorwyr/gornith
hy: մեծ ×%s եղբորորդին / զարմուհին
ko: 내%s종손(內◇從孫)
ne: महान ×%s भतिजा/भतिजी
sl: %s × pranečak/pranečakinja

# (a woman’s) great ×%s nephew/niece
source: great ×%s nephew/niece
cy: ×%s gorwyr/gornith
hy: մեծ ×%s եղբորորդին / զարմուհին
ko: 내%s종손(內◇從孫)
ne: महान ×%s भतिजा/भतिजी
sl: %s × pranečak/pranečakinja

source: great ×%s nephew
cy: ×%s gorwyr
hy: մեծ ×%s զարմիկ
ko: %s종손(從孫)
ne: महान ×%s भतिजा
sl: %s × pranečak

source: great ×%s niece
cy: ×%s gornith
hy: մեծ ×%s զարմուհի
ko: %s종손녀(◇從孫女)
ne: महान ×%s भान्जी
sl: %s × pranečakinja

source: great ×%s nephew/niece
cy: ×%s gorwyr/gornith
hy: մեծ ×%s եղբորորդին / զարմուհին
ko: %s종손(◇從孫)/내종손(內◇從孫)
ne: महान ×%s भतिजा/भतिजी
sl: %s × pranečak/pranečakinja

source: great-great-grandfather
cy: gorgorhendaid
hy: նախապապ
ko: 고조부(高祖父)
sl: prapradedek

source: great-great-grandmother
cy: gorgorhennain
hy: մեծ տատիկ
ko: 고조모(高祖母)
sl: praprababica

source: great-great-grandparent
cy: gorgorhenriant
hy: նախապապ
ko: 고조부모(高祖父母)
sl: prapradedek/praprababica

source: great-great-great-grandfather
cy: gorgorhendaid
hy: նախապապ-նախապապ
ko: 현조부(玄祖父)
sl: praprapradedek

source: great-great-great-grandmother
cy: gorgorhennain
hy: մեծ-մեծ տատիկ
ko: 현조모(玄祖母)
sl: prapraprababica

source: great-great-great-grandparent
cy: gorgorgorhenriant
hy: նախապապ-նախապապ
ko: 현조(玄祖)
sl: praprapradedek/prapraprababica

source: great ×4 grandfather
cy: ×4 hendaid
hy: մեծ × 4 պապիկ
ko: 6대조부(代祖父)
ne: महान ×4 हजुरबुबा
sl: 4 × pradedek

source: great ×4 grandmother
cy: ×4 hennain
hy: մեծ × 4 տատիկ
ko: 6대조모(代祖母)
ne: महान ×4 हजुरआमा
sl: 4 × prababica

source: great ×4 grandparent
cy: ×4 gor hen riant
hy: մեծ × 4 տատիկ ու պապիկ
ko: 6代(대)조부(代祖父母)
ne: महान ×4 हजुरबुबा
sl: 4 × pradedek/prababica

source: great ×5 grandfather
cy: ×5 hentaid
hy: մեծ × 5 պապիկ
ko: 7代(대) 조부(祖父)
ne: महान ×5 हजुरबुबा
sl: 5 × pradedek

source: great ×5 grandmother
cy: ×5 hennain
hy: մեծ × 5 տատիկ
ko: 7代(대) 조모(祖母)
ne: महान ×5 हजुरआमा
sl: 5 × prababica

source: great ×5 grandparent
cy: ×5 gorgorriant
hy: մեծ × 5 տատիկ ու պապիկ
ko: 7代祖대조)
ne: महान ×5 हजुरबुबा
sl: 5 × pradedek/prababica

source: great ×6 grandfather
cy: ×6 hendaid
hy: մեծ × 6 պապիկ
ko: 8代(대) 조부(祖父)
ne: महान ×6 हजुरबुबा
sl: 6 × pradedek

source: great ×6 grandmother
cy: ×6 hennain
hy: մեծ × 6 տատիկ
ko: 8代(대) 조모(祖)
ne: महान ×6 हजुरआमा
sl: 6 × prababica

source: great ×6 grandparent
cy: ×6 gorriant
hy: մեծ × 6 տատիկ ու պապիկ
ko: 8代祖(8대조)
ne: महान ×6 हजुरबुवा/हजुरआमा
sl: 6 × pradedek/prababica

source: great ×7 grandfather
cy: ×7 hendaid
hy: մեծ × 7 պապիկ
ko: 9代(대) 조부(孫父)
sl: 7 × pradedek

source: great ×7 grandmother
cy: ×7 hennain
hy: մեծ × 7 տատիկ
ko: 9代(대) 조모(孫母)
sl: 7 × prababica

source: great ×7 grandparent
cy: ×7 gorriant
hy: մեծ × 7 պապիկ
ko: 9代(대) 조부모(孫父母)
sl: 7 × pradedek/prababica

source: great ×%s grandfather
cy: ×%s gorhendad
hy: մեծ ×%s պապիկ
ko: %s代(대) 조부(祖父)
ne: महान ×%s हजुरबुबा
sl: %s × pradedek

source: great ×%s grandmother
cy: ×%s gorhenfam
hy: մեծ ×%s տատիկ
ko: %s代(대) 조모(祖母)
ne: महान ×%s हजुरआमा
sl: %s × prababica

source: great ×%s grandparent
cy: ×%s gorhenriant
hy: մեծ ×%s պապիկ
ko: %s대조(代祖)
ne: महान ×%s हजुरबुबा/हजुरआमा
sl: %s × pradedek/prababica

source: great-great-grandson
cy: gorgorhenwyr
hy: ծոռ
ko: 현손자(玄孫子)
sl: prapravnuk

source: great-great-granddaughter
cy: gorgorhenwyres
hy: ծոռնուհին
ko: 현손녀(玄孫女)
sl: prapravnukinja

source: great-great-grandchild
cy: gorgorhenwyr/wyres
hy: ծոռ
ko: 현손(玄孫)
sl: prapravnuk/prapravnukinja

source: great-great-great-grandson
cy: gorgorhenwyr
hy: ծոռ-ծոռ
ko: 내손자(來孫子)
sl: praprapravnuk

source: great-great-great-granddaughter
cy: gorgorhenwyres
hy: ծոռ-ծոռ
ko: 내손녀(來孫女)
sl: praprapravnukinja

source: great-great-great-grandchild
cy: gorgorhenwyr/wyres
hy: ծոռ-ծոռ
ko: 내손(來孫)
sl: praprapravnuk/praprapravnukinja

source: great ×4 grandson
cy: ×4 gorwyr
hy: մեծ × 4 թոռ
ko: 내손자(來孫子)
ne: महान ×4 नाति
sl: 4 × pravnuk

source: great ×4 granddaughter
cy: ×4 hen orwyres
hy: մեծ × 4 թոռնուհի
ko: 내손녀(來孫女)
ne: महान ×4 नातिनी
sl: 4 × pravnukinja

source: great ×4 grandchild
cy: ×4 gorfodryb
hy: մեծ × 4 թոռ
ko: 내손(來孫)
ne: महान ×4 नातिनातिना
sl: 4 × pravnuk/pravnukinja

source: great ×5 grandson
cy: ×5 gorgorwyr
hy: մեծ × 5 թոռ
ko: 곤손자(昆孫子)
ne: महान ×5 नाति
sl: 5 × pravnuk

source: great ×5 granddaughter
cy: ×5 gorwyres
hy: մեծ × 5 թոռնուհի
ko: 곤손녀(昆孫女)
ne: महान × 5 नातिनी
sl: 5 × pravnukinja

source: great ×5 grandchild
cy: ×5 gorwyr/gorwyres
hy: մեծ × 5 թոռ
ko: 곤손(昆孫)
ne: महान ×5 नातिनातिना
sl: 5 × pravnuk/pravnukinja

source: great ×6 grandson
cy: ×6 gorwyr
hy: մեծ × 6 թոռ
ko: 잉손자(仍孫子)
sl: 6 × pravnuk

source: great ×6 granddaughter
cy: ×6 gorwyres
hy: մեծ × 6 թոռնուհի
ko: 잉손녀(仍孫女)
ne: महान × 6 नातिनी
sl: 6 × pravnukinja

source: great ×6 grandchild
cy: ×6 gorwyr/gorwyres
hy: մեծ × 6 թոռ
ko: 잉손(仍孫)
ne: महान ×6 नातिनातिना
sl: 6 × pravnuk/pravnukinja

source: great ×7 grandson
cy: ×7 gorwyr
hy: մեծ × 7 թոռ
ko: 9代(대) 손자(孫子)
sl: 7 × pravnuk

source: great ×7 granddaughter
cy: ×7 gorwyres
hy: մեծ × 7 թոռնուհի
ko: 9代 손녀
sl: 7 × pravnukinja

source: great ×7 grandchild
cy: ×7 gorwyr
hy: մեծ × 7 թոռ
ko: 9代孫(9대손)
sl: 7 × pravnuk/pravnukinja

source: great ×%s grandson
cy: ×%s gorhenfab
hy: մեծ ×%s թոռ
ko: %s代(대) 손자(孫子)
ne: महान ×%s नाति
sl: %s × pravnuk

source: great ×%s granddaughter
cy: ×%s gorwyres
hy: մեծ ×%s թոռնուհի
ko: %s代(대) 손녀(孫女)
ne: महान ×%s नातिनी
sl: %s × pravnukinja

source: great ×%s grandchild
cy: ×%s gorwyr/gorwyres
hy: մեծ ×%s թոռ
ko: %s代(대) 손(孫)
ne: महान ×%s नातिनातिना
sl: %s × pravnuk/pravnukinja

source: %s once removed ascending
cy: %s gradd un esgynnol
hy: %s-ը մեկ անգամ հեռացվել է աճով
ko: %s 의 한 단계 오름차순 제거
ne: %s एक पटक बढ्दो क्रममा हटाइयो
sl: %s enkrat zamaknjen naraščajoče

source: %s once removed descending
cy: %s gradd un disgynnol
hy: %s-ը մեկ անգամ հեռացվել է նվազմամբ
ko: %s 의 한단계 내림차순으로 제거
ne: %s एक पटक घट्दो क्रममा हटाइयो
sl: %s enkrat zamaknjen padajoče
