Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: %s year
cy: %s blynyddoedd
hy: %s տարի
ko: %s 세
ne: %s वर्ष
sl: %s leto

source: %s month
cy: %s misoedd
hy: %s ամիս
ko: %s 월
ne: %s महिना
sl: %s mesec

source: %s day
cy: %s diwrnodau
hy: %s օր
ko: %s 일
ne: %s दिन
sl: %s dan

source: This family does not exist or you do not have permission to view it.
cy: Nid yw'r teulu hwn yn bodoli neu nid oes gennych ganiatâd i'w weld.
hy: Այս ընտանիքը բազայում չկա, կամ դուք այն դիտելու իրավունք չունեք։
ko: 이 가족이 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो परिवार अवस्थित छैन वा तपाईंसँग यसलाई हेर्ने अनुमति छैन।
sl: Ta družina ne obstaja ali pa nimate dovoljenja za ogled.

source: This record does not exist or you do not have permission to view it.
cy: Nid yw'r cofnod hwn yn bodoli neu nid oes gennych ganiatâd i'w weld.
hy: Այս գրանցումը բազայում չկա, կամ դուք այն դիտելու իրավունք չունեք։
ko: 이 레코드가 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो रेकर्ड अवस्थित छैन वा तपाईंसँग यसलाई हेर्ने अनुमति छैन।
sl: Ta zapis ne obstaja ali pa nimate dovoljenja za ogled.

source: This individual does not exist or you do not have permission to view it.
cy: Nid yw'r unigolyn hwn yn bodoli neu nid oes gennych ganiatâd i'w weld.
hy: Այս անձը բազայում չկա, կամ դուք այն դիտելու իրավունք չունեք։
ko: 이 인물이 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो व्यक्ति अवस्थित छैन वा तपाईंसँग यसलाई हेर्ने अनुमति छैन।
sl: Ta oseba ne obstaja ali pa nimate dovoljenja za ogled.

source: This media object does not exist or you do not have permission to view it.
cy: Nid yw'r gwrthrych cyfryngau hwn yn bodoli neu nid oes gennych ganiatâd i'w weld.
hy: Այս մեդիա օբյեկտը բազայում չկա, կամ դուք այն դիտելու իրավունք չունեք։
ko: 이 미디어 개체가 없거나 볼 수있는 권한이 없습니다.
ne: यो मिडिया वस्तु अवस्थित छैन वा तपाइँसँग यसलाई हेर्नको लागि अनुमति छैन।
sl: Ta medijski predmet ne obstaja ali pa nimate dovoljenja za ogled.

source: This note does not exist or you do not have permission to view it.
cy: Nid yw'r nodyn hwn yn bodoli neu nid oes gennych ganiatâd i'w weld.
hy: Այս նշումը բազայում չկա, կամ դուք այն դիտելու իրավունք չունեք։
ko: 이 노트는 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो नोट अवस्थित छैन वा तपाईंसँग यसलाई हेर्ने अनुमति छैन।
sl: Ta opomba ne obstaja ali pa nimate dovoljenja za ogled.

source: This repository does not exist or you do not have permission to view it.
cy: Nid yw'r storfan hon yn bodoli neu nid oes gennych ganiatâd i'w gweld.
hy: Այս պահոցը գոյություն չունի կամ դուք այն դիտելու թույլտվություն չունեք:
ko: 이 저장소가 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो भण्डार अवस्थित छैन वा तपाइँसँग यसलाई हेर्ने अनुमति छैन।
sl: To skladišče ne obstaja ali pa nimate dovoljenja za ogled.

source: This source does not exist or you do not have permission to view it.
cy: Nid yw'r ffynhonnell hon yn bodoli neu nid oes gennych ganiatâd i'w gweld.
hy: Այս աղբյուրը գոյություն չունի կամ դուք այն դիտելու թույլտվություն չունեք:
ko: 이 출처가 존재하지 않거나 볼 수있는 권한이 없습니다.
ne: यो स्रोत अवस्थित छैन वा तपाईंसँग यसलाई हेर्ने अनुमति छैन।
sl: Ta vir ne obstaja ali pa nimate dovoljenja za ogled.

source: Show to visitors
cy: Dangos i ymwelwyr
hy: Ցույց տալ այցելուներին
ko: 방문자에게 표시
ne: आगन्तुकहरूलाई देखाउनुहोस्
sl: Prikaži obiskovalcem

source: Show to members
cy: Dangos i aelodau
hy: Ցույց տալ անդամներին
ko: 회원에게 표시
ne: सदस्यहरूलाई देखाउनुहोस्
sl: Prikaži članom

source: Show to managers
cy: Dangos i reolwyr
hy: Ցույց տալ ղեկավարներին
ko: 관리자에게 표시
ne: प्रबन्धकहरूलाई देखाउनुहोस्
sl: Prikaži upraviteljem

source: Hide from everyone
cy: Cuddio rhag pawb
hy: Թաքցնել բոլորից
ko: 모든 사람에게 숨기기
ne: सबैबाट लुकाउनुहोस्
sl: Skrij pred vsemi

source: Civil marriage
cy: Priodas sifil
hy: Քաղաքացիական ամուսնություն
ko: 시민 결혼
ne: नागरिक विवाह
sl: Civilna poroka

source: Registered partnership
cy: Partneriaeth gofrestredig
hy: Գրանցված գործընկերություն
ko: 법적결혼관계(결혼식 없이 혼인신고로만 이뤄진 결혼)
ne: दर्तावाल पार्टनरसिप
sl: Registrirano partnerstvo

source: Religious marriage
cy: Priodas grefyddol
hy: Կրոնական ամուսնություն
ko: 종교예식 결혼
ne: धार्मिक विवाह
sl: Cerkvena poroka

source: Marriage
cy: Priodas
hy: Ամուսնություն
ko: 결혼
ne: विवाह
sl: Poroka

source: Address
cy: Cyfeiriad
hy: Հասցե
ko: 주소
ne: ठेगाना
sl: Naslov

source: Phone
cy: Ffôn
hy: Հեռախոս
ko: 전화
ne: फोन
sl: Telefon

source: Email
cy: E-bost
hy: Էլ
ko: 이메일
ne: ईमेल
sl: E-pošta

source: Fax
cy: Ffacs
hy: Ֆաքս
ko: 팩스
ne: फ्याक्स
sl: Faks

source: Time of birth
hy: Ծննդյան ժամանակը
ne: जन्म समय

source: Length
hy: Երկարություն
ne: लम्बाइ

source: Weight
cy: Pwysau
hy: Քաշը
ko: 무게
ne: तौल
sl: Teža

source: Time of death
hy: Մահվան ժամանակը
ne: मृत्युको समय

source: Alternative spelling of surname
hy: Ազգանվան այլընտրանքային ուղղագրություն
ne: वैकल्पिक थर

source: Date
cy: Dyddiad
hy: Ամսաթիվ
ko: 날짜
ne: मिति
sl: Datum

source: Family tree
cy: Cart achau
hy: Տոհմածառ
ko: 가계도
ne: परिवार वृक्ष
sl: Družinsko drevo

source: Note
cy: Nodyn
hy: Նշում
ko: 노트
ne: टिप्पणी
sl: Opomba

source: Record ID number
cy: Cofnodi rhif ID
hy: Գրանցման ID համարը
ko: 레코드 ID 번호
ne: रेकर्ड आईडी नम्बर
sl: ID številka zapisa

source: Ancestry PID
cy: PID Ancestry
hy: Նախնիների PID
ko: 조상 PID
ne: पुर्खा PID

source: Occupation
cy: Galwedigaeth
hy: Զբաղմունք
ko: 직업
ne: पेशा
sl: Poklic

source: Funeral
cy: Angladd
hy: Հուղարկավորություն
ko: 장례식
ne: अन्त्येष्टि
sl: Pogreb

source: LDS initiatory
hy: LDS նախաձեռնություն
ne: LDS पहल

source: Ordination
cy: Ordeiniad
hy: Ձեռնադրութիւն
ko: 서품(안수)
ne: अध्यादेश
sl: Posvečenje

source: Origin
hy: Ծագում
ne: उत्पत्ति

source: Destination
cy: Cyrchfan
hy: Նպատակակետ
ko: 설명
ne: गन्तव्य
sl: Cilj potovanja

source: Place
cy: Lle
hy: Տեղ
ko: 장소
ne: स्थान
sl: Kraj

source: Created at
hy: Ստեղծվել է
ne: मा सिर्जना गरियो

source: Original text
hy: Բնօրինակ տեքստ
ko: 원본 텍스트
ne: मूल पाठ

source: Relationship to father
cy: Perthynas â'r tad
hy: Հարաբերություններ հոր հետ
ko: 아버지와 관계
ne: पितासँगको सम्बन्ध
sl: Sorodstveno razmerje do očeta

source: Relationship to mother
cy: Perthynas â'r fam
hy: Հարաբերություններ մոր հետ
ko: 어머니와 관계
ne: आमासँगको सम्बन्ध
sl: Sorodstveno razmerje do matere

source: Common law marriage
cy: Priodas cyfraith gwlad
hy: Ընդհանուր իրավունքի ամուսնություն
ko: 사실혼
ne: सामान्य कानुनी विवाह
sl: Zunajzakonska zveza

source: Marriage intention
cy: Bwriad priodas
hy: Ամուսնության մտադրություն
ko: 혼인 의사 표현 상태
ne: विवाहको मनसाय
sl: Namen poroke

source: Marriage bond
cy: Cwlwm priodas
hy: Ամուսնական կապ
ko: 혼배성사(가톨릭결혼)
ne: विवाह बन्धन
sl: Zakonska zveza

source: Not married
cy: Heb briod
hy: Ամուսնացած չէ
ko: 결혼하지 않음
ne: विवाह नभएका
sl: Neporočeni

source: Permanent number
cy: Rhif parhaol
hy: Մշտական համար
ko: 영구적인 번호
ne: स्थायी नम्बर
sl: Stalna številka

source: Separated
cy: Gwahanwyd
hy: Առանձնացված
ko: 분리됨
ne: विभाजित
sl: Ločen/a

source: Research task
cy: Tasg ymchwil
hy: Հետազոտական առաջադրանք
ko: 연구 작업
ne: अनुसन्धान कार्य
sl: Raziskovalno opravilo

source: Adopted name
cy: Enw mabwysiedig
hy: Ընդունված անուն
ko: 입양 된 이름
ne: धारण गरेको नाम
sl: Posvojeno ime

source: Also known as
cy: Hefyd yn hysbys fel
hy: Հայտնի է նաև որպես
ko: 으로 알려진
ne: यस्तो पनि भनिन्छ
sl: Znan tudi kot

source: Birth name
cy: Enw geni
hy: Ծննդյան անուն
ko: 출생 이름
ne: जन्म नाम
sl: Rojstno ime

source: Estate name
cy: Enw'r ystâd
hy: Գույքի անվանումը
ko: 사유지 이름
ne: इस्टेट नाम
sl: Ime posestva

source: Hebrew name
cy: Enw Hebraeg
hy: Եբրայերեն անուն
ko: 히브리어 이름
ne: हिब्रू नाम
sl: Hebrejsko ime

source: Adopted by father
cy: Mabwysiadwyd gan y tad
hy: Ընդունվել է հոր կողմից
ko: 아버지에 의해 입양
ne: बुवाद्वारा ग्रहण गरिएको
sl: Posvojil oče

source: Adopted by mother
cy: Mabwysiadwyd gan y fam
hy: Ընդունված մոր կողմից
ko: 어머니에 의해 입양
ne: आमाद्वारा ग्रहण गरिएको
sl: Posvojila mati

source: Brit milah
hy: Բրիտանացի Միլա
ne: ब्रिट मिलाह

source: Date of brit milah
cy: Dyddiad brit milah
hy: Բրիտանական Միլայի ամսաթիվը
ne: ब्रिट मिलह को मिति
sl: Datum brit milah

source: Place of brit milah
cy: Man y brit milah
hy: Բրիթ Միլայի տեղը
ne: ब्रिट मिलह को स्थान
sl: Kraj brit milah

source: Email address
cy: Cyfeiriad e-bost
hy: Էլփոստի հասցե
ko: 이메일 주소
ne: इमेल ठेगाना
sl: E-poštni naslov

source: Eye color
cy: Lliw llygaid
hy: Աչքի գույնը
ko: 눈 색깔
ne: आँखाको रंग
sl: Barva oči

source: Hair color
cy: Lliw gwallt
hy: Մազերի գույն
ko: 머리 색깔
ne: कपालको रंग
sl: Barva las

source: Height
cy: Uchder
hy: Բարձրություն
ko: 키
ne: उचाई
sl: Višina

source: Interment
cy: Claddedigaeth
hy: Հուղարկավորություն
ko: 매장
ne: अन्तरक्रिया
sl: Pokop

source: Medical
cy: Meddygaeth
hy: Բժշկական
ko: 의료 항목
ne: मेडिकल
sl: Zdravstveni

source: Military
cy: Milwrol
hy: Ռազմական
ko: 군
ne: सैन्य
sl: Vojaški

source: Military service
cy: Gwasanaeth milwrol
hy: Զինվորական ծառայություն
ko: 입대(군 복무)
ne: सैन्य सेवा
sl: Vojaška služba

source: Not living
cy: Ddim yn byw
hy: Չապրել
ko: 거주하지 않음
ne: मरिसकेका
sl: Mrtvi

source: Never married
cy: Byth wedi priodi
hy: Երբեք ամուսնացած չէ
ko: 결혼한 적 없음
ne: विवाह नभएको
sl: Nikoli poročen/a

source: Yahrzeit
hy: Յահրզեյթ
ne: यारजेइत

source: Updated at
hy: Թարմացվել է
ne: मा अद्यावधिक गरियो

source: Album
cy: Albwm
hy: Ալբոմ
ko: 앨범
ne: एल्बम

source: File size
cy: Maint ffeil
hy: Ֆայլի չափը
ko: 파일 크기
ne: फाईलको नाप
sl: Velikost datoteke

source: Photo
cy: Llun
hy: Լուսանկարը
ko: 사진
ne: फोटो
sl: Foto

source: Highlighted image
cy: Delwedd wedi'i hamlygu
hy: Ընդգծված պատկեր
ko: 강조 표시된 이미지
ne: हाइलाइट गरिएको छवि
sl: Izpostavljena slika

source: Death of one spouse
cy: Marwolaeth un priod
hy: Ամուսնուց մեկի մահը
ko: 한 배우자의 사망
ne: एक पतिको मृत्यु
sl: Smrt enega partnerja

source: Fact 1
cy: Ffaith 1
hy: Փաստ 1
ko: 정보 1
ne: तथ्य 1
sl: Dejstvo 1

source: Fact 10
cy: Ffaith 10
hy: Փաստ 10
ko: 정보 10
ne: तथ्य 10
sl: Dejstvo 10

source: Fact 11
cy: Ffaith 11
hy: Փաստ 11
ko: 정보 11
ne: तथ्य 11
sl: Dejstvo 11

source: Fact 12
cy: Ffaith 12
hy: Փաստ 12
ko: 정보 12
ne: तथ्य 12
sl: Dejstvo 12

source: Fact 13
cy: Ffaith 13
hy: Փաստ 13
ko: 정보 13
ne: तथ्य 13
sl: Dejstvo 13

source: Fact 2
cy: Ffaith 2
hy: Փաստ 2
ko: 정보 2
ne: तथ्य 2
sl: Dejstvo 2

source: Fact 3
cy: Ffaith 3
hy: Փաստ 3
ko: 정보 3
ne: तथ्य 3
sl: Dejstvo 3

source: Fact 4
cy: Ffaith 4
hy: Փաստ 4
ko: 정보 4
ne: तथ्य 4
sl: Dejstvo 4

source: Fact 5
cy: Ffaith 5
hy: Փաստ 5
ko: 정보 5
ne: तथ्य 5
sl: Dejstvo 5

source: Fact 6
cy: Ffaith 6
hy: Փաստ 6
ko: 정보 6
ne: तथ्य 6
sl: Dejstvo 6

source: Fact 7
cy: Ffaith 7
hy: Փաստ 7
ko: 정보 7
ne: तथ्य 7
sl: Dejstvo 7

source: Fact 8
cy: Ffaith 8
hy: Փաստ 8
ko: 정보 8
ne: तथ्य 8
sl: Dejstvo 8

source: Fact 9
cy: Ffaith 9
hy: Փաստ 9
ko: 정보 9
ne: तथ्य 9
sl: Dejstvo 9

source: Marriage ending status
cy: Statws gorffen priodas
hy: Ամուսնության ավարտի կարգավիճակը
ko: 결혼 종결 상태
ne: विवाह अन्त्य स्थिति
sl: Stanje konca poroke

source: Marriage beginning status
cy: Statws dechrau priodas
hy: Ամուսնության սկզբնական կարգավիճակը
ko: 결혼 시작 상태
ne: विवाह शुरुवात स्थिति
sl: Stanje začetka poroke

source: Separation
cy: Gwahanu
hy: Բաժանում
ko: 분리
ne: अलगाव
sl: Ločeno življenje

source: Schema
cy: Cynllun
hy: Սխեման
ko: 개요
ne: योजना
sl: Shema

source: Family
cy: Teulu
hy: Ընտանիք
ko: 가족
ne: परिवार
sl: Družina

source: Label
hy: Պիտակ
ko: 라벨
ne: लेबल
sl: Oznaka

source: Individual
cy: Unigolyn
hy: Անհատական
ko: 인물
ne: व्यक्ति
sl: Oseba

source: Ancestry.com source identifier
hy: Ancestry.com աղբյուրի նույնացուցիչը
ne: Ancestry.com स्रोत पहिचानकर्ता

source: External link
hy: Արտաքին հղում
ko: 외부 링크
ne: बाह्य लिङ्क

source: Married name
cy: Enw priod
hy: Ամուսնացած անուն
ko: 결혼 후 이름
ne: विवाहित नाम
sl: Poročno ime

source: Circumcision
hy: Թլպատում
ne: सर्कमसिजिअन

source: Cause of death
cy: Achos marwolaeth
hy: Մահվան պատճառ
ko: 사망 원인
ne: मृत्युको कारण
sl: Vzrok smrti

source: Degree
cy: Gradd
hy: աստիճան
ko: 정도(급)
ne: डिग्री
sl: Stopnja izobrazbe

source: DNA markers
cy: Marcwyr DNA
hy: ԴՆԹ մարկերներ
ko: DNA 표지자
ne: डीएनए मार्करहरू
sl: DNK označevalci

source: Namesake
cy: Enwau perthyn
hy: Անվանակից
ko: 동명
ne: नाम
sl: Soimenjak

source: Unknown
cy: Anhysbys
hy: Անհայտ
ko: 알 수 없음
ne: अज्ञात
sl: Neznano

source: Event did not occur
hy: Միջոցառումը տեղի չի ունեցել
ne: घटना घटेको छैन

source: Associate
cy: Cysylltiadau
hy: Գործակից
ko: 관련
ne: सहयोगी
sl: Sodelavec

source: Phrase
hy: Արտահայտություն
ne: वाक्यांश

source: Role
cy: Rôl
hy: Դեր
ko: 역할
ne: भूमिका
sl: Vloga

source: Time
cy: Amser
hy: Ժամանակը
ko: 시간
ne: समय
sl: Čas

source: External identifier
hy: Արտաքին նույնացուցիչ
ne: बाह्य पहिचानकर्ता

source: Type
cy: Math
hy: Տեսակ
ko: 유형
ne: प्रकार
sl: Vrsta

source: Sort date
hy: Տեսակավորել ամսաթիվը
ne: क्रमबद्ध मिति

source: Sort time
hy: Տեսակավորել ժամանակը
ne: क्रमबद्ध समय

source: Shared note
cy: Nodyn sy'n cael ei rannu
hy: Համօգտագործվող նշում
ko: 공유 노트
ne: साझा नोट
sl: Deljena opomba

source: Unique identifier
cy: Dynodwr unigryw
hy: Եզակի նույնացուցիչ
ko: 고유 식별자
ne: अद्वितीय पहिचानकर्ता
sl: Enolični identifikator

source: Creation date
cy: Dyddiad creu
hy: Ստեղծման ամսաթիվը
ko: 생성 날짜
ne: बनाएको मिति
sl: Datum nastanka

source: Creation time
hy: Ստեղծման ժամանակը
ne: निर्माण समय

source: Fact
cy: Ffaith
hy: Փաստ
ko: 정보
ne: तथ्य
sl: Dejstvo

source: Type of fact
cy: Math o ffaith
hy: Փաստի տեսակը
ko: 정보 유형
ne: तथ्यको प्रकार
sl: Vrsta dejstva

source: Reference number
cy: Rhif cyfeirnod
hy: Հղման համարը
ko: 참조 번호
ne: सन्दर्भ नम्बर
sl: Referenčna številka

source: Custom GEDCOM tags
hy: Հատուկ GEDCOM պիտակներ
ko: 사용자정의 GEDCOM tags
ne: अनुकूलन GEDCOM ट्यागहरू

source: GEDCOM tag
hy: GEDCOM պիտակ
ne: GEDCOM ट्याग

source: Status
cy: Statws
hy: Կարգավիճակ
ko: 상태
ne: स्थिति
sl: Stanje

source: Date of status change
hy: Կարգավիճակի փոփոխության ամսաթիվը
ne: स्थिति परिवर्तनको मिति

source: Time of status change
hy: Կարգավիճակի փոփոխության ժամանակը
ne: स्थिति परिवर्तन को समय

source: Temple
cy: Teml
hy: Տաճար
ko: 사원
ne: मन्दीर
sl: Svetišče (cerkev)

source: Family residence
cy: Preswylfa deuluol
hy: Ընտանեկան բնակավայր
ko: 가족 거주지
ne: पारिवारिक निवास
sl: Družinsko prebivališče

source: Residence
cy: Cartref
hy: Բնակավայր
ko: 거주
ne: निवास
sl: Prebivališče

source: Name of addressee
hy: Հասցեատիրոջ անունը
ne: सम्बोधनकर्ताको नाम

source: GOV identifier
cy: Dynodwr GOV
hy: GOV նույնացուցիչ
ko: GOV 식별자
ne: GOV पहिचानकर्ता
sl: Identifikator GOV

source: Location
cy: Lleoliad
hy: Գտնվելու վայրը
ko: 위치
ne: स्थान
sl: Lokacija

source: Maidenhead location code
hy: Maidenhead տեղադրության կոդը
ne: मेडेनहेड स्थान कोड

source: Postal code
cy: Cod Post
hy: Փոստային ինդեքս
ko: 우편번호
ne: पोस्टल कोड
sl: Poštna številka

source: Note on association
hy: Նշում ասոցիացիայի մասին
ne: संघको नोट

source: Relationship
cy: Perthynas
hy: Հարաբերություններ
ko: 관계
ne: नाता
sl: Sorodstveno razmerje

source: Source citation
cy: Dyfyniad ffynhonnell
hy: Աղբյուրի մեջբերում
ko: 출처 인용
ne: स्रोत उद्धरण
sl: Navedek vira

source: Data
hy: Տվյալներ
ko: 데이터
ne: डाटा
sl: Podatki

source: Date of entry in original source
cy: Dyddiad y cofnod yn y ffynhonnell wreiddiol
hy: Մուտքի ամսաթիվը սկզբնաղբյուրում
ko: 원본 출처의 입력 날짜
ne: मूल स्रोतमा प्रविष्टिको मिति
sl: Datum vnosa v primarni vir

source: Text
cy: Testun
hy: Տեքստ
ko: 텍스트
ne: शब्द
sl: Besedilo

source: Event
cy: Digwyddiad
hy: Իրադարձություն
ko: 이벤트
ne: घटना
sl: Dogodek

source: Note on source citation
hy: Նշում աղբյուրի վկայակոչման վերաբերյալ
ne: स्रोत उद्धरणमा नोट

source: Media object
cy: Gwrthrych cyfrwng
hy: Մեդիա օբյեկտ
ko: 미디어 개체
ne: मिडिया वस्तु
sl: Medijski predmet

source: Citation details
cy: Manylion y dyfyniad
hy: Մեջբերման մանրամասները
ko: 인용 세부정보
ne: उद्धरण विवरण
sl: Podrobnosti navedka

source: Quality of data
cy: Ansawdd y data
hy: Տվյալների որակը
ko: 데이터 품질
ne: डाटाको गुणस्तर
sl: Kakovost podatkov

source: Witnesses
hy: Վկաներ
ne: साक्षीहरू

source: Family status
cy: Statws teulu
hy: Ընտանեկան կարգավիճակը
ko: 가족 상태
ne: पारिवारिक स्थिति
sl: Družinsko stanje

source: The solution
cy: Yr ateb
hy: Լուծումը
ko: 해결방법
ne: समाधान
sl: Rešitev

source: Description
cy: Disgrifiad
hy: Նկարագրություն
ko: 설명
ne: बिवरण
sl: Opis

source: Repository
cy: Storfan
hy: Պահեստարան
ko: 저장소
ne: भण्डार
sl: Skladišče

source: Type of research task
cy: Y math o dasg ymchwil
hy: Հետազոտական առաջադրանքի տեսակը
ko: 연구 과제의 유형
ne: अनुसन्धान कार्यको प्रकार
sl: Vrsta raziskovalnega opravila

source: Category
cy: Categori
hy: Կարգավիճակ
ko: 카테고리
ne: श्रेणी
sl: Kategorija

source: Completion date
cy: Dyddiad cwblhau
hy: Ավարտման ամսաթիվը
ko: 완료 날짜
ne: कार्य सम्पन्न मिति
sl: Datum zaključka

source: Priority
cy: Blaenoriaeth
hy: Առաջնահերթություն
ko: 우선사항
ne: प्राथमिकता
sl: Prioriteta

source: Reminder date
cy: Dyddiad atgoffa
hy: Հիշեցման ամսաթիվ
ko: 알림 일자
ne: रिमाइन्डर मिति
sl: Datum opomnika

source: GEDCOM-L
hy: ԳԵԴԿՈՄ-Լ
ne: GEDCOM-L एल

source: Version
cy: Fersiwn
hy: Տարբերակ
ko: 버젼
ne: संस्करण
sl: Različica

source: Base GEDCOM tag
cy: Tag GEDCOM Sylfaenol
hy: Հիմնական GEDCOM պիտակը
ko: 기본 GEDCOM 태그
ne: आधार GEDCOM ट्याग
sl: Osnovna GEDCOM oznaka

source: New GEDCOM tag
cy: Tag GEDCOM newydd
hy: Նոր GEDCOM պիտակ
ko: 새로운 GEDCOM 태그
ne: नयाँ GEDCOM ट्याग
sl: Nova GEDCOM oznaka

source: Definition
cy: Diffiniad
hy: Սահմանում
ko: 정의
ne: परिभाषा
sl: Definicija

source: Godparents
cy: Rhieni bedydd
hy: կնքահայրեր
ko: 대부모
ne: गडप्यारेन्टहरू
sl: Botri

source: Rufname
hy: մականունը
ko: 부르는 이름(독일식 2번째 이름)
ne: रुफनाम

source: Sex
hy: Սեռ
ne: लिङ्ग

source: Last change
cy: Y newid diwethaf
hy: Վերջին փոփոխությունը
ko: 마지막 변경
ne: पछिल्लो परिवर्तन
sl: Zadnja sprememba

source: Date of last change
cy: Dyddiad y newid diwethaf
hy: Վերջին փոփոխության ամսաթիվը
ko: 마지막 변경 날짜
ne: अन्तिम परिवर्तन भएको मिति
sl: Datum zadnje spremembe

source: Time of last change
cy: Amser y newid diwethaf
hy: Վերջին փոփոխության ժամանակը
ko: 마지막 변경 시간
ne: अन्तिम परिवर्तनको समय
sl: Čas zadnje spremembe

source: Note on last change
hy: Նշում վերջին փոփոխության մասին
ne: पछिल्लो परिवर्तनमा नोट गर्नुहोस्

source: Address line 1
cy: Cyfeiriad llinell 1
hy: Հասցեի տող 1
ko: 주소 라인 1
ne: ठेगाना लाईन १
sl: Naslov, vrstica 1

source: Address line 2
cy: Cyfeiriad llinell 2
hy: Հասցեի տող 2
ko: 주소 라인 2
ne: ठेगाना लाईन २
sl: Naslov, vrstica 2

source: Address line 3
cy: Llinell cyfeiriad 3
hy: Հասցեի տող 3
ko: 주소 라인 3
ne: ठेगाना लाइन 3
sl: Naslov, vrstica 3

source: City
cy: Dinas
hy: Քաղաք
ko: 도시
ne: शहर
sl: Mesto

source: Country
cy: Gwlad
hy: Երկիր
ko: 국가
ne: देश
sl: Država

source: State
cy: Sir/Talaith
hy: Պետություն
ko: 주
ne: राज्य
sl: Dežela

source: Agency
cy: Asiantaeth
hy: Գործակալություն
ko: 중개
ne: एजेन्सी
sl: Agencija

source: Cause
cy: Achos
hy: Պատճառը
ko: 원인
ne: कारण
sl: Vzrok

source: Date of event
cy: Dyddiad y digwyddiad
hy: Միջոցառման ամսաթիվը
ko: 사건 날짜
ne: घटनाको मिति
sl: Datum dogodka

source: Place of event
cy: Man y digwyddiad
hy: Միջոցառման վայրը
ko: 이벤트 장소
ne: घटनास्थल
sl: Kraj dogodka

source: Phonetic place
cy: Lle ffonetig
hy: Հնչյունական տեղ
ko: 발음(소리 나는) 장소
ne: फोनेटिक स्थान
sl: Fonetični kraj

source: Format
cy: Fformatio
hy: Ձևաչափ
ko: 서식
ne: ढाँचा
sl: Oblika

source: Coordinates
cy: Cyfesurynnau
hy: Կոորդինատներ
ko: 좌표
ne: समन्वय गर्दछ
sl: Koordinate

source: Latitude
cy: Lledred
hy: Լայնություն
ko: 위도
ne: अक्षांश
sl: Zemljepisna širina

source: Longitude
cy: Hydred
hy: Երկայնություն
ko: 경도
ne: देशान्तर
sl: Zemljepisna dolžina

source: Note on place
hy: Նշում տեղում
ne: ठाउँमा नोट गर्नुहोस्

source: Romanized place
cy: Lle rhufeiniedig
hy: Ռոմանիզացված վայր
ko: 로마자 장소
ne: रोमनाइज्ड स्थान
sl: Romanizirani kraj

source: Religion
cy: Crefydd
hy: Կրոն
ko: 종교
ne: धर्म
sl: Veroizpoved

source: Restriction
cy: Cyfyngiad
hy: Սահմանափակում
ko: 제한
ne: प्रतिबन्ध
sl: Omejitev

source: Type of event
cy: Math o ddigwyddiad
hy: Միջոցառման տեսակը
ko: 이벤트 유형
ne: घटनाको प्रकार
sl: Vrsta dogodka

source: Abbreviation
cy: Byrfodd
hy: Հապավում
ko: 약어
ne: संक्षेप
sl: Okrajšava

source: Type of abbreviation
cy: Math o dalfyriad
hy: Հապավման տեսակը
ko: 약어 유형
ne: संक्षिप्त को प्रकार
sl: Vrsta okrajšave

source: Language
cy: Iaith
hy: Լեզու
ko: 언어
ne: भाषा
sl: Jezik

source: Source
cy: Ffynhonnell
hy: Աղբյուր
ko: 출처
ne: स्रोत
sl: Vir

source: Media
cy: Cyfryngau
hy: Մեդիա
ko: 미디어
ne: सञ्चार
sl: Mediji

source: Type of location
cy: Math o leoliad
hy: Տեղադրության տեսակը
ko: 위치 유형
ne: स्थानको प्रकार
sl: Vrsta lokacije

source: GOV identifier type
hy: GOV նույնացուցիչի տեսակը
ne: GOV पहिचानकर्ता प्रकार

source: Administrative ID
hy: Վարչական ID
ne: प्रशासनिक आईडी

source: Type of administrative ID
cy: Math o ID gweinyddol
hy: Վարչական ID-ի տեսակը
ko: 관리자 ID 유형
ne: प्रशासनिक आईडी को प्रकार
sl: Vrsta skrbniške ID

source: Demographic data
hy: Ժողովրդագրական տվյալներ
ne: जनसांख्यिकीय डेटा

source: Type of demographic data
cy: Math o ddata demograffig
hy: Ժողովրդագրական տվյալների տեսակը
ko: 인구 통계학적 데이터의 유형
ne: जनसांख्यिकीय डेटा को प्रकार
sl: Vrsta demografskih podatkov

source: Parent location
hy: գերազանց դիրք
ne: अविभावकको लोकेशन

source: Hierarchical relationship
cy: Perthynas hierarchaidd
hy: Հիերարխիկ հարաբերություններ
ko: 계층적 관계
ne: पदानुक्रमिक सम्बन्ध
sl: Hierarhično sorodstveno razmerje

source: Certificate
cy: Tystysgrif
hy: Վկայական
ko: 자격증
ne: प्रमाणपत्र
sl: Potrdilo

source: Title
cy: Teitl
hy: Վերնագիր
ko: 제목
ne: शिर्षक
sl: Naslov

source: Signature
hy: Ստորագրություն
ne: हस्ताक्षर

source: Private
cy: Preifat
hy: Մասնավոր
ko: 사적인
ne: व्यक्तिगत
sl: Zasebno

source: Verified
cy: Gwiriwyd
hy: Ստուգված է
ko: 검증
ne: प्रमाणित
sl: Overjeno

source: Label for husband
hy: Պիտակը ամուսնու համար
ne: पतिको लागि लेबल

source: Report phrase
hy: Հաղորդել արտահայտությունը
ne: प्रतिवेदन वाक्यांश

source: Label for wife
hy: Պիտակ կնոջ համար
ne: पत्नीको लागि लेबल

source: No children
cy: Dim plant
hy: Երեխաներ չկան
ko: 자녀 없음
ne: बच्चाहरु छैन
sl: Brez otrok

source: Scrapbook
cy: Llyfr Lloffion
hy: Գրանցամատյան
ko: 스크랩북
ne: स्क्र्यापबुक
sl: Knjiga izrezkov

source: Audio
cy: Sain
hy: Աուդիո
ko: 오디오
ne: श्रव्य
sl: Zvok

source: Time zone
cy: Cylchfa amser
hy: Ժամային գոտի
ko: 타임존
ne: समय क्षेत्र
sl: Časovni pas

source: Text direction
hy: Տեքստի ուղղություն
ne: पाठ दिशा

source: Site identification code
cy: Cod adnabod gwefan
hy: Կայքի նույնականացման կոդը
ko: 사이트 식별 코드
ne: साइट पहिचान कोड
sl: Koda za identifikacijo spletišča

source: Photograph
hy: Լուսանկարը
ne: फोटोग्राफ

source: Author of last change
cy: Awdur y newid diwethaf
hy: Վերջին փոփոխության հեղինակ
ko: 마지막 변경의 작성자
ne: पछिल्लो परिवर्तन गर्ने
sl: Avtor zadnje spremembe

source: Comment
cy: Sylw
hy: Մեկնաբանություն
ko: 답변
ne: टिप्पणी
sl: Komentar

source: Place in Hebrew
cy: Man yn Hebraeg
hy: Տեղ եբրայերեն
ko: 유대인의 장소
ne: हिब्रू मा स्थान
sl: Kraj v hebrejščini

source: Cemetery
cy: Mynwent
hy: Գերեզմանոց
ko: 묘지
ne: चिहान
sl: Pokopališče

source: Name in Hebrew
cy: Enw yn Hebraeg
hy: Անունը եբրայերեն
ko: 히브리어로 된 이름
ne: हिब्रू मा नाम
sl: Ime v hebrejščini

source: Holocaust
cy: Holocost
hy: Հոլոքոստ
ko: 홀로코스트
ne: होलोकउस्ट Holocaust
sl: Holokavst

source: Re-order media
cy: Ail drefnu'r cyfryngau
hy: Կրկին պատվիրեք մեդիա
ko: 미디어 재정렬
ne: मिडिया पुन: क्रमबद्ध गर्नुहोस्
sl: Razvrsti medije

source: Thumbnail image
cy: Delwedd bach
hy: Մանրապատկերի պատկեր
ko: 썸네일 이미지
ne: थम्बनेल छवि
sl: Sličica

source: Remote server
cy: Gweinydd pell
hy: Հեռավոր սերվեր
ko: 원격 서버
ne: रिमोट सर्भर
sl: Oddaljeni strežnik

source: Block
cy: Rhwystro
hy: Արգելափակել
ko: 블록
ne: ब्लक
sl: Blok

source: Database name
cy: Enw cronfa ddata
hy: Տվյալների բազայի անվանումը
ko: 데이터베이스 이름
ne: डाटाबेस नाम
sl: Ime podatkovne baze

source: Database password
cy: Cyfrinair cronfa ddata
hy: Տվյալների բազայի գաղտնաբառը
ko: 데이터베이스 암호
ne: डाटाबेस पासवर्ड
sl: Geslo podatkovne baze

source: Database user account
cy: Cyfrif defnyddiwr cronfa ddata
hy: Տվյալների բազայի օգտագործողի հաշիվ
ko: 데이터베이스 사용자 계정
ne: डाटाबेस प्रयोगकर्ता खाता
sl: Uporabniški račun podatkovne baze

source: Citizenship
cy: Dinasyddiaeth
hy: Քաղաքացիություն
ko: 시민권
ne: नागरिकता
sl: Državljanstvo

source: Legatee
cy: Etifedd
hy: ժառանգություն
ko: 유산 수취인
ne: लिगेटी
sl: Dedič

source: Land purchase
hy: Հողի գնում
ne: जग्गा खरिद

source: Land sale
hy: Հողատարածքի վաճառք
ne: जग्गा बिक्री

source: Template
hy: Կաղապար
ne: टेम्प्लेट

source: Field
hy: Դաշտ
ne: फिल्ड

source: Field name
hy: Դաշտի անվանումը
ne: फिल्ड नाम
