Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: To assist you in getting started with this block, we have created several standard templates. When you select one of these templates, the text area will contain a copy that you can then alter to suit your site’s requirements.
cy: Er mwyn eich cynorthwyo i ddechrau gyda'r bloc hwn, rydym wedi creu sawl templed safonol. Pan ddewiswch un o'r templedi hyn, bydd yr ardal destun yn cynnwys copi y gallwch ei newid wedyn i weddu i ofynion eich gwefan.
hy: Որպեսզի օգնենք ձեզ սկսել այս բլոկը, մենք ստեղծել ենք մի քանի ստանդարտ ձևանմուշներ: Երբ ընտրեք այս ձևանմուշներից մեկը, տեքստի տարածքը կպարունակի պատճեն, որը կարող եք այնուհետև փոփոխել՝ ձեր կայքի պահանջներին համապատասխան:
ko: 이 블록을 시작하는 데 도움을주기 위해 몇 가지 표준 템플릿을 만들었습니다. 이러한 템플릿 중 하나를 선택하면 텍스트 영역에 사이트의 요구 사항에 맞게 변경할 수있는 사본이 포함됩니다.
ne: यस ब्लकको साथ सुरु गर्नमा मद्दत गर्न, हामीले धेरै मानक टेम्प्लेटहरू सिर्जना गरेका छौं। जब तपाइँ यी टेम्प्लेटहरू मध्ये एउटा चयन गर्नुहुन्छ, पाठ क्षेत्रमा एउटा प्रतिलिपि समावेश हुनेछ जुन तपाइँ तपाइँको साइटको आवश्यकताहरू अनुरूप परिवर्तन गर्न सक्नुहुन्छ।
sl: Da bi vam pomagali pri začetku uporabe tega bloka, smo ustvarili več standardnih predlog. Ko izberete eno od teh predlog, bo besedilno polje vsebovalo besedilo, ki ga lahko nato spremenite glede na zahteve vašega spletišča.

source: As well as using the toolbar to apply HTML formatting, you can insert database fields which are updated automatically. These special fields are marked with <b>#</b> characters. For example <b>#totalFamilies#</b> will be replaced with the actual number of families in the database. Advanced users may wish to apply CSS classes to their text, so that the formatting matches the currently selected theme.
cy: Yn ogystal â defnyddio'r bar offer i osod fformat HTML, gallwch fewnosod meysydd cronfa ddata sy'n cael eu diweddaru'n awtomatig. Mae'r meysydd arbennig hyn wedi'u marcio â nodau <b>#</b>. Er enghraifft, bydd <b># totalFamilies # yn</b> cael ei amnewid gan gyfanswm y teuluoedd yn y gronfa ddata. Efallai y bydd defnyddwyr uwch am gymhwyso dosbarthiadau CSS i'w testun, fel bod y fformatio yn cyd-fynd â'r thema a ddewiswyd ar hyn o bryd.
hy: Ինչպես նաև HTML ձևաչափումը կիրառելու համար գործիքագոտին օգտագործելով, կարող եք տեղադրել տվյալների բազայի դաշտերը, որոնք ինքնաբերաբար թարմացվում են: Այս հատուկ դաշտերը նշված են <b>#</b> նիշերով: Օրինակ, <b>#totalFamilies#</b>-ը կփոխարինվի տվյալների բազայի ընտանիքների իրական թվով: Ընդլայնված օգտվողները կարող են ցանկանալ կիրառել CSS դասեր իրենց տեքստում, որպեսզի ձևաչափումը համապատասխանի տվյալ պահին ընտրված թեմային:
ko: 툴바를 사용하여 HTML 형식을 적용 할뿐만 아니라 자동으로 업데이트되는 데이터베이스 필드를 삽입 할 수 있습니다. 이 특수 필드에는 <b>#</b> 문자가 표시되어 있습니다. 예를 들어 <b>#totalFamilies#</b>는 데이터베이스의 실제 가족 수로 바뀝니다. 고급 사용자는 서식이 현재 선택된 테마와 일치하도록 CSS 클래스를 텍스트에 적용 할 수 있습니다.
ne: HTML ढाँचा लागू गर्न उपकरणपट्टी प्रयोग गर्नका साथै, तपाइँ स्वचालित रूपमा अद्यावधिक गरिएका डाटाबेस क्षेत्रहरू सम्मिलित गर्न सक्नुहुन्छ। यी विशेष क्षेत्रहरू <b>#</b> वर्णहरूसँग चिन्ह लगाइएका छन्। उदाहरणका लागि <b>#totalFamilies#</b> डाटाबेसमा परिवारहरूको वास्तविक संख्यासँग प्रतिस्थापन गरिनेछ। उन्नत प्रयोगकर्ताहरूले उनीहरूको पाठमा CSS कक्षाहरू लागू गर्न चाहन्छन्, ताकि ढाँचाले हाल चयन गरिएको विषयवस्तुसँग मेल खान्छ।
sl: Poleg uporabe orodne vrstice za uporabo oblikovanja HTML lahko vstavite polja podatkovne baze, ki se samodejno posodabljajo. Ta posebna polja so označena z znakoma <b>#</b>. Na primer <b>#totalFamilies#</b> bo zamenjano z dejanskim številom družin v podatkovni bazi. Napredni uporabniki lahko v svojem besedilu uporabijo razrede CSS, da se oblikovanje ujema s trenutno izbrano temo.

source: Show the date and time of update
cy: Dangos dyddiad ac amser y diweddariad
hy: Ցույց տալ թարմացման ամսաթիվը և ժամը
ko: 업데이트 날짜 및 시간 표시
ne: नयाँ अपडेटको मिति र समय देखाउनुहोस्
sl: Prikaži datum in čas posodobitve

source: This family tree was last updated on #gedcomUpdated#. There are #totalSurnames# surnames in this family tree. The earliest recorded event is the #firstEventType# of #firstEventName# in #firstEventYear#. The most recent event is the #lastEventType# of #lastEventName# in #lastEventYear#.<br><br>If you have any comments or feedback please contact #contactWebmaster#.
cy: Diweddarwyd y cart achau hwn ddiwethaf ar #gedcomUpdated#. Mae #totalSurnames# o gyfenwau yn y cart achau hwn. Y digwyddiad cynharaf a gofnodwyd yw'r #firstEventType# o #firstEventName# yn #firstEventYear#. Y digwyddiad diweddaraf yw'r #lastEventType# o # lastEventName# yn #lastEventYear#.<br><br> Os oes gennych unrhyw sylwadau neu adborth, cysylltwch â #contactWebmaster#.
hy: Այս տոհմածառը վերջին անգամ թարմացվել է #gedcomUpdated#-ին: Այս տոհմածառում կան #ընդհանուրԱզգանուններ# ազգանուններ։ Ամենավաղ գրանցված իրադարձությունը #firstEventType#-ի #firstEventName#-ն է #firstEventYear#-ում: Ամենավերջին իրադարձությունը #lastEventName#-ի #lastEventType#-ն է #lastEventYear#-ում:<br><br>Եթե ունեք մեկնաբանություն կամ կարծիք, դիմեք #contactWebmaster#:
ko: 이 가계도는 #gedcomUpdated#에서 마지막으로 업데이트되었습니다. 이 가계도에는 #totalSurnames# 가문이 있습니다. 가장 먼저 기록 된 이벤트는 #firstEventYear#에서 #firstEventName#의 #firstEventType#입니다. 가장 최근의 이벤트는 #lastEventYear#의 #lastEventName#의 #lastEventType#입니다. <br><br> 답변이나 의견이 있으면 #contactWebmaster#로 문의하십시오.
ne: यो पारिवारिक रूख अन्तिम पटक #gedcomUpdated# मा अद्यावधिक गरिएको थियो। यस पारिवारिक रूखमा #कुल उपनामहरू। सबैभन्दा पुरानो रेकर्ड गरिएको घटना #firstEventYear# मा #firstEventName# को #firstEventType# हो। सबैभन्दा हालको घटना #lastEventYear# मा #lastEventName# को #lastEventType# हो।<br><br>यदि तपाईंसँग कुनै टिप्पणी वा प्रतिक्रिया छ भने कृपया #contactWebmaster# मा सम्पर्क गर्नुहोस्।
sl: To družinsko drevo je bilo nazadnje posodobljeno dne #gedcomUpdated#. V tem družinskem drevesu je #totalSurnames# priimkov. Najzgodnejši zabeležen dogodek je #firstEventType# osebe #firstEventName# v letu #firstEventYear#. Najnovejši dogodek je #lastEventType# osebe #lastEventName# v letu #lastEventYear#.<br><br>Če imate kakršne koli komentarje ali povratne informacije, se obrnite na #contactWebmaster#.

source: Use compact layout
cy: Defnyddio cynllun cryno
hy: Օգտագործեք կոմպակտ դասավորություն
ko: 컴팩트 레이아웃 사용
ne: कम्प्याक्ट लेआउट प्रयोग गर
sl: Uporabi zgoščeno postavitev

source: Add individuals
cy: Ychwanegu unigolion
hy: Ավելացնել անհատներ
ko: 인물 추가
ne: व्याक्तिहरु थप
sl: Dodaj osebe

source: Include the individual’s immediate family
cy: Cynnwys teulu agos yr unigolyn
hy: Ներառեք անհատի անմիջական ընտանիքը
ko: 인물의 직계 가족 포함
ne: व्यक्तिको नजिकको परिवार समावेश गर्नुहोस्
sl: Vključi ožjo družino osebe

source: Select individuals by place or date
cy: Dewis unigolion yn ôl lle neu ddyddiad
hy: Ընտրեք անհատներին ըստ վայրի կամ ամսաթվի
ko: 장소 또는 날짜로 인물을 선택하십시오
ne: स्थान वा मिति अनुसार व्यक्तिहरू चयन गर्नुहोस्
sl: Izberi osebe glede na kraj ali datum

source: Start year
cy: Blwyddyn yn cychwyn
hy: Մեկնարկային տարի
ko: 시작년도
ne: सुरु वर्ष
sl: Začetno leto

source: End year
cy: Blwyddyn yn gorffen
hy: Ավարտական տարի
ko: 종료 연도
ne: अन्त्य वर्ष
sl: Končno leto

source: You are signed in as %s.
cy: Rydych wedi mewngofnodi fel %s.
hy: Դուք մուտք եք գործել որպես %s:
ko: %s(으)로 로그인했습니다.
ne: तपाईं %s को रूपमा साइन इन हुनुहुन्छ।
sl: Prijavljeni ste kot %s.

source: sign out
cy: allgofnodi
hy: դուրս գալ
ko: 로그아웃
ne: लगआउट
sl: Odjava

source: Media objects per page
cy: Gwrthrychau cyfryngau ar bob tudalen
hy: Մեդիա օբյեկտներ մեկ էջի համար
ko: 페이지당 미디어 개체
ne: प्रति पृष्ठ मिडिया वस्तुहरू
sl: Medijskih predmetov na stran

source: Search filters
cy: Hidlwyr chwilio
hy: Որոնման զտիչներ
ko: 검색 필터
ne: फिल्टर खोज्नुहोस्
sl: Filtri iskanja

source: Media objects found
cy: Gwrthrychau cyfryngau wedi'u canfod
hy: Հայտնաբերվել են լրատվամիջոցների օբյեկտներ
ko: 미디어 개체를 찾았습니다
ne: मिडिया वस्तुहरू फेला पर्यो
sl: Najdeni medijski predmeti

source: Page %s of %s
cy: Tudalen %s o %s
hy: %s էջ %s -ից
ko: %s 의%s 페이지
ne: पृष्ठ %s को %s
sl: Stran %s od %s

source: Show all media
hy: Ցուցադրել բոլոր լրատվամիջոցները
ne: सबै मिडिया देखाउनुहोस्

source: There are no media objects for this individual.
cy: Nid oes unrhyw wrthrychau cyfryngau i'r unigolyn hwn.
hy: Այս անհատի համար լրատվամիջոցների օբյեկտներ չկան։
ko: 선택한 인물에 대한 미디어 개체가 없습니다.
ne: यस व्यक्तिको लागि कुनै मिडिया वस्तुहरू छैनन्।
sl: Za to osebo ni fotografij.

source: Show all notes
cy: Dangos yr holl nodiadau
hy: Ցույց տալ բոլոր նշումները
ko: 모든 노트 표시
ne: सबै टिप्पणीहरु देखाऊ
sl: Prikaži vse opombe

source: There are no notes for this individual.
cy: Nid oes unrhyw nodiadau ar gyfer yr unigolyn hwn.
hy: Այս անձի համար նշումներ չկան:
ko: 이 인물에 대한 노트가 없습니다.
ne: निज (व्यक्ति)का कुनै नोटहरू छैनन् ।
sl: Za to osebo ni opomb.

source: Add a note
cy: Ychwanegu nodyn
hy: Ավելացնել նշում
ko: 노트 추가
ne: नयाँ टिप्पणी थप
sl: Dodaj opombo

source: Siblings
cy: Brodyr a chwiorydd
hy: Եղբայրներ և եղբայրներ
ko: 형제자매
ne: सहोदर
sl: Bratje/sestre

source: Sibling
cy: Brodyr a chwiorydd
hy: Եղբայր կամ եղբայր
ko: 형제자매
ne: सहोदर
sl: Brat/sestra

source: Nothing to show
cy: Dim i'w ddangos
hy: Ցույց տալու ոչինչ չկա
ko: 표시할 항목 없음
ne: देखाउनका लागि केही छैन
sl: Ne najdem ničesar za prikaz

source: Associated events
hy: Առնչվող իրադարձություններ
ko: 관련 이벤트
ne: सम्बन्धित घटनाहरू

source: Events of close relatives
cy: Digwyddiadau perthnasau agos
hy: Մերձավոր ազգականների իրադարձություններ
ko: 가까운 친척의 이벤트
ne: नजिकैको नातेदारहरुको घटनाहरु
sl: Dogodki najbližjih sorodnikov

source: There are no facts for this individual.
cy: Nid oes unrhyw ffeithiau i'r unigolyn hwn.
hy: Այս անձի համար փաստեր չկան:
ko: 이 인물에 대한 정보는 없습니다.
ne: निज (व्यक्ति)का कुनै तथ्यहरू छैनन् ।
sl: Za to osebo ni znanih dejstev.

source: No results found.
cy: Heb ganfod unrhyw ganlyniadau.
hy: Ոչ մի արդյունք չի գտնվել:
ko: 검색 결과가 없습니다.
ne: कुनै परिणाम फेला परेन।
sl: Ni rezultatov.

source: Place list
cy: Rhestr lleoedd
hy: Տեղերի ցուցակ
ko: 장소 목록
ne: स्थान सूचि
sl: Seznam krajev

source: View table of events occurring in %s
cy: Gweld y tabl o ddigwyddiadau sy'n digwydd yn %s
hy: Դիտեք %s-ում տեղի ունեցող իրադարձությունների աղյուսակը
ko: %s에서 발생하는 이벤트 테이블 보기
ne: %s मा हुने घटनाहरूको तालिका हेर्नुहोस्
sl: Prikaži tabelo dogodkov, ki se bodo zgodili %s

source: The location of this place is not known.
cy: Nid yw lleoliad y lle hwn yn hysbys.
hy: Այս վայրի գտնվելու վայրը հայտնի չէ։
ko: 이 장소의 위치를 알 수 없습니다.
ne: यो ठाउँ को स्थान थाहा छैन।
sl: Lokacija tega kraja ni znana.

source: This website uses cookies to learn about visitor behavior.
cy: Mae'r wefan hon yn defnyddio cwcis i ddysgu am ymddygiad ymwelwyr.
hy: Այս կայքը օգտագործում է թխուկներ՝ ծանոթանալու այցելուների վարքագծին:
ko: 이 웹 사이트는 쿠키를 사용하여 방문자 행동에 대해 학습합니다.
ne: यो वेबसाइट आगन्तुक व्यवहार बारे जान्न कुकीहरू प्रयोग गर्दछ।
sl: To spletišče uporablja piškotke, da se seznani z vedenjem obiskovalcev.

source: Personal data
cy: Data personol
hy: Անձնական տվյալներ
ko: 개인 정보
ne: व्यक्तिगत डाटा
sl: Osebni podatki

source: This website processes personal data for the purpose of historical and genealogical research.
cy: Mae'r wefan hon yn prosesu data personol at ddibenion ymchwil hanesyddol ac achyddol.
hy: Այս կայքը մշակում է անձնական տվյալները՝ պատմական և ծագումնաբանական հետազոտությունների նպատակով:
ko: 이 웹 사이트는 역사 및 계보 연구 목적으로 개인 데이터를 처리합니다.
ne: यस वेबसाइटले ऐतिहासिक र वंशावली अनुसन्धानको उद्देश्यका लागि व्यक्तिगत डेटा प्रशोधन गर्दछ।
sl: To spletišče obdeluje osebne podatke za namene zgodovinskih in rodoslovnih raziskav.

source: This research is a “legitimate interest” under article 6(f) of the EU General Data Protection Regulations.
cy: Mae'r ymchwil hon yn “fuddiant dilys” o dan erthygl 6 (f) o Reoliadau Diogelu Data Cyffredinol yr UE.
hy: Այս հետազոտությունը հանդիսանում է «օրինական շահ»՝ համաձայն ԵՄ տվյալների պաշտպանության ընդհանուր կանոնակարգի 6-րդ հոդվածի «զ»:
ko: 이 연구는 EU 일반 데이터 보호 규정 6 (f) 조에 따른“합법적 인 관심사”입니다.
ne: यो अनुसन्धान EU सामान्य डाटा संरक्षण नियमावली को धारा 6(f) अन्तर्गत "वैध चासो" हो।
sl: Ta raziskava je “legitimen interes” v skladu s členom 6(f) Splošne uredbe EU o varstvu podatkov.

source: Cookies
cy: Cwcis
hy: Թխվածքաբլիթներ
ko: 쿠키
ne: कुकीज्
sl: Piškotki

source: This website uses cookies to enable login sessions, and to remember preferences such as your chosen language.
cy: Mae'r wefan hon yn defnyddio cwcis i alluogi sesiynau mewngofnodi, ac i gofio dewisiadau fel yr iaith o'ch dewis.
hy: Այս կայքը օգտագործում է թխուկներ՝ մուտք գործելու նիստերը միացնելու և ձեր ընտրած լեզուն հիշելու համար:
ko: 이 웹 사이트는 쿠키를 사용하여 로그인 세션을 활성화하고 선택한 언어와 같은 기본 설정을 기억합니다.
ne: यो वेबसाइटले लगइन सत्रहरू सक्षम गर्न, र तपाईंले रोजेको भाषा जस्ता प्राथमिकताहरू सम्झन कुकीहरू प्रयोग गर्दछ।
sl: To spletišče uporablja piškotke za omogočanje prijavnih sej in za pomnjenje nastavitev, kot je npr. izbrani jezik.

source: These cookies are “essential”, and do not require consent.
cy: Mae'r cwcis hyn yn “hanfodol”, ac nid oes angen caniatâd arnynt.
hy: Այս թխուկները «էական» են և համաձայնություն չեն պահանջում:
ko: 이 쿠키는 “필수”이며 동의 할 필요가 없습니다.
ne: यी कुकीहरू "आवश्यक" हुन्, र सहमति आवश्यक पर्दैन।
sl: Ti piškotki so “bistveni” in ne zahtevajo soglasja.

source: This website uses third-party services to learn about visitor behavior.
cy: Mae'r wefan hon yn defnyddio gwasanaethau trydydd parti i ddysgu am ymddygiad ymwelwyr.
hy: Այս կայքը օգտագործում է երրորդ կողմի ծառայություններ՝ այցելուների վարքագծի մասին իմանալու համար:
ko: 이 웹 사이트는 타사 서비스를 사용하여 방문자 행동에 대해 학습합니다.
ne: यो वेबसाइट आगन्तुक व्यवहार बारे जान्न तेस्रो-पक्ष सेवाहरू प्रयोग गर्दछ।
sl: To spletišče uporablja storitve tretjih oseb, da se seznani z vedenjem obiskovalcev.

source: These services may use cookies or other tracking technology.
cy: Gall y gwasanaethau hyn ddefnyddio cwcis neu dechnoleg tracio eraill.
hy: Այս ծառայությունները կարող են օգտագործել թխուկներ կամ հետագծման այլ տեխնոլոգիա:
ko: 이러한 서비스는 쿠키 또는 기타 추적 기술을 사용할 수 있습니다.
ne: यी सेवाहरूले कुकीहरू वा अन्य ट्र्याकिङ प्रविधि प्रयोग गर्न सक्छन्।
sl: Te storitve lahko uporabljajo piškotke ali druge tehnologije sledenja.

source: You can opt out of tracking by setting the “Do Not Track” header in your browser preferences.
cy: Gallwch ddewis peidio â chael eich tracio drwy osod y pennawd “Peidiwch â Thracio” yn newisiadau eich porwr.
hy: Դուք կարող եք հրաժարվել հետևելուց՝ ձեր դիտարկիչի նախապատվություններում դնելով «Չհետևել» վերնագիրը:
ko: 브라우저 환경설정에서 "추적하지 않음" 헤더를 설정하여 추적을 해제할 수 있습니다.
ne: तपाइँ तपाइँको ब्राउजर प्राथमिकताहरूमा "ट्र्याक नगर्नुहोस्" हेडर सेट गरेर ट्र्याकिङबाट अप्ट आउट गर्न सक्नुहुन्छ।
sl: Sledenje lahko onemogočite tako, da v nastavitvah brskalnika nastavite glavo “Ne sledi”.

source: Data controller
cy: Rheolwr data
hy: Տվյալների վերահսկիչ
ko: 데이터 컨트롤러
ne: डाटा नियन्त्रक
sl: Krmilnik podatkov

source: This website is operated by the following individuals.
cy: Mae'r wefan hon yn cael ei gweithredu gan yr unigolion canlynol.
hy: Այս կայքը շահագործվում է հետևյալ անձանց կողմից.
ko: 이 웹 사이트는 다음 개인이 운영합니다.
ne: यो वेबसाइट निम्न व्यक्तिहरु द्वारा संचालित छ।
sl: To spletišče upravljajo naslednji posamezniki.

source: Show only individuals, events, or all
cy: Dangos dim ond unigolion, digwyddiadau, neu'r cyfan
hy: Ցույց տալ միայն անհատներին, իրադարձություններին կամ բոլորին
ko: 인물, 이벤트만 또는 모두 표시
ne: व्यक्ति, घटनाहरू अथवा सबै देखाउनुहोस्
sl: Prikaži samo osebe, dogodke ali oboje

source: Show slide show controls
cy: Dangos rheolyddion sioe sleidiau
hy: Ցուցադրել սլայդերի ցուցադրման հսկիչները
ko: 슬라이드 쇼 컨트롤을 표시 하시겠습니까
ne: स्लाईड दृश्यको नियन्त्रक देखाऊ
sl: Prikaži gumbe diaprojekcije

source: Start slide show on page load
cy: Dechrau'r sioe sleidiau wrth lwytho'r dudalen
hy: Սկսեք սլայդերի ցուցադրումը էջի բեռնման ժամանակ
ko: 페이지 로드 시 슬라이드 쇼 시작
ne: पृष्ठ लोडमा स्लाइड शो सुरु गर्नुहोस्
sl: Začni diaprojekcijo ob nalaganju strani

source: Next image
cy: Delwedd nesaf
hy: Հաջորդ պատկերը
ko: 다음 이미지
ne: अर्को तस्बिर
sl: Naslednja slika

source: Changed on %1$s by %2$s
cy: Wedi'i newid ar %1$s gan %2$s
hy: Փոխվել է %1$s -ում %2$s -ով
ko: %1$s 에서 %2$s 변경됨
ne: %1$s मा %2$s द्वारा परिवर्तन गरियो
sl: Spremenila oseba %2$s dne %1$s

source: Changed on %1$s
cy: Wedi'i newid ar %1$s
hy: Փոխվել է %1$s -ին
ko: %1$s 변경됨
ne: %1$s मा परिवर्तन गरियो
sl: Spremenjeno dne %1$s

source: Changed by %1$s
cy: Wedi'i newid gan %1$s
hy: Փոխվել է %1$s -ով
ko: %1$s 변경됨
ne: %1$s द्वारा परिवर्तन गरियो
sl: Spremenila oseba %1$s

source: Number of days to show
cy: Nifer y dyddiau i'w dangos
hy: Ցույց տալու օրերի քանակը
ko: 표시 일수
ne: देखाइने दिनहरुको संख्या
sl: Število dni za prikaz

source: maximum %s day
cy: uchafswm o %s diwrnod
hy: առավելագույնը %s օր
ko: 최대 %s일
sl: največ %s dan

source: Show the user who made the change
cy: Dangos i'r defnyddiwr pwy wnaeth y newid
hy: Ցույց տալ օգտվողին, ով կատարել է փոփոխությունը
ko: 변경한 사용자 표시
ne: परिवर्तन गर्ने प्रयोगकर्तालाई देखाउनुहोस्
sl: Prikaži uporabnika, ki je izvedel spremembo

source: Show the date and time
cy: Dangos y dyddiad a'r amser
hy: Ցույց տալ ամսաթիվը և ժամը
ko: 날짜와 시간 표시
ne: मिति तथा समय देखाउनुहोस्
sl: Prikaži datum in čas

source: Searching for all possible relationships can take a lot of time in complex trees.
cy: Gall chwilio am bob perthynas bosibl gymryd llawer o amser mewn cart achau cymhleth.
hy: Բոլոր հնարավոր հարաբերությունների որոնումը կարող է շատ ժամանակ խլել բարդ ծառերի մեջ:
ko: 가능한 모든관계를 찾는 것은 복잡한 가계도에서 많은 시간이 걸릴 수 있습니다.
ne: सबै सम्भावित सम्बन्धहरूको खोजी गर्दा जटिल रूखहरूमा धेरै समय लाग्न सक्छ।
sl: Iskanje vseh možnih sorodstvenih razmerij lahko v kompleksnih drevesih traja veliko časa.

source: How much recursion to use when searching for relationships
cy: Faint o ddychweliad i'w ddefnyddio wrth chwilio am berthnasoedd
hy: Որքա՞ն ռեկուրսիա օգտագործել հարաբերություններ որոնելիս
ko: 관계를 검색할 때 사용할 반복 횟수
ne: सम्बन्ध खोज्दा कति पुनरावृत्ति प्रयोग गर्ने
sl: Koliko nivojev uporabim pri iskanju sorodstvenih razmerij

source: Individual 1
cy: Unigolyn 1
hy: Անհատական 1
ko: 인물 1
ne: व्यक्ति १
sl: Oseba 1

source: Individual 2
cy: Unigolyn 2
hy: Անհատական 2
ko: 인물 2
ne: व्यक्ति २
sl: Oseba 2

source: Swap individuals
cy: Amnewid unigolion
hy: Փոխանակում անհատներին
ko: 인물 교환
ne: व्यक्तिहरू बदल्नुहोस्
sl: Zamenjaj osebi

source: Add marriage details
cy: Ychwanegu manylion priodas
hy: Ավելացնել ամուսնության մանրամասները
ko: 결혼 세부 정보 추가
ne: विवाहको विस्तृत विवरण् थप
sl: Dodaj podrobnosti poroke

source: Add a brother
cy: Ychwanegu brawd
hy: Ավելացնել եղբայր
ko: 형제 추가
ne: दाजुभाइ थप्नुहोस्
sl: Dodaj brata

source: Add a sister
cy: Ychwanegu chwaer
hy: Ավելացրեք քույր
ko: 자매 추가
ne: दिदीबहिनी थप्नुहोस्
sl: Dodaj sestro

source: Add a sibling
cy: Ychwanegu brawd neu chwaer
hy: Ավելացրեք քույր կամ եղբայր
ko: 형제자매 추가
ne: दाजुभाइ थप्नुहोस्
sl: Dodaj brata/sestro

source: Date differences
cy: Gwahaniaethau dyddiadau
hy: Ամսաթվերի տարբերություններ
ko: 날짜 차이
ne: मिति भिन्नताहरू
sl: Razlika datumov

source: This block will show editors a list of records with pending changes that need to be reviewed by a moderator. It also generates daily emails to moderators whenever pending changes exist.
cy: Bydd y bloc hwn yn dangos i olygyddion restr o gofnodion gyda chynigion newydd y mae angen i gymedrolwr eu hadolygu. Mae hefyd yn cynhyrchu e-byst dyddiol i gymedrolwyr pryd bynnag y bydd yna gynigion newydd.
hy: Այս բլոկը խմբագիրներին ցույց կտա սպասվող փոփոխություններով գրառումների ցանկ, որոնք պետք է վերանայվեն մոդերատորի կողմից: Այն նաև ստեղծում է ամենօրյա նամակներ մոդերատորներին, երբ առկա են սպասվող փոփոխություններ:
ko: 이 블록은 편집자에게 중재자가 검토해야하는 보류중인 변경 사항이있는 레코드 목록을 표시합니다. 또한 보류중인 변경 사항이있을 때마다 중재자에게 매일 전자 메일을 생성합니다.
ne: यो ब्लकले सम्पादकहरूलाई पेन्डिङ परिवर्तनहरू भएका रेकर्डहरूको सूची देखाउनेछ जुन मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक छ। यसले मध्यस्थकर्ताहरूलाई दैनिक इमेलहरू पनि उत्पन्न गर्दछ जब पनि पेन्डिङ परिवर्तनहरू अवस्थित हुन्छन्।
sl: Ta blok urednikom prikaže seznam zapisov s čakajočimi spremembami, ki jih mora pregledati moderator. Prav tako ustvari dnevna e-poštna sporočila moderatorjem, kadar obstajajo čakajoče spremembe.

source: Send out reminder emails
cy: Anfon e-byst atgoffa
hy: Ուղարկեք հիշեցման նամակներ
ko: 미리 알림 이메일을 보내십시오
ne: रिमाइन्डर इमेलहरू पठाउनुहोस्
sl: Razpošlji opozorilna e-sporočila

source: Reminder email frequency (days)
cy: Amledd e-bost atgoffa (dyddiau)
hy: Հիշեցման էլփոստի հաճախականությունը (օր)
ko: 알림 이메일 빈도(일)
ne: रिमाइन्डर इमेल आवृत्ति (दिन)
sl: Pogostost e-poštnih opomnikov (v dnevih)

source: The URL was copied to the clipboard
hy: URL-ը պատճենվել է clipboard-ում
ko: URL이 클립보드에 복사되었습니다
ne: URL क्लिपबोर्डमा प्रतिलिपि गरियो

source: Sitemaps are a way for webmasters to tell search engines about the pages on a website that are available for crawling. All major search engines support sitemaps. For more information, see <a href="https://www.sitemaps.org/">www.sitemaps.org</a>.
hy: Կայքի քարտեզները վեբ վարպետների համար որոնման համակարգերին պատմելու միջոց են կայքի այն էջերի մասին, որոնք հասանելի են սողալու համար: Բոլոր հիմնական որոնման համակարգերը աջակցում են կայքի քարտեզներին: Լրացուցիչ տեղեկությունների համար տես <a href="https://www.sitemaps.org/">www.sitemaps.org</a>:
ko: 사이트 맵은 웹 마스터가 크롤링 할 수있는 웹 사이트의 페이지에 대해 검색 엔진에 알리는 방법입니다. 모든 주요 검색 엔진은 사이트 맵을 지원합니다 <a href="https://www.sitemaps.org/">www.sitemaps.org</a>.
ne: साइटम्यापहरू वेबमास्टरहरूका लागि खोज इन्जिनहरूलाई वेबसाइटमा रहेका पृष्ठहरूको बारेमा बताउन सक्ने तरिका हो जुन क्रलिङको लागि उपलब्ध छ। सबै प्रमुख खोज इन्जिनहरूले साइटम्यापहरू समर्थन गर्छन्। थप जानकारीको लागि, <a href="https://www.sitemaps.org/">www.sitemaps.org</a> हेर्नुहोस्।

source: Which family trees should be included in the sitemaps
cy: Pa goed teulu y dylid eu cynnwys yn y mapiau gwefannau
hy: Որ տոհմածառերը պետք է ներառվեն կայքի քարտեզներում
ko: 사이트 맵에 포함되어야하는 가계도
ne: कुन पारिवारिक रूखहरू साइटम्यापमा समावेश गर्नुपर्छ
sl: Katera družinska drevesa naj bodo vključena v zemljevid spletišča

source: Show all sources
cy: Dangos yr holl ffynonellau
hy: Ցույց տալ բոլոր աղբյուրները
ko: 모든 출처 표시
ne: सबै स्रोतहरू देखाउनुहोस्
sl: Prikaži vse vire

source: There are no source citations for this individual.
cy: Nid oes unrhyw ddyfyniadau ffynhonnell ar gyfer yr unigolyn hwn.
hy: Այս անձի համար աղբյուրների մեջբերումներ չկան:
ko: 이 인물에 대한 출처 인용이 없습니다.
ne: यस व्यक्तिको लागि कुनै स्रोत उद्धरणहरू छैनन्।
sl: Za to osebo ni navedkov iz virov.

source: Add a source citation
cy: Ychwanegu dyfyniad ffynhonnell
hy: Ավելացնել աղբյուրի մեջբերում
ko: 출처 인용 추가
ne: स्रोत उद्धरण थप्नुहोस्
sl: Dodaj navedek vira

source: Security code
cy: Cod diogelwch
hy: Անվտանգության կոդը
ko: 보안코드
ne: सुरक्षा कोड
sl: Varnostna koda

source: Age difference
cy: Gwahaniaeth oed
hy: Տարիքային տարբերություն
ko: 나이 차이
ne: उमेरको भिन्नता
sl: Razlika v starosti

source: Age between siblings
cy: Oed rhwng brodyr a chwiorydd
hy: Տարիքը եղբայրների և եղբայրների միջև
ko: 형제자매 사이의 나이 차이
ne: दाजुभाइ बीचको उमेर
sl: Starost med brati/sestrami

source: Greatest age between siblings
cy: Yr oed mwyaf rhwng brodyr a chwiorydd
hy: Քույրերի և եղբայրների միջև ամենամեծ տարիքը
ko: 형제자매 중 최고연령
ne: दाजुभाइ बीच सबैभन्दा ठूलो उमेर
sl: Največja razlika v starosti med brati/sestrami

source: Age between husband and wife
cy: Oed rhwng gŵr a gwraig
hy: Ամուսնու և կնոջ տարիքը
ko: 남편과 아내 사이의 나이 차이
ne: पति र पत्नी बीचको उमेर
sl: Starost med možem in ženo

source: Age between wife and husband
cy: Oed rhwng gwraig a gŵr
hy: Տարիքը կնոջ և ամուսնու միջև
ko: 아내와 남편 사이의 나이 차이
ne: श्रीमती र श्रीमान बीचको उमेर
sl: Starost med ženo in možem

source: Age at birth of child
cy: Oed adeg genedigaeth y plentyn
hy: Երեխայի ծննդյան տարիքը
ko: 자녀가 태어난 나이
ne: बच्चाको जन्म हुँदाको उमेर
sl: Starost ob rojstvu otroka

source: Youngest father
cy: Tad ieuengaf
hy: Ամենաերիտասարդ հայրը
ko: 가장 어린 아버지
ne: सबैभन्दा कान्छो उमेरमा बुवा बन्ने
sl: Najmlajši oče

source: Youngest mother
cy: Mam ieuengaf
hy: Ամենաերիտասարդ մայրը
ko: 가장 어린 어머니
ne: सबैभन्दा सानो उमेरमा आमा बनेकी
sl: Najmlajša mater

source: Oldest father
cy: Tad hynaf
hy: Ամենատարեց հայրը
ko: 가장 나이가 많은 아버지
ne: सबैभन्दा जेठो बुबा
sl: Najstarejši oče

source: Oldest mother
cy: Mam hynaf
hy: Ամենատարեց մայրը
ko: 가장 나이가 많은 어머니
ne: सबैभन्दा जेठी आमा
sl: Najstarejša mater
