Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: If a media object is linked to an individual, when it should be linked to a fact or event, then you can move it to the correct location.
cy: Os yw gwrthrych cyfryngau wedi'i gysylltu ag unigolyn, pan ddylai fod yn gysylltiedig â ffaith neu ddigwyddiad, yna gallwch ei symud i'r lleoliad cywir.
hy: Եթե մեդիա օբյեկտը կապված է անհատի հետ, երբ այն պետք է կապված լինի փաստի կամ իրադարձության հետ, ապա կարող եք այն տեղափոխել ճիշտ վայր:
ko: 미디어 개체가 인물에 연결된 경우 정보 또는 이벤트에 연결되어야 할 때 올바른 위치로 이동할 수 있습니다.
ne: यदि मिडिया वस्तु एक व्यक्तिसँग लिङ्क गरिएको छ, जब यो तथ्य वा घटनासँग लिङ्क हुनुपर्छ, त्यसपछि तपाइँ यसलाई सही स्थानमा सार्न सक्नुहुन्छ।
sl: Če je medijski predmet povezan z osebo, pa bi moral biti povezan z dejstvom ali dogodkom, ga lahko premaknete na pravo mesto.

source: (includes media files)
hy: (ներառում է մեդիա ֆայլեր)
ne: (मिडिया फाइलहरू समावेश छन्)

source: GEDZIP
hy: ԳԵՁԻՊ
ne: GEDजीप

source: Character encoding
hy: Նիշերի կոդավորում
ne: क्यारेक्टर एन्कोडिङ

source: Line endings
hy: Գծերի վերջավորություններ
ne: रेखा समाप्त

source: Apply privacy settings
cy: Gosod gosodiadau preifatrwydd
hy: Կիրառել գաղտնիության կարգավորումները
ko: 개인 정보 설정 적용
ne: गोपनीयता सेटिङहरू लागू गर्नुहोस्
sl: Uporabi nastavitve zasebnosti

source: None
cy: Dim
hy: Ոչ մեկը
ko: 없음
ne: कुनै पनि होइन
sl: Brez

source: degrees
cy: graddau
hy: աստիճաններ
ko: 계급
ne: डिग्रीहरू
sl: stopinje

source: Nothing found.
cy: Heb ganfod dim.
hy: Ոչինչ չի գտնվել։
ko: 아무것도 찾을 수 없음.
ne: केही भेटिएन।
sl: Ne najdem ničesar.

source: Hide unused locations
cy: Cuddio lleoliadau heb eu defnyddio
hy: Թաքցնել չօգտագործված վայրերը
ko: 사용하지 않는 위치 숨기기
ne: प्रयोग नगरिएका स्थानहरू लुकाउनुहोस्
sl: Skrij neuporabljene lokacije

source: Flag
cy: Baner
hy: Դրոշ
ko: 깃발
ne: झण्डा
sl: Zastava

source: %s family tree
cy: %s cartiau achau
hy: %s ընտանիք ծառ
ko: %s 가계도
ne: %s परिवार वृक्ष
sl: %s družinsko drevo

source: Remove this location?
cy: Tynnu'r lleoliad hwn?
hy: Հեռացնե՞լ այս վայրը?
ko: 이 위치를 제거 하겠습니까?
ne: यो ठाउँ हटाउनुहोस् ?
sl: Ostranim to lokacijo?

source: add place
cy: ychwanegu man
hy: ավելացնել տեղ
ko: 장소 추가
ne: स्थान (ठाउँ) थप्नुहोस्
sl: Dodaj kraj

source: export file
cy: allforio ffeil
hy: արտահանման ֆայլ
ko: 파일 내보내기
ne: फाइल Export गर्नुहोस्
sl: Izvozi datoteko

source: import file
cy: mewnforio ffeil
hy: ներմուծման ֆայլ
ko: 파일 가져오기
sl: Uvozi datoteko

source: Delete unused locations
hy: Ջնջել չօգտագործված վայրերը
ne: प्रयोग नगरिएका स्थानहरू मेटाउनुहोस्

source: A file on your computer
cy: Ffeil ar eich cyfrifiadur
hy: Ֆայլ ձեր համակարգչում
ko: 내 컴퓨터에 저장된 파일
ne: कम्प्युटरमा रहेको फाइल
sl: Datoteka na računalniku

source: A file on the server
cy: Ffeil ar y gweinydd
hy: Ֆայլ սերվերի վրա
ko: 서버에 저장된 파일
ne: सर्भरमा रहेको फाइल
sl: Datoteka na strežniku

source: Import
cy: Mewnforio
hy: Ներմուծում
ko: 가져오기
ne: आयात गर्नुहोस्
sl: Uvoz

source: Only update existing records
cy: Dim ond diweddaru'r cofnodion presennol
hy: Թարմացրեք միայն առկա գրառումները
ko: 기존 레코드만 업데이트
ne: अवस्थित रेकर्डहरू मात्र अद्यावधिक गर्नुहोस्
sl: Posodobi samo obstoječe zapise

source: Only add new records
cy: Dim ond ychwanegu cofnodion newydd
hy: Ավելացնել միայն նոր գրառումներ
ko: 새 레코드만 추가
ne: नयाँ रेकर्ड मात्र थप्नुहोस्
sl: Dodaj samo nove zapise

source: Add new, and update existing records
cy: Ychwanegu cofnodion newydd, a diweddaru'r rhai presennol
hy: Ավելացնել նոր և թարմացնել առկա գրառումները
ko: 새로운 레코드 추가 및 기존 레코드 업데이트
ne: नयाँ थप्नुहोस् अनि अवस्थित रेकर्डहरू अद्यावधिक गर्नुहोस्
sl: Dodaj nove in posodobi obstoječe zapise

source: Upload one or more media files from your local computer. Media files can be pictures, video, audio, or other formats.
cy: Llwythwch un neu fwy o ffeiliau cyfryngau o'ch cyfrifiadur lleol. Gall ffeiliau cyfryngau fod yn luniau, fideos, sain, neu fformatau eraill.
hy: Վերբեռնեք մեկ կամ մի քանի մեդիա ֆայլ ձեր տեղական համակարգչից: Մեդիա ֆայլերը կարող են լինել նկարներ, վիդեո, աուդիո կամ այլ ձևաչափեր:
ko: 로컬 컴퓨터에서 하나 이상의 미디어 파일을 업로드하십시오. 미디어 파일은 사진, 비디오, 오디오 또는 기타 형식 일 수 있습니다.
ne: आफ्नो स्थानीय कम्प्युटरबाट एक वा धेरै मिडिया फाइलहरू अपलोड गर्नुहोस्। मिडिया फाइलहरू चित्र, भिडियो, अडियो, वा अन्य ढाँचाहरू हुन सक्छन्।
sl: Naložite eno ali več medijskih datotek iz lokalnega računalnika. Medijske datoteke so lahko slikovne, video, zvočne ali druge datoteke.

source: Maximum upload size:
cy: Uchafswm maint llwytho i fyny:
hy: Վերբեռնման առավելագույն չափը՝
ko: 최대 업로드 크기:
ne: अधिकतम अपलोड आकार:
sl: Največja velikost nalaganja:

source: Media file
cy: Ffeil cyfrwng
hy: Մեդիա ֆայլ
ko: 미디어 파일
ne: मिडिया फाइल
sl: Medijska datoteka

source: Media file to upload
cy: Ffeil cyfryngau i'w llwytho
hy: Մեդիա ֆայլ՝ վերբեռնելու համար
ko: 업로드할 미디어 파일
ne: मिडिया फाइल अपलोड गर्न
sl: Medijska datoteka za nalaganje

source: Filename on server
cy: Enw ffeil ar y gweinydd
hy: Ֆայլի անունը սերվերի վրա
ko: 서버의 파일이름
ne: सर्भरको फाइल नाम
sl: Ime datoteke na strežniku

source: Leave this entry blank to keep the original filename
cy: Gadewch y cofnod hwn yn wag i gadw enw'r ffeil wreiddiol
hy: Այս գրառումը դատարկ թողեք՝ սկզբնական ֆայլի անունը պահպանելու համար
ko: 원래 파일 이름을 유지하려면 이 항목을 비워 둡니다
ne: मूल फाइलनाम राख्न यो प्रविष्टि खाली छोड्नुहोस्
sl: Pustite ta vnos prazen, da ohranite izvirno ime datoteke

source: Folder name on server
cy: Enw'r ffolder ar y gweinydd
hy: Թղթապանակի անունը սերվերի վրա
ko: 서버의 폴더 이름
ne: सर्भरमा फोल्डरको नाम
sl: Ime mape na strežniku

source: upload
cy: llwytho i fyny
hy: վերբեռնել
ko: 업로드
ne: अपलोड गर्नुहोस
sl: Naloži

source: Media files
cy: Ffeiliau cyfryngau
hy: Մեդիա ֆայլեր
ko: 미디어 파일
ne: मिडिया फाइलहरू
sl: Medijske datoteke

source: Media folders
cy: Ffolderi cyfryngau
hy: Մեդիա թղթապանակներ
ko: 미디어 폴더
ne: मिडिया फोल्डरहरू
sl: Medijske mape

source: Local files
cy: Ffeiliau lleol
hy: Տեղական ֆայլեր
ko: 로컬 파일
ne: स्थानीय फाइलहरू
sl: Lokalne datoteke

source: External files
cy: Ffeiliau allanol
hy: Արտաքին ֆայլեր
ko: 외부 파일
ne: बाह्य फाइलहरू
sl: Zunanje datoteke

source: Unused files
cy: Ffeiliau heb eu defnyddio
hy: Չօգտագործված ֆայլեր
ko: 사용하지 않는 파일
ne: प्रयोग नगरिएका फाइलहरू
sl: Neuporabljene datoteke

source: Media folder
cy: Ffolder cyfryngau
hy: Մեդիա թղթապանակ
ko: 미디어 폴더
ne: मिडिया फोल्डर
sl: Medijska mapa

source: Include subfolders
cy: Yn cynnwys is-ffolderi
hy: Ներառեք ենթաթղթապանակներ
ko: 하위 폴더 포함
ne: सबफोल्डरहरू समावेश गर्नुहोस्
sl: Vključi podmape

source: Exclude subfolders
cy: Yn eithrio is-ffolderi
hy: Բացառել ենթաթղթապանակները
ko: 하위 폴더 제외
ne: सबफोल्डरहरू समावेश नगर्नुहोस्
sl: Izključi podmape

source: External media files have a URL instead of a filename.
cy: Mae gan ffeiliau cyfryngau allanol URL yn lle enw ffeil.
hy: Արտաքին մեդիա ֆայլերը ֆայլի անվան փոխարեն ունեն URL:
ko: 외부 미디어 파일에는 파일 이름 대신 URL이 있습니다.
ne: बाह्य मिडिया फाइलहरूमा फाइलनामको सट्टा URL हुन्छ।
sl: Zunanje medijske datoteke imajo URL namesto imena datoteke.

source: Select two records to merge.
cy: Dewiswch ddau gofnod i'w cyfuno.
hy: Միավորելու համար ընտրեք երկու գրառում:
ko: 병합 할 두 개의 레코드를 선택하십시오.
ne: मर्ज गर्न दुई रेकर्डहरू चयन गर्नुहोस्।
sl: Izberite zapisa za združitev.

source: First record
cy: Cofnod cyntaf
hy: Առաջին ռեկորդը
ko: 첫번째 기록
ne: पहिलो रेकर्ड
sl: Prvi zapis

source: Second record
cy: Yr ail gofnod
hy: Երկրորդ ռեկորդը
ko: 두번째 레코드
ne: दोस्रो रेकर्ड
sl: Drugi zapis

source: Select the facts and events to keep from both records.
cy: Dewis y ffeithiau a'r digwyddiadau i'w cadw o'r ddau gofnod.
hy: Ընտրեք փաստերն ու իրադարձությունները, որոնք պետք է պահպանվեն երկու գրառումներից:
ko: 두 레코드에서 보관할 정보 및 이벤트를 선택하십시오.
ne: दुबै रेकर्डबाट राख्नका लागि तथ्य र घटनाहरू चयन गर्नुहोस्।
sl: Izberite dejstva in dogodke, ki jih želite izključiti iz obeh zapisov.

source: The following facts and events were found in both records.
cy: Mae'r ffeithiau a'r digwyddiadau canlynol yn y ddau gofnod.
hy: Երկու արձանագրություններում էլ հայտնաբերվել են հետևյալ փաստերն ու իրադարձությունները.
ko: 다음 정보와 이벤트는 2개의 레코드에서 발견되었습니다.
ne: दुवै अभिलेखमा निम्न तथ्य र घटनाहरू फेला परेका थिए।
sl: Oba zapisa vsebujeta naslednja dejstva in dogodke.

source: Select
cy: Dewis
hy: Ընտրել
ko: 선택
ne: चयन गर्नुहोस्
sl: Izberi

source: Details
cy: Manylion
hy: Մանրամասներ
ko: 상세한
ne: विस्तृत विवरण
sl: Podrobnosti

source: No matching facts found
cy: Dim ffeithiau cyfatebol
hy: Համընկնող փաստեր չեն գտնվել
ko: 일치하는 정보를 찾을 수 없습니다
ne: कुनै मिल्दो तथ्य फेला परेन
sl: Ni primerljivih dejstev

source: The following facts and events were only found in the record of %s.
cy: Dim ond yng nghofnod %s y cafwyd y ffeithiau a'r digwyddiadau canlynol.
hy: Հետևյալ փաստերն ու իրադարձությունները հայտնաբերվել են միայն %s -ի գրառումներում:
ko: 다음 정보와 이벤트는 %s의 레코드에서만 발견되었습니다.
ne: निम्न तथ्य र घटनाहरू %s को रेकर्डमा मात्र फेला परेका थिए।
sl: Samo zapis %s vsebuje naslednja dejstva in dogodke.

source: Preferences exist for the module “%s”, but this module no longer exists.
cy: Mae dewisiadau ar gyfer y modiwl “%s”, ond nid yw'r modiwl hwn yn bodoli mwyach.
hy: Նախապատվություններ կան «%s» մոդուլի համար, սակայն այս մոդուլն այլևս գոյություն չունի:
ko: \"%s\" 모듈에 대한 기본 설정이 있지만 이 모듈은 더 이상 존재하지 않습니다.
ne: मोड्युल "%s" को लागि प्राथमिकताहरू अवस्थित छन्, तर यो मोड्युल अब अवस्थित छैन।
sl: Nastavitve modula “%s” obstajajo, vendar modul ne obstaja več.

source: Delete the preferences for this module.
cy: Dileu'r dewisiadau ar gyfer y modiwl hwn.
hy: Ջնջել այս մոդուլի նախապատվությունները:
ko: 이 모듈에 대한 환경 설정을 삭제하십시오.
ne: यो मोड्युलका लागि प्राथमिकताहरू मेटाउनुहोस्।
sl: Izbriši nastavitve tega modula.

source: Module administration
cy: Gweinyddu modiwl
hy: Մոդուլի կառավարում
ko: 모듈 관리
ne: मोड्युल प्रशासन
sl: Skrbništvo modula

source: Menu
cy: Dewislen
hy: Մենյու
ko: 메뉴
ne: मेनू॒
sl: Meni

source: Tab
hy: Ներդիր
ko: 탭
ne: ट्याब
sl: Zavihek

source: Sidebar
cy: Bar Ochr
hy: Կողային գոտի
ko: 사이드바
ne: छेउपट्टी
sl: Stranska vrstica

source: Chart
cy: Siart
hy: Գծապատկեր
ko: 차트
ne: चार्ट
sl: Diagram

source: List
cy: Rhestr
hy: Ցուցակ
ko: 목록
ne: सूची
sl: Seznam

source: Footer
cy: Troedyn
hy: Ստորագիր
ne: फुटर
sl: Noga

source: PHP information
cy: Manylion PHP
hy: PHP տեղեկատվություն
ko: PHP 정보
ne: PHP जानकारी
sl: Informacije o PHP

source: IP address
cy: Cyfeiriad IP
hy: IP հասցե
ne: आईपी ठेगाना
sl: Naslov IP

source: See %s for more information.
cy: Gweler %s am ragor o wybodaeth.
hy: Լրացուցիչ տեղեկությունների համար տե՛ս %s:
ko: 자세한 내용은 %s를 참조하십시오.
ne: थप जानकारीको लागि %s हेर्नुहोस्।
sl: Oglejte si %s za več informacij.

source: webtrees needs to send emails, such as password reminders and website notifications.
cy: mae angen i webtrees anfon e-byst, fel nodiadau atgoffa cyfrinair a hysbysiadau gwefan.
hy: webtrees-ը պետք է նամակներ ուղարկի, ինչպիսիք են գաղտնաբառի հիշեցումները և կայքի ծանուցումները:
ko: 웹 트리는 암호 미리 알림 및 웹 사이트 알림과 같은 이메일을 보내야 합니다.
ne: webtrees ले इमेलहरू पठाउन आवश्यक छ, जस्तै पासवर्ड रिमाइन्डरहरू र वेबसाइट सूचनाहरू।
sl: webtrees pošilja e-poštna sporočila, kot so opomniki za geslo in obvestila spletišča.

source: Sender name
cy: Enw'r anfonwr
hy: Ուղարկողի անունը
ko: 보낸 사람 이름
ne: पठाउनेको नाम
sl: Ime pošiljatelja

source: This name is used in the “From” field, when sending automatic emails from this server.
cy: Mae'r enw hwn yn cael ei ddefnyddio yn y maes “Oddi wrth”, wrth anfon e-byst awtomatig o'r gweinydd hwn.
hy: Այս անունը օգտագործվում է «From» դաշտում՝ այս սերվերից ավտոմատ նամակներ ուղարկելիս:
ko: 이 이름은 이 서버에서 자동 이메일을 보낼 때 “보낸 사람” 필드에 사용됩니다.
ne: यो नाम "बाट" फिल्डमा प्रयोग गरिन्छ, यो सर्भरबाट स्वचालित इमेलहरू पठाउँदा।
sl: To ime je uporabljeno v polju “Od”, kadar strežnik pošilja samodejna e-poštna sporočila.

source: Sender email
hy: Ուղարկողի էլ
ko: 이메일 보내기
ne: प्रेषक इमेल

source: Most mail servers require a valid email address.
cy: Mae angen cyfeiriad e-bost dilys ar y mwyafrif o weinyddion e-bost.
hy: Փոստի սերվերներից շատերը պահանջում են վավեր էլփոստի հասցե:
ko: 대부분의 메일 서버에는 유효한 이메일 주소가 필요합니다.
ne: धेरैजसो मेल सर्भरहरूलाई मान्य इमेल ठेगाना चाहिन्छ।
sl: Večina poštnih strežnikov zahteva veljaven e-poštni naslov.

source: SMTP mail server
cy: Gweinydd e-bost SMTP
hy: SMTP փոստի սերվեր
ko: SMTP 메일 서버
ne: SMTP मेल सर्भर
sl: SMTP poštni strežnik

source: Server name
cy: Enw gweinydd
hy: Սերվերի անունը
ko: 서버 이름
ne: सर्भर नाम
sl: Ime strežnika

source: This is the name of the SMTP server. “localhost” means that the mail service is running on the same computer as your web server.
cy: Dyma enw'r gweinydd SMTP. Mae “localhost” yn golygu bod y gwasanaeth post yn rhedeg ar yr un cyfrifiadur â'ch gweinydd gwe.
hy: Սա SMTP սերվերի անունն է: «localhost» նշանակում է, որ փոստային ծառայությունն աշխատում է ձեր վեբ սերվերի հետ նույն համակարգչով:
ko: 이것은 SMTP 서버의 이름입니다. “localhost”는 메일 서비스가 웹 서버와 동일한 컴퓨터에서 실행되고 있음을 의미합니다.
ne: यो SMTP सर्भरको नाम हो। "localhost" को अर्थ हो कि मेल सेवा तपाईको वेब सर्भर जस्तै कम्प्युटरमा चलिरहेको छ।
sl: To je ime SMTP strežnika. Ime “localhost” pomeni, da poštni strežnik deluje na istem računalniku, kot spletni strežnik.

source: Port number
cy: Rhif porth
hy: Նավահանգստի համարը
ko: Port 번호
ne: पोर्ट नम्बर
sl: Številka vrat

source: By default, SMTP works on port 25.
cy: Trwy ragosodiad, mae SMTP yn gweithio ar borth 25.
hy: Լռելյայնորեն, SMTP-ն աշխատում է 25-րդ նավահանգստում:
ko: 기본적으로 SMTP는 포트 25에서 작동합니다.
ne: पूर्वनिर्धारित रूपमा, SMTP पोर्ट 25 मा काम गर्दछ।
sl: Privzeto SMTP deluje na vratih številka 25.

source: Use password
cy: Defnyddio cyfrinair
hy: Օգտագործեք գաղտնաբառը
ko: 비밀번호 사용
ne: पासवर्ड प्रयोग गर्नुहोस्
sl: Uporabi geslo

source: Most SMTP servers require a password.
cy: Mae angen cyfrinair ar y mwyafrif o weinyddion SMTP.
hy: SMTP սերվերների մեծ մասը պահանջում է գաղտնաբառ:
ko: 대부분의 SMTP 서버에는 암호가 필요합니다.
ne: धेरै जसो SMTP सर्भरहरूलाई पासवर्ड चाहिन्छ।
sl: Večina SMTP strežnikov zahteva geslo.

source: Username
cy: Enw defnyddiwr
hy: Օգտվողի անունը
ko: 사용자 이름
ne: प्रयोगकर्ता नाम
sl: Uporabniško ime

source: The username required for authentication with the SMTP server.
cy: Yr enw defnyddiwr sy'n ofynnol i'w ddilysu gyda'r gweinydd SMTP.
hy: SMTP սերվերի հետ նույնականացման համար անհրաժեշտ օգտվողի անունը:
ko: SMTP 서버 인증에 필요한 사용자 이름입니다.
ne: SMTP सर्भरसँग प्रमाणीकरणको लागि आवश्यक प्रयोगकर्ता नाम।
sl: Uporabniško ime, zahtevano za avtentikacijo pri SMTP strežniku.

source: Password
cy: Cyfrinair
hy: Գաղտնաբառ
ko: 비밀번호
ne: पासवर्ड
sl: Geslo

source: show
cy: dangos
hy: ցույց տալ
ko: 표시
ne: देखाउनुहोस्
sl: Pokaži

source: Show password
hy: Ցույց տալ գաղտնաբառը
ko: 비밀번호 표시
ne: पासवर्ड देखाउनुहोस्

source: hide
cy: cuddio
hy: թաքցնել
ko: 숨김
ne: लुकाउनुहोस्
sl: Skrij

source: Hide password
hy: Թաքցնել գաղտնաբառը
ko: 비밀번호 숨기기
ne: पासवर्ड लुकाउनुहोस्

source: The password required for authentication with the SMTP server.
cy: Y cyfrinair sy'n ofynnol i'w ddilysu gyda'r gweinydd SMTP.
hy: SMTP սերվերի հետ նույնականացման համար անհրաժեշտ գաղտնաբառը:
ko: SMTP 서버 인증에 필요한 비밀번호입니다.
ne: SMTP सर्भरसँग प्रमाणीकरणको लागि आवश्यक पासवर्ड।
sl: Geslo, zahtevano za avtentikacijo pri SMTP strežniku.

source: Secure connection
cy: Cysylltiad diogel
hy: Ապահով կապ
ko: 보안접속
ne: सुरक्षित जडान
sl: Zaščitena povezava

source: Most servers do not use secure connections.
cy: Nid yw'r mwyafrif o weinyddion yn defnyddio cysylltiadau diogel.
hy: Սերվերների մեծ մասը չի օգտագործում անվտանգ կապեր:
ko: 대부분의 서버는 보안 연결을 사용하지 않습니다.
ne: धेरै सर्भरहरूले सुरक्षित जडानहरू प्रयोग गर्दैनन्।
sl: Večina strežnikov ne uporablja zaščitenih povezav.

source: Sending server name
cy: Yn anfon enw gweinydd
hy: Ուղարկվում է սերվերի անունը
ko: 보내는 서버 이름
ne: सर्भरको नाम पठाउँदै
sl: Ime odhodnega strežnika

source: Most mail servers require that the sending server identifies itself correctly, using a valid domain name.
cy: Mae'r rhan fwyaf o weinyddion e-bost yn mynnu bod y gweinydd anfon yn nodi ei hun yn gywir, gan ddefnyddio enw parth dilys.
hy: Փոստի սերվերներից շատերը պահանջում են, որ ուղարկող սերվերն իրեն ճիշտ նույնականացնի՝ օգտագործելով վավեր տիրույթի անուն:
ko: 대부분의 메일 서버는 보내는 서버가 유효한 도메인 이름을 사용하여 자신을 올바르게 식별해야 합니다.
ne: धेरै जसो मेल सर्भरहरूलाई पठाउने सर्भरले मान्य डोमेन नाम प्रयोग गरी सही रूपमा पहिचान गर्न आवश्यक हुन्छ।
sl: Večina poštnih strežnikov zahteva, da se odhodni strežnik pravilno identificira, z uporabo veljavnega imena domene.

source: Most mail servers require a valid domain name.
cy: Mae angen enw parth dilys ar y mwyafrif o weinyddion e-bost.
hy: Փոստի սերվերներից շատերը պահանջում են վավեր տիրույթի անուն:
ko: 대부분의 메일 서버에는 유효한 도메인 이름이 필요합니다.
ne: धेरै मेल सर्भरहरूलाई मान्य डोमेन नाम चाहिन्छ।
sl: Večina poštnih strežnikov zahteva veljavno ime domene.

source: DKIM digital signature
cy: Llofnod digidol DKIM
hy: DKIM թվային ստորագրություն
ko: DKIM 디지털 서명
ne: DKIM डिजिटल हस्ताक्षर
sl: DKIM digitalni podpis

source: Domain name
cy: Enw Parth
hy: Դոմենի անուն
ko: 도메인 네임
ne: डोमेन नाम
sl: Ime domene

source: Selector
cy: Dewisydd
hy: Ընտրիչ
ko: 선택요소
ne: चयनकर्ता
sl: Izbirnik

source: Private key
cy: Allwedd breifat
hy: Անձնական բանալի
ko: 개인 키
ne: निजी कुञ्जी
sl: Zasebni ključ

source: Send a test email using these settings
cy: Anfon e-bost prawf gan ddefnyddio'r gosodiadau hyn
hy: Ուղարկեք փորձնական նամակ՝ օգտագործելով այս կարգավորումները
ko: 이 설정을 사용하여 테스트 전자 메일을 보냅니다
ne: यी सेटिङहरू प्रयोग गरेर परीक्षण इमेल पठाउनुहोस्
sl: Pošlji testno e-pošto s temi nastavitvami

source: Data folder
cy: Ffolder data
hy: Տվյալների թղթապանակ
ko: 데이터 폴더
ne: डाटा फोल्डर
sl: Mapa s podatki

source: This folder will be used by webtrees to store media files, GEDCOM files, temporary files, etc. These files may contain private data, and should not be made available over the internet.
cy: Bydd y ffolder hwn yn cael ei defnyddio gan wefannau i storio ffeiliau cyfryngau, ffeiliau GEDCOM, ffeiliau dros dro, ac ati. Gall y ffeiliau hyn gynnwys data preifat, ac ni ddylent fod ar gael dros y rhyngrwyd.
hy: Այս թղթապանակը կօգտագործվի վեբ ծառերի կողմից՝ մեդիա ֆայլեր, GEDCOM ֆայլեր, ժամանակավոր ֆայլեր և այլն պահելու համար: Այս ֆայլերը կարող են պարունակել անձնական տվյալներ և չպետք է հասանելի լինեն ինտերնետի միջոցով:
ko: 이 폴더는 웹 트리에서 미디어 파일, GEDCOM 파일, 임시 파일 등을 저장하는 데 사용됩니다.이 파일은 개인 데이터를 포함 할 수 있으며 인터넷을 통해 사용할 수 없습니다.
ne: यो फोल्डर वेबट्रीहरू द्वारा मिडिया फाइलहरू, GEDCOM फाइलहरू, अस्थायी फाइलहरू, आदि भण्डारण गर्न प्रयोग गरिनेछ। यी फाइलहरूमा निजी डेटा समावेश हुन सक्छ, र इन्टरनेटमा उपलब्ध गराउनु हुँदैन।
sl: To mapo bo webtrees uporabljal za shranjevanje medijskih datotek, datotek GEDCOM, začasnih datotek itd. Te datoteke lahko vsebujejo zasebne podatke in ne smejo biti dostopne preko interneta.

source: To protect this private data, webtrees uses an Apache configuration file (.htaccess) which blocks all access to this folder. If your web-server does not support .htaccess files, and you cannot restrict access to this folder, then you can select another folder, away from your web documents.
cy: Er mwyn diogelu'r data preifat hwn, mae webtrees yn defnyddio ffeil ffurfweddu Apache (.htaccess) sy'n rhwystro'r holl fynediad i'r ffolder hwn. Os nad yw'ch gweinydd gwe yn cefnogi ffeiliau .htaccess, ac na allwch gyfyngu mynediad i'r ffolder hon, yna gallwch ddewis ffolder arall, i ffwrdd o'ch dogfennau gwe.
hy: Այս մասնավոր տվյալները պաշտպանելու համար webtrees-ն օգտագործում է Apache-ի կազմաձևման ֆայլ (.htaccess), որն արգելափակում է այս պանակի բոլոր մուտքը: Եթե ձեր վեբ-սերվերը չի աջակցում .htaccess ֆայլեր, և դուք չեք կարող սահմանափակել մուտքը դեպի այս թղթապանակ, ապա կարող եք ընտրել մեկ այլ թղթապանակ՝ հեռու ձեր վեբ փաստաթղթերից:
ko: 이 개인 데이터를 보호하기 위해 웹 트리는이 폴더에 대한 모든 액세스를 차단하는 Apache 구성 파일 (.htaccess)을 사용합니다. 웹 서버가 .htaccess 파일을 지원하지 않고이 폴더에 대한 액세스를 제한 할 수없는 경우 웹 문서에서 다른 폴더를 선택할 수 있습니다.
ne: यस निजी डेटालाई सुरक्षित गर्न, वेबट्रीहरूले Apache कन्फिगरेसन फाइल (.htaccess) प्रयोग गर्दछ जसले यस फोल्डरमा सबै पहुँचलाई रोक्छ। यदि तपाईंको वेब-सर्भरले htaccess फाइलहरूलाई समर्थन गर्दैन, र तपाईंले यो फोल्डरमा पहुँच प्रतिबन्ध लगाउन सक्नुहुन्न भने, तपाईंले आफ्नो वेब कागजातहरूबाट टाढा अर्को फोल्डर चयन गर्न सक्नुहुन्छ।
sl: Za zaščito zasebnih podatkov webtrees uporablja nastavitveno datoteko Apache (.htaccess), ki blokira vsak dostop do te mape. Če vaš spletni strežnik ne podpira datotek .htaccess in ne morete omejiti dostopa do te mape, lahko izberete drugo mapo, izven mape, ki vsebuje spletne strani.

source: If you select a different folder, you must also move all files (except config.ini.php, index.php, and .htaccess) from the existing folder to the new folder.
cy: Os dewiswch ffolder wahanol, rhaid i chi hefyd symud pob ffeil (ac eithrio config.ini.php, index.php, a .htaccess) o'r ffolder bresennol i'r ffolder newydd.
hy: Եթե ընտրեք մեկ այլ պանակ, դուք պետք է նաև տեղափոխեք բոլոր ֆայլերը (բացի config.ini.php, index.php և .htaccess) առկա պանակից նոր թղթապանակ:
ko: 다른 폴더를 선택하는 경우 기존 폴더에서 새 폴더로 모든 파일(config.ini.php, index.php 및 .htaccess 제외)도 이동해야 합니다.
ne: यदि तपाईंले फरक फोल्डर चयन गर्नुभयो भने, तपाईंले अवस्थित फोल्डरबाट नयाँ फोल्डरमा सबै फाइलहरू (config.ini.php, index.php, र .htaccess बाहेक) सार्नुपर्छ।
sl: Če boste izbrali drugo mapo, boste morali premakniti tudi vse datoteke (razen config.ini.php, index.php in .htaccess) iz obstoječe mape v novo mapo.

source: The folder can be specified in full (e.g. /home/user_name/webtrees_data/) or relative to the installation folder (e.g. ../../webtrees_data/).
cy: Mae modd nodi'r ffolder yn llawn (e.e. / home / user_name / webtrees_data /) neu'n gymharol â'r ffolder gosod (e.e. ../../webtrees_data/).
hy: Թղթապանակը կարելի է ամբողջությամբ նշել (օրինակ՝ /home/user_name/webtrees_data/) կամ հարաբերական լինել տեղադրման թղթապանակին (օրինակ՝ ../../webtrees_data/):
ko: 폴더는 전체 (예 : /home/user_name/webtrees_data/) 또는 설치 폴더 (예 : ../../webtrees_data/)와 관련하여 지정할 수 있습니다.
ne: फोल्डर पूर्ण रूपमा निर्दिष्ट गर्न सकिन्छ (जस्तै /home/user_name/webtrees_data/) वा स्थापना फोल्डरसँग सापेक्ष (जस्तै ../../webtrees_data/)।
sl: Mapo je mogoče določiti absolutno(npr. /home/user_name/webtrees_data/) ali relativno, glede na namestitveno mapo (npr. ../../webtrees_data/).

source: The time zone is required for date calculations, such as knowing today’s date.
cy: Mae angen y parth amser ar gyfer cyfrifo dyddiad, fel gwybod dyddiad heddiw.
hy: Ժամային գոտին պահանջվում է ամսաթվի հաշվարկների համար, օրինակ՝ այսօրվա ամսաթիվը իմանալու համար:
ko: 시간대는 오늘 날짜 알기 등의 날짜 계산에 필요합니다.
ne: मिति गणनाको लागि समय क्षेत्र आवश्यक छ, जस्तै आजको मिति थाहा पाउन।
sl: Časovni pas je potreben za datumske izračune, kot je na primer izračunavanje današnjega datuma.

source: Default theme
cy: Thema ragosodedig
hy: Կանխադրված թեմա
ko: 기본 테마
ne: पूर्वनिर्धारित थीम
sl: Privzeta tema

source: You can change the appearance of webtrees using “themes”. Each theme has a different style, layout, color scheme, etc.
cy: Gallwch newid ymddangosiad gwefannau gan ddefnyddio “themâu”. Mae gan bob thema arddull, cynllun a chynllun lliw gwahanol, ac ati.
hy: Դուք կարող եք փոխել վեբ ծառերի տեսքը՝ օգտագործելով «թեմաներ»: Յուրաքանչյուր թեմա ունի տարբեր ոճ, դասավորություն, գունային սխեման և այլն:
ko: ”테마”를 사용하여 웹 트리의 모양을 변경할 수 있습니다. 각 테마마다 스타일, 레이아웃, 색 구성표 등이 다릅니다.
ne: तपाईं "विषयवस्तुहरू" प्रयोग गरेर webtrees को उपस्थिति परिवर्तन गर्न सक्नुहुन्छ। प्रत्येक विषयवस्तुको फरक शैली, लेआउट, रंग योजना, आदि हुन्छ।
sl: Videz webtrees lahko spremenite s pomočjo “tem”. Vsaka tema ima drugačen slog, postavitev, barvno shemo itd.
