Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: A report of the information that is missing for an individual and their relatives.
cy: Adroddiad am y wybodaeth sydd ar goll am unigolion a'u perthnasau.
hy: Անհատի և նրանց հարազատների համար բացակայող տեղեկությունների հաղորդում:
ko: 인물 및 친척에게 누락 된 정보에 대한 보고서.
ne: एक व्यक्ति र तिनका आफन्तहरूका लागि हराइरहेको जानकारीको रिपोर्ट ।
sl: Poročilo o manjkajočih podatkih osebe in njenih sorodnikov.

source: Add historic events to an individual’s page.
cy: Ychwanegu digwyddiadau hanesyddol at dudalen unigolyn.
hy: Պատմական իրադարձություններ ավելացրեք անհատի էջին:
ko: 인물 페이지에 역사적인 사건을 추가.
ne: एक व्यक्तिको पृष्ठमा ऐतिहासिक घटनाहरू थप्नुहोस्।
sl: Dodaj zgodovinske dogodke na osebno stran.

source: Use an external service to find locations.
hy: Օգտագործեք արտաքին ծառայություն՝ վայրեր գտնելու համար:
ko: 외부 서비스를 사용하여 위치를 찾습니다.
ne: स्थानहरू फेला पार्न बाह्य सेवा प्रयोग गर्नुहोस्।

source: Map link
hy: Քարտեզի հղում
ko: 지도 링크
ne: नक्सा लिङ्क

source: View this location using %s
hy: Դիտեք այս վայրը՝ օգտագործելով %s-ը
ko: %s을(를) 사용하여 이 위치 보기
ne: %s प्रयोग गरेर यो स्थान हेर्नुहोस्

source: Theme
cy: Thema
hy: Թեմա
ko: 테마
ne: विषयवस्तु
sl: Tema

source: Family with spouse
cy: Teulu gyda'r priod
hy: Ընտանիք ամուսնու հետ
ko: 배우자가 있는 가족
ne: जीवनसाथीसँग परिवार
sl: Družina z zakoncem

source: Customize this page
cy: Cyfaddasu'r dudalen hon
hy: Անհատականացրեք այս էջը
ko: 페이지 사용자설정
ne: यो पृष्ठ आफ्नो अनुकुल बनाउनुहोस्
sl: Prilagodi to stran

source: My individual record
cy: Fy nghofnod unigol
hy: Իմ անհատական ռեկորդը
ko: 나의 인물 레코드
ne: मेरो व्यक्तिगत रेकर्ड
sl: Moj osebni zapis

source: My pages
cy: Fy nhudalennau
hy: Իմ էջերը
ko: 나의 페이지
ne: मेरा पृष्ठहरू
sl: Moje strani

source: My pedigree
cy: Fy nrhas
hy: Իմ տոհմը
ko: 나의 가계
ne: मेरो वंशावली
sl: Moj rodovnik

source: Shared notes
cy: Nodiadau i'w rhannu
hy: Համօգտագործվող նշումներ
ko: 공유 노트
ne: साझा टिप्पणीहरू
sl: Deljene opombe

source: A list of shared notes.
cy: Rhestr o nodiadau i'w rhannu.
hy: Համօգտագործվող նշումների ցանկ:
ko: 공유 노트 목록.
ne: साझा गरिएका नोटहरूको सूचि ।
sl: Seznam deljenih opomb.

source: A tab showing the notes attached to an individual.
cy: Tab yn dangos y nodiadau sydd ynghlwm wrth unigolyn.
hy: Ներդիր, որը ցույց է տալիս անհատին կցված նշումները:
ko: 인물에게 첨부 된 노트를 보여주는 탭.
ne: एक व्यक्तिमा संलग्न नोटहरू देखाउने ट्याब।
sl: Zavihek, ki prikazuje pripombe, povezane z osebo.

source: Occupations
cy: Galwedigaethau
hy: Զբաղմունքներ
ko: 직업
ne: पेशाहरू
sl: Poklici

source: A report of individuals who had a given occupation.
cy: Adroddiad am unigolion a oedd â galwedigaeth benodol.
hy: Տվյալ զբաղմունք ունեցող անձանց մասին հաշվետվություն։
ko: 인물의 직업에 관한 보고서.
ne: दिइएको पेशा भएका व्यक्तिहरूको रिपोर्ट।
sl: Poročilo o osebah, z določenim poklicem.

source: On this day
cy: Ar y diwrnod hwn
hy: Այս օրը
ko: 오늘
ne: यो दिनमा
sl: Na današnji dan

source: A list of the anniversaries that occur today.
cy: Rhestr o'r dathliadau sy'n digwydd heddiw.
hy: Այսօրվա տարեդարձերի ցանկը:
ko: 오늘의 주요 기념일.
ne: आजको दिनमा पर्ने वार्षिकीहरुको सूची।
sl: Seznam obletnic, ki so se zgodile na današnji dan.

source: No events for living individuals exist for today.
hy: Այսօրվա համար կենդանի անհատների համար իրադարձություններ չկան:
ne: आजको लागि जीवित व्यक्तिहरूको लागि कुनै घटनाहरू अवस्थित छैनन्।

source: No events exist for today.
cy: Nid oes digwyddiadau ar gyfer heddiw.
hy: Այսօրվա համար իրադարձություններ չկան։
ko: 오늘의 이벤트가 없습니다.
ne: आजको लागि कुनै घटनाहरू अवस्थित छैनन्।
sl: Danes ni dogodkov.

source: sort by name
cy: trefnu yn ôl enw
hy: տեսակավորել ըստ անվանման
ko: 이름으로 정렬
sl: razvrsti po imenu

source: sort by date, oldest first
cy: trefnu yn ôl dyddiad, hynaf yn gyntaf
hy: տեսակավորել ըստ ամսաթվի, նախ ամենահինը
ko: 오래된 것부터, 날짜순으로 정렬
sl: razvrsti po datumu, najstarejši najprej

source: sort by date, newest first
cy: trefnu yn ôl dyddiad, diweddaraf yn gyntaf
hy: տեսակավորել ըստ ամսաթվի, սկզբում նորագույնը
ko: 날짜순으로 정렬, 최신순
sl: razvrsti po datumu, najnovejši najprej

source: A chart of an individual’s ancestors, formatted as a tree.
cy: Siart o hynafiaid unigolyn, wedi'i fformatio fel coeden.
hy: Անհատի նախնիների աղյուսակ՝ ձևավորված որպես ծառ:
ko: 트리 형식의 인물의 조상 차트.
ne: वृक्षका रूपमा बनाइएको व्यक्तिका पुर्खाहरू।
sl: Diagram potomcev osebe, oblikovan kot drevo.

source: Pedigree tree of %s
cy: Cart achau %s
hy: %s-ի տոհմածառ
ko: %s의 가계도
ne: %s को वंशवृक्ष
sl: Družinsko drevo osebe %s

source: left
cy: chwith
hy: ձախ
ko: 왼쪽
sl: Levo

source: right
cy: de
hy: ճիշտ
ko: 오른쪽
ne: सही
sl: Desno

source: up
cy: i fyny
hy: վերև
ko: 위로
ne: माथि
sl: Gor

source: down
cy: i lawr
hy: ներքեւ
ko: 아래
ne: तल
sl: Dol

source: Pedigree map
cy: Map achau
hy: Տոհմային քարտեզ
ko: 가계 지도
ne: वंशको नक्सा
sl: Zemljevid rodovnika

source: Show the birthplace of ancestors on a map.
cy: Dangos man geni hynafiaid ar fap.
hy: Քարտեզի վրա ցույց տվեք նախնիների ծննդավայրը:
ko: 조상의 출생지를 지도에 표시하십시오.
ne: नक्सामा पुर्खाहरूको जन्मस्थल देखाउनुहोस्।
sl: Prikaži rojstne kraje prednikov na zemljevidu.

source: Pedigree map of %s
cy: Map achau %s
hy: %s-ի տոհմային քարտեզ
ko: %s의 가계 지도
ne: %s को वंशको नक्शा
sl: Zemljevid rodovnika osebe %s

source: A report of an individual’s ancestors, formatted as a tree.
cy: Adroddiad am hynafiaid unigolyn, wedi'i fformatio fel coeden.
hy: Անհատի նախնիների հաշվետվություն՝ ձևավորված որպես ծառ:
ko: 트리 형식으로 된 인물의 조상에 대한 보고서입니다.
ne: एक व्यक्तिका पुर्खाहरूको रिपोर्ट वृक्षको रूपमा ।
sl: Poročilo o prednikih osebe, oblikovano kot drevo.

source: The place hierarchy.
cy: Yr hierarchaeth mannau.
hy: Տեղի հիերարխիա.
ko: 기록 된 장소.
ne: स्थान पदानुक्रम।
sl: Hierarhija krajev.

source: Show place hierarchy
cy: Dangos hierarchaeth mannau
hy: Ցույց տալ վայրերի հիերարխիան
ko: 기록 된 장소 구조 표시
ne: स्थानको आधारमा देखाउनुहोस्
sl: Prikaži hierarhijo krajev

source: Show all places in a list
cy: Dangos bob man mewn rhestr
hy: Ցուցադրել բոլոր վայրերը ցանկում
ko: 모든 장소 목록 표시
ne: सूचीमा सबै ठाउँहरू देखाउनुहोस्
sl: Prikaži seznam vseh krajev

source: Places
cy: Mannau
hy: Վայրեր
ko: 장소
ne: स्थानहरू
sl: Kraji

source: Show the location of events on a map.
cy: Dangoswch leoliad digwyddiadau ar fap.
hy: Ցույց տալ իրադարձությունների գտնվելու վայրը քարտեզի վրա:
ko: 이벤트의 위치를 지도에 표시하십시오.
ne: नक्सामा घटनाहरूको स्थान देखाउनुहोस्।
sl: Prikaži lokacije dogodkov na zemljevidu.

source: Birth of a child
cy: Genedigaeth plentyn
hy: Երեխայի ծնունդ
ko: 자녀의 출생
ne: बच्चाको जन्म
sl: Rojstvo otroka

source: Powered by webtrees™
cy: Wedi'i bweru gan webtrees ™
hy: սնուցվում է webtrees™
ne: Webtrees™ द्वारा संचालित
sl: Spletišče poganja webtrees™

source: A link to the webtrees home page.
cy: Dolen i dudalen gartref webtrees.
hy: Հղում դեպի webtrees գլխավոր էջի:
ko: Webtrees home page 링크입니다.
ne: Webtrees गृह पृष्ठको लिङ्क।
sl: Povezava do domače strani webtrees.

source: Privacy policy
cy: Polisi preifatrwydd
hy: Գաղտնիության քաղաքականություն
ko: 개인정보 정책
ne: गोपनीयता नीति
sl: Politika zasebnosti

source: Show a privacy policy.
cy: Dangos polisi preifatrwydd.
hy: Ցույց տալ գաղտնիության քաղաքականությունը:
ko: 개인 정보 보호 정책을 표시합니다.
ne: गोपनीयता नीति देखाउनुहोस्।
sl: Prikaži politiko zasebnosti.

source: Recent changes
cy: Newidiadau diweddar
hy: Վերջին փոփոխությունները
ko: 최근 변경 사항
ne: हालको परिवर्तनहरु
sl: Zadnje spremembe

source: A list of records that have been updated recently.
cy: Rhestr o gofnodion sydd wedi'u diweddaru yn ddiweddar.
hy: Վերջերս թարմացված գրառումների ցանկ:
ko: 최근에 업데이트 된 레코드 목록.
ne: हालै अपडेट गरिएका रेकर्डहरूको सूचि ।
sl: Seznam nedavno posodobljenih zapisov.

source: There have been no changes within the last %s day.
cy: Dim newidiadau o gwbl.
hy: Վերջին %s օր ընթացքում փոփոխություններ չեն եղել:
ko: 지난 %s일 동안 변경 사항이 없습니다.
ne: पछिल्लो %s दिन भित्र कुनै परिवर्तन भएको छैन।
sl: V zadnjem %s dnevu ni bilo sprememb.

source: Changes in the last %s day
cy: Newidiadau yn y %s dyddiau diwethaf
hy: Փոփոխություններ վերջին %s օր ընթացքում
ko: 지난 %s일 동안의 변경 사항
ne: पछिल्लो %s दिनमा भएको परिवर्तन
sl: Spremembe v zadnjem %s dnevu

source: show changes made in webtrees
cy: dangos newidiadau a wnaed yn webtrees
hy: ցույց տալ վեբ ծառերում կատարված փոփոխությունները
ko: 웹트리의 변경 사항 표시
sl: prikaži spremembe, narejene v webtrees

source: show changes recorded in the genealogy data
cy: dangos newidiadau a gofnodwyd yn y data achau
hy: ցույց տալ տոհմաբանական տվյալների մեջ գրանցված փոփոխությունները
ko: 계보 데이터에 기록된 변경 사항 표시
sl: prikaži spremembe, zapisane v rodoslovnih podatkih

source: Redirect old URLs from webtrees version 1.
cy: Ailgyfeirio hen URLau o fersiwn 1 webtrees.
hy: Վերահղեք հին URL-ները webtrees-ի 1-ին տարբերակից:
ko: WebTrees 버전 1에서 이전 URL 리디렉션.
ne: Webtrees संस्करण 1 बाट पुराना URL हरू रिडिरेक्ट गर्नुहोस्।
sl: Preusmeri stare URLje iz webtrees različice 1.

source: Legacy URLs
cy: Hen URLau
hy: Ժառանգական URL-ներ
ko: 기존 URL
ne: लिगेसी URL हरू
sl: Zastareli URL-ji

source: Related individuals
cy: Unigolion cysylltiedig
hy: Կապակցված անձինք
ko: 관련 인물
ne: सम्बन्धित व्यक्तिहरू
sl: Osebe v sorodstvenem razmerju

source: A report of the individuals that are closely related to an individual.
cy: Adroddiad am yr unigolion sy'n perthyn yn agos i unigolyn.
hy: Անհատների մասին հաշվետվություն, որոնք սերտորեն կապված են անհատի հետ:
ko: 인물과 밀접한 관련이있는 가족에 대한 보고서.
ne: व्यक्तिसँग नजिकको सम्बन्ध भएका व्यक्तिहरूको रिपोर्ट ।
sl: Poročilo o bližnjih sorodnikih določene osebe.

source: A chart displaying relationships between two individuals.
cy: Siart sy'n dangos y berthynas rhwng dau unigolyn.
hy: Գծապատկեր, որը ցույց է տալիս երկու անհատների հարաբերությունները:
ko: 두 인물의 관계를 보여주는 차트.
ne: दुई व्यक्तिहरू बीचको सम्बन्ध देखाउने चार्ट।
sl: Diagram, ki prikazuje sorodstveno razmerje med dvema osebama.

source: Relationship to me
cy: Perthynas â mi
hy: Հարաբերություններ ինձ հետ
ko: 나와 관계
ne: मेरो सम्बन्ध
sl: Sorodstveno razmerje do mene

source: Relationships
cy: Perthnasau
hy: Հարաբերություններ
ko: 관계
ne: सम्बन्धहरू
sl: Sorodstvena razmerja

source: Relationships between %1$s and %2$s
cy: Y berthynas rhwng %1$s a %2$s
hy: Հարաբերություններ %1$s-ի և %2$s-ի միջև
ko: %1$s와 %2$s의 관계
ne: %1$s र %2$s बीचको सम्बन्ध
sl: Sorodstvena razmerja med osebo %1$s in osebo %2$s

source: Relationship: %s
cy: Perthynas: %s
hy: Հարաբերություն՝ %s
ko: 관계: %s
ne: सम्बन्ध: %s
sl: Sorodstveno razmerje: %s

source: No link between the two individuals could be found.
cy: Heb ganfod unrhyw berthynas rhwng y ddau unigolyn.
hy: Երկու անձանց միջև որևէ կապ չի գտնվել:
ko: 두 인물 사이의 연결점을 찾을 수 없습니다.
ne: दुई व्यक्तिबीच कुनै सम्बन्ध भेटिएको छैन।
sl: Ni povezave med osebama.

source: Chart preferences
cy: Dewisiadau siart
hy: Գծապատկերների նախապատվությունները
ko: 차트 환경설정
ne: चार्ट प्राथमिकताहरू
sl: Nastavitve diagrama

source: Find any relationship
cy: Canfod unrhyw berthynas
hy: Գտեք ցանկացած հարաբերություն
ko: 관계 찾기
ne: नाता पत्ता लगाउनुहोस्
sl: Najdi katerokoli sorodstveno razmerje

source: Find relationships via ancestors
cy: Canfod y berthynas trwy'r hynafiaid
hy: Գտեք հարաբերություններ նախնիների միջոցով
ko: 조상을 통한 관계 찾기
ne: पुर्खामार्फत सम्बन्ध खोज्नुहोस्
sl: Najdi sorodstvena razmerja preko prednikov

source: unlimited
cy: diderfyn
hy: անսահմանափակ
ko: 제한없음
ne: असीमित
sl: neomejeno

source: Find all possible relationships
cy: Canfod yr holl berthnasoedd posib
hy: Գտեք բոլոր հնարավոր հարաբերությունները
ko: 가능한 모든 관계 찾기
ne: सबै सम्भावित सम्बन्धहरू खोज्नुहोस्
sl: Najdi vsa možna sorodstvena razmerja

source: Find other relationships
cy: Canfod perthnasoedd eraill
hy: Գտեք այլ հարաբերություններ
ko: 다른 관계 찾기
ne: अन्य सम्बन्धहरू खोज्नुहोस्
sl: Najdi druga sorodstvena razmerja

source: Find the closest relationships
cy: Canfod y perthnasoedd agosaf
hy: Գտեք ամենամոտ հարաբերությունները
ko: 가장 가까운 관계 찾기
ne: निकटतम सम्बन्धहरू फेला पार्नुहोस्
sl: Najdi najbližja sorodstvena razmerja

source: A tab showing the close relatives of an individual.
cy: Tab yn dangos perthnasau agos unigolyn.
hy: Ներդիր, որը ցույց է տալիս անհատի մերձավոր ազգականները:
ko: 인물의 친척을 보여주는 탭.
ne: एक व्यक्तिको नजिकका आफन्तहरू देखाउने ट्याब।
sl: Zavihek, ki prikazuje bližnje sorodnike osebe.

source: The reports menu.
cy: Y ddewislen adroddiadau.
hy: Հաշվետվությունների մենյու.
ko: 보고서 메뉴.
ne: रिपोर्ट मेनु।
sl: Meni poročil.

source: A list of repositories.
cy: Rhestr o'r storfannau sydd ar gael.
hy: Պահեստների ցանկ:
ko: 저장소 목록.
ne: भण्डारहरूको सूचि ।
sl: Seznam skladišč.

source: User
cy: Defnyddwyr
hy: Օգտատեր
ko: 사용자
ne: प्रयोगकर्ता
sl: Uporabnik

source: A list of tasks and activities that are linked to the family tree.
cy: Rhestr o dasgau a gweithgareddau sy'n gysylltiedig â'r cart achau.
hy: Առաջադրանքների և գործողությունների ցանկ, որոնք կապված են տոհմածառի հետ:
ko: 가계도에 연결된 직업 및 활동 목록.
ne: पारिवारिक वृक्षसँग जोडिएका कार्य र गतिविधिहरू ।
sl: Seznam nalog in dejavnosti, povezanih z družinskim drevesom.

source: There are no research tasks in this family tree.
cy: Nid oes unrhyw dasgau ymchwil yn y goeden deuluol hon.
hy: Այս տոհմածառում հետազոտական առաջադրանքներ չկան:
ko: 이 가계도에는 연구 과제가 없습니다.
ne: यस पारिवारिक रूखमा कुनै अनुसन्धान कार्यहरू छैनन्।
sl: V tem družinskem drevesu ni raziskovalnih opravil.

source: Research tasks
cy: Tasgau ymchwil
hy: Հետազոտական առաջադրանքներ
ko: 연구 작업
ne: अनुसन्धानात्मक कार्यहरू
sl: Raziskovalna opravila

source: A list of changes that need to be reviewed by a moderator, and email notifications.
cy: Rhestr o newidiadau y mae angen i gymedrolwr eu hadolygu, a hysbysiadau e-bost.
hy: Փոփոխությունների ցանկ, որոնք պետք է վերանայվեն մոդերատորի կողմից և էլփոստով ծանուցումներ:
ko: 중재자가 검토해야하는 변경 사항 목록 및 EMAIL 알림.
ne: परिवर्तनहरूको सूची जुन मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक छ र इमेल सूचनाहरू।
sl: Seznam sprememb, ki jih mora pregledati moderator, in e-poštnih obvestil.

source: There are pending changes for you to moderate.
cy: Mae yna gynigion newydd i chi eu cymedroli.
hy: Սպասվող փոփոխություններ կան, որոնց համար կարող եք վերահսկել:
ko: 평가할 보류중인 변경 사항이 있습니다.
ne: तपाईंका लागि परिवर्तनहरू मोडरेट गर्न बाँकी छन् ।
sl: Obstajajo spremembe, ki čakajo na moderacijo.

source: Last email reminder was sent
cy: Anfonwyd yr e-bost nodyn atgoffa olaf
hy: Վերջին էլփոստի հիշեցումն ուղարկվել է
ko: 마지막 이메일 알림이 전송되었습니다
ne: अन्तिम इमेल रिमाइन्डर पठाइयो
sl: Zadnje elektronsko opozorilo je bilo poslano

source: Next email reminder will be sent after
cy: Bydd y nodyn atgoffa e-bost nesaf yn cael ei anfon wedi
hy: Հաջորդ էլփոստի հիշեցումը կուղարկվի դրանից հետո
ko: 다음 이메일 알림은 다음 시간에 전송됩니다
ne: अर्को इमेल रिमाइन्डर पछि पठाइनेछ
sl: Naslednje elektronsko opozorilo bo poslano

source: Search
cy: Chwilio
hy: Որոնում
ko: 검색
ne: खोज्नुहोस्
sl: Iskanje

source: The search menu.
cy: Y ddewislen chwilio.
hy: Որոնման մենյու.
ko: 검색 메뉴.
ne: खोज मेनु।
sl: Iskalni meni.

source: Share the anniversary of an event
hy: Կիսվեք իրադարձության տարեդարձով
ko: 이벤트 기념일 공유
ne: एउटा कार्यक्रमको वार्षिकोत्सव साझा गर्नुहोस्

source: Download a .ICS file containing an anniversary
hy: Ներբեռնեք տարեդարձ պարունակող .ICS ֆայլ
ko: 기념일이 포함된 .ICS 파일 다운로드
ne: वार्षिकोत्सव भएको .ICS फाइल डाउनलोड गर्नुहोस्

source: Share the URL
hy: Կիսվեք URL-ով
ko: URL 공유
ne: URL साझा गर्नुहोस्

source: Copy the URL of the record to the clipboard
hy: Պատճենեք ձայնագրության URL-ը clipboard-ում
ko: 레코드의 URL을 클립보드에 복사
ne: रेकर्डको URL क्लिपबोर्डमा प्रतिलिपि गर्नुहोस्

source: Generate sitemap files for search engines.
cy: Cynhyrchu ffeiliau map safle ar gyfer peiriannau chwilio.
hy: Ստեղծեք կայքի քարտեզի ֆայլեր որոնման համակարգերի համար:
ko: 검색엔진을 위한 사이트맵 파일을 생성합니다.
ne: खोज इन्जिनहरूको लागि साइटम्याप फाइलहरू उत्पन्न गर्नुहोस्।
sl: Ustvari datoteko z zemljevidom spletišča za iskalnike.

source: Sitemaps
cy: Mapiau safle
hy: Կայքի քարտեզներ
ko: 사이트맵
ne: साइटम्यापहरू
sl: Zemljevidi spletišča

source: Random images from the current family tree.
cy: Delweddau ar hap o'r cart achau cyfredol.
hy: Պատահական պատկերներ ընթացիկ տոհմածառից:
ko: 현재 가족 트리에서 임의의 이미지.
ne: हालको पारिवारिक रूखबाट अनियमित छविहरू।
sl: Naključne slike iz trenutnega družinskega drevesa.

source: This family tree has no images to display.
cy: Nid oes gan y cart achau hwn unrhyw ddelweddau i'w dangos.
hy: Այս տոհմածառը ցուցադրելու պատկերներ չունի:
ko: 이 가계도에는 표시 할 이미지가 없습니다.
ne: यो पारिवारिक रूखसँग प्रदर्शन गर्न कुनै छविहरू छैनन्।
sl: To družinsko drevo nima slik za prikaz.

source: Slide show
cy: Sioe sleidiau
hy: Սլայդ շոու
ko: 슬라이드 쇼
ne: स्लाइड दृश्य
sl: Diaprojekcija

source: A list of sources.
cy: Rhestr o ffynonellau.
hy: Աղբյուրների ցանկ.
ko: 출처 목록.
ne: स्रोतहरूको सूचि ।
sl: Seznam virov.

source: A tab showing the sources linked to an individual.
cy: Tab yn dangos y ffynonellau sy'n gysylltiedig ag unigolyn.
hy: Ներդիր, որը ցույց է տալիս անհատի հետ կապված աղբյուրները:
ko: 인물에 연결된 출처를 보여주는 탭.
ne: एक व्यक्तिसँग लिङ्क गरिएको स्रोतहरू देखाउने ट्याब।
sl: Zavihek, ki prikazuje vire, povezane z osebo.

source: Various statistics charts.
cy: Siartiau ystadegau amrywiol.
hy: Տարբեր վիճակագրության գծապատկերներ:
ko: 다양한 통계 차트.
ne: विभिन्न तथ्याङ्क चार्टहरू।
sl: Različni statistični diagrami.

source: Month of birth
cy: Mis geni
hy: Ծննդյան ամիս
ko: 태어난 달
ne: जन्मेको महिना
sl: Mesec rojstva

source: Month of death
cy: Mis marwolaeth
hy: Մահվան ամիս
ko: 사망한 달
ne: मृत्युको महिना
sl: Mesec smrti

source: Month of marriage
cy: Mis priodi
hy: Ամուսնության ամիս
ko: 결혼한 달
ne: विवाहको महिना
sl: Mesec poroke

source: Month of birth of first child in a relation
cy: Mis geni'r plentyn cyntaf mewn perthynas
hy: Հարաբերության մեջ առաջին երեխայի ծննդյան ամիսը
ko: 관계에서 첫 자녀가 태어난 달
ne: सम्बन्धमा पहिलो बच्चा जन्मेको महिना
sl: Mesec rojstva prvega otroka v razmerju

source: Month of first marriage
cy: Mis y briodas gyntaf
hy: Առաջին ամուսնության ամիսը
ko: 초혼의 달
ne: पहिलो विवाह भएको महिना
sl: Mesec prve poroke

source: Average age at death
cy: Oed cyfartalog adeg marwolaeth
hy: Մահվան միջին տարիքը
ko: 사망 평균 연령
ne: मृत्युमा औसत उमेर
sl: Povprečna starost ob smrti

source: age
cy: oed
hy: տարիքը
ko: 나이
ne: उमेर
sl: starost

source: Age in year of marriage
cy: Oed ym mlwyddyn y briodas
hy: Տարիքը ամուսնության տարում
ko: 결혼한 나이
ne: विवाहको वर्षमा उमेर
sl: Starost v letu poroke

source: Age in year of first marriage
cy: Oed ym mlwyddyn y briodas gyntaf
hy: Տարիքը առաջին ամուսնության տարում
ko: 첫 결혼 연도
ne: पहिलो विवाहको वर्षमा उमेर
sl: Starost v letu prve poroke

source: Total
cy: Cyfanswm
hy: Ընդամենը
ko: 전체
ne: जम्मा
sl: Skupno

source: This information is not available.
cy: Dim gwybodaeth ar gael.
hy: Այս տեղեկությունը հասանելի չէ։
ko: 이 정보는 사용할 수 없습니다.
ne: यो जानकारी उपलब्ध छैन ।
sl: Ta informacija ni na voljo.

source: Century
cy: Canrif
hy: դար
ko: 세기
ne: शताब्दी
sl: Stoletje

source: Add narrative stories to individuals in the family tree.
cy: Ychwanegu straeon naratif i unigolion yn y cart achau.
hy: Տոհմածառի անհատներին ավելացրեք պատմողական պատմություններ:
ko: 가계도의 인물에 대화체의 스토리를 추가.
ne: पारिवारिक वृक्षमा व्यक्तिहरूका कथा थप्नुहोस्।
sl: Dodaj pripovedne zgodbe osebam v družinskem drevesu.

source: Stories
cy: Straeon
hy: Պատմություններ
ko: 스토리
ne: कथाहरु
sl: Zgodbe

source: Add a story
cy: Ychwanegu stori
hy: Ավելացնել պատմություն
ko: 스토리 추가
ne: कथा थप्नुहोस्
sl: Dodaj zgodbo

source: Edit the story
cy: Golygu'r stori
hy: Խմբագրել պատմությունը
ko: 이야기 편집
ne: कथा सम्पादन गर्नुहोस्
sl: Uredi zgodbo

source: A list of submitters.
cy: Rhestr o gyflwynwyr.
hy: Ներկայացնողների ցուցակ.
ko: 제출자 목록.
ne: पेश गर्नेहरूको सूचि ।
sl: Seznam pošiljateljev.

source: Theme change
cy: Newid thema
hy: Թեմայի փոփոխություն
ko: 테마 변경
ne: थिम बदल्नुहोस्
sl: Sprememba teme

source: An alternative way to select a new theme.
cy: Ffordd arall o ddewis thema newydd.
hy: Նոր թեմա ընտրելու այլընտրանքային միջոց:
ko: 새 테마를 선택하는 다른 방법입니다.
ne: नया थिम छान्न वैकल्पिक उपाय।
sl: Alternativni način za izbiro nove teme.

source: Timeline
cy: Llinell amser
hy: Ժամանակացույց
ko: 타임라인
ne: समयरेखा
sl: Časovnica

source: A timeline displaying individual events.
cy: Llinell amser yn dangos digwyddiadau unigol.
hy: Անհատական իրադարձություններ ցուցադրող ժամանակացույց:
ko: 인물의 사건을 표시하는 타임 라인.
ne: व्यक्तिगत घटनाहरू प्रदर्शन गर्ने समयरेखा।
sl: Časovnica, ki prikazuje posamezne dogodke.

source: Top given names
cy: Enwau cyntaf mwyaf poblogaidd
hy: Ամենահայտնի անունները
ko: 제일 많은 이름
ne: शीर्ष दिइएका नामहरू
sl: Najpogostejša imena

source: A list of the most popular given names.
cy: Rhestr o'r enwau cyntaf mwyaf poblogaidd.
hy: Ամենատարածված անունների ցանկը:
ko: 가장 많은 이름의 목록.
ne: लोकप्रिय नामहरूको सूचि ।
sl: Seznam najbolj popularnih imen.

source: Top given name
cy: Enw mwyaf poblogaidd
hy: Վերևում նշված անունը
ko: 제일 많은 이름
ne: शीर्ष दिइएको नाम
sl: Najpogostejše ime

source: Top %s given name
cy: %s enwau cyntaf mwyaf poblogaidd
hy: Լավագույն %s-ի անունը
ko: 상위 %s 이름
ne: शीर्ष %s दिइएको नाम
sl: Najpogostejše %s osebno ime

source: Most viewed pages
cy: Tudalennau poblogaidd
hy: Ամենաշատ դիտված էջերը
ko: 많이 본 페이지
ne: सर्वाधिक हेरिएको पेज
sl: Najbolj obiskane strani

source: A list of the pages that have been viewed the most number of times.
cy: Rhestr o'r tudalennau poblogaidd.
hy: Ամենաշատ անգամ դիտված էջերի ցանկը:
ko: 가장 많이 본 페이지 목록.
ne: धेरै पटक हेरिएको पानाहरुको सुची।
sl: Seznam največkrat obiskanih strani.

source: Top surnames
cy: Cyfenwau mwyaf poblogaidd
hy: Լավագույն ազգանունները
ko: 제일 많은 가문이름
ne: उच्च थरहरु
sl: Najpogostejši priimki

source: A list of the most popular surnames.
cy: Rhestr o'r cyfenwau mwyaf poblogaidd.
hy: Ամենատարածված ազգանունների ցանկը.
ko: 가장 많은 가문이름의 목록.
ne: धेरै प्रचलित थरहरुको सुची।
sl: Seznam najbolj popularnih priimkov.

source: Top surname
cy: Cyfenw mwyaf poblogaidd
hy: Վերևի ազգանունը
ko: 제일 많은 가문이름
ne: उच्च थर
sl: Najpogostejši priimek

source: Top %s surname
cy: %s cyfenwau mwyaf poblogaidd
hy: Լավագույն %s ազգանունը
ko: 상위 %s 가문이름
ne: शीर्ष %s थर
sl: Najpogostejši %s priimek

source: bullet list
cy: rhestr bwled
hy: փամփուշտների ցուցակ
ko: 글 머리 기호 목록
ne: बुलेट सुची
sl: označeni seznam

source: compact list
cy: rhestr gryno
hy: կոմպակտ ցուցակ
ko: 컴팩트 목록
ne: संकुचित सूची
sl: zgoščeni seznam

source: Family trees
cy: Cartau achau
hy: Տոհմածառեր
ko: 가계도
ne: परिवार वृक्षहरू
sl: Drevesa

source: The family trees menu.
cy: Y ddewislen cart achau.
hy: Ընտանեկան ծառերի մենյու.
ko: 가계도 메뉴.
ne: पारिवारिक रूखहरू मेनु।
sl: Meni družinskih dreves.

source: Upcoming events
cy: Digwyddiadau i ddod
hy: Առաջիկա իրադարձություններ
ko: 다가오는 이벤트
ne: आउदो कार्यक्रमहरु
sl: Prihajajoči dogodki

source: A list of the anniversaries that will occur in the near future.
cy: Rhestr o'r dathliadau a fydd yn digwydd yn y dyfodol agos.
hy: Առաջիկայում սպասվող հոբելյանների ցանկը:
ko: 며칠 뒤에 있을 주요 기념일.
ne: आउने वार्षिकोत्सवहरूको सूची ।
sl: Seznam obletnic, ki se bodo zgodile v bližnji prihodnosti.

source: No events for living individuals exist for tomorrow.
hy: Վաղվա համար կենդանի անհատների համար իրադարձություններ չկան:
ne: जीवित व्यक्तिहरूको लागि भोलिको लागि कुनै घटनाहरू अवस्थित छैनन्।

source: No events exist for tomorrow.
cy: Nid oes digwyddiadau yn bodoli ar gyfer yfory.
hy: Վաղվա համար իրադարձություններ չկան։
ko: 내일은 이벤트가 없습니다.
ne: भोलिको लागि कुनै घटनाहरू अवस्थित छैनन्।
sl: Jutri ni dogodkov.

source: No events for living people exist for the next %s day.
hy: Հաջորդ %s օրվա համար կենդանի մարդկանց համար միջոցառումներ չկան:
ne: अर्को %s दिनको लागि जीवित व्यक्तिहरूको लागि कुनै घटना अवस्थित छैन।

source: No events exist for the next %s day.
cy: Nid oes digwyddiadau yn bodoli ar gyfer y %s dyddiau nesaf.
hy: Հաջորդ %s օր համար իրադարձություններ չկան:
ko: 다음 %s일 동안 이벤트가 없습니다.
ne: अर्को %s दिनको लागि कुनै घटना छैन।
sl: Ni dogodkov za naslednji %s dan.

source: sort by date
cy: trefnu yn ôl dyddiad
hy: տեսակավորել ըստ ամսաթվի
ko: 날짜순으로 정렬
sl: razvrsti po datumu

source: Display and manage a user’s favorite pages.
cy: Dangos a rheoli hoff dudalennau defnyddiwr.
hy: Ցուցադրել և կառավարել օգտվողի սիրելի էջերը:
ko: 사용자가 좋아하는 페이지를 표시하고 관리합니다.
ne: प्रयोगकर्ताको मनपर्ने पृष्ठहरू प्रदर्शन र व्यवस्थापन गर्नुहोस्।
sl: Prikažite in upravljajte priljubljene strani uporabnika.
