Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Children in family
cy: Plant yn y teulu
hy: Երեխաները ընտանիքում
ko: 가족의 자녀들
ne: परिवारमा छोराछोरी
sl: Otroci v družini

source: Largest number of grandchildren
cy: Y nifer fwyaf o wyrion
hy: Ամենամեծ թվով թոռներ
ko: 가장 많은 수의 손주
ne: सबैभन्दा धेरै नातिनातिनाहरू
sl: Največje število vnukov

source: Create your own chart
cy: Creu eich siart eich hun
hy: Ստեղծեք ձեր սեփական աղյուսակը
ko: 나만의 차트 만들기
ne: तपाईंको आफ्नै चार्ट सिर्जना गर्नुहोस्
sl: Ustvari lasten diagram

source: Categories
cy: Categorïau
hy: Կատեգորիաներ
ko: 카테고리
ne: कोटि
sl: Kategorije

source: sex
hy: Սեռ
ne: लिंग

source: date periods
cy: cyfnodau dyddiad
hy: ամսաթվի ժամանակաշրջանները
ko: 날짜 기간
ne: मिति अवधिहरू
sl: Datumska obdobja

source: from %1$s interval %2$s year
cy: o %1$s cyfnod o %2$s blynyddoedd
hy: %1$s ընդմիջումից %2$s տարի
ko: %1$s 간격에서 %2$s 년
ne: %1$s अन्तराल %2$s वर्षबाट
sl: od %1$s interval %2$s leto

source: Results
cy: Canlyniadau
hy: Արդյունքներ
ko: 결과
ne: परिणामहरू
sl: Rezultati

source: numbers
cy: rhifau
hy: թվեր
ko: 수
sl: številke

source: percentage
cy: canran
hy: տոկոսը
ko: 백분율
ne: प्रतिशत
sl: odstotki

source: Age interval
cy: Egwyl oed
hy: Տարիքային ընդմիջում
ko: 나이 간격
ne: उमेर अन्तराल
sl: Starostni interval

source: Select the desired age interval
cy: Dewiswch yr egwyl oed dewisol
hy: Ընտրեք ցանկալի տարիքային միջակայքը
ko: 원하는 나이 간격을 선택하십시오
ne: इच्छित उमेर अन्तराल चयन गर्नुहोस्
sl: Izberite želeni starostni interval

source: Geographic area
cy: Ardal ddaearyddol
hy: Աշխարհագրական տարածք
ko: 지리적 영역
ne: भौगोलिक क्षेत्र
sl: Geografsko območje

source: Europe
cy: Ewrop
hy: Եվրոպա
ne: युरोप
sl: Evropa

source: Northern America
cy: Gogledd America
hy: Հյուսիսային Ամերիկա
ne: उत्तरी अमेरिका
sl: Severna Amerika

source: South America
cy: De America
hy: Հարավային Ամերիկա
ne: दक्षिण अमेरिका
sl: Južna Amerika

source: Asia
hy: Ասիա
ne: एसिया
sl: Azija

source: Middle East
cy: Y Dwyrain Canol
hy: Մերձավոր Արևելք
ne: मिडल ईष्ट
sl: Bližnji vzhod

source: Africa
cy: Affrica
hy: Աֆրիկա
ko: 아프리카
ne: अफ्रिका
sl: Afrika

source: show the chart
cy: dangos y siart
hy: ցույց տալ աղյուսակը
ko: 차트 표시
sl: Pokaži diagram

source: Total marriages
cy: Cyfanswm priodasau
hy: Ընդհանուր ամուսնություններ
ko: 전체 결혼
ne: कुल विवाह
sl: Skupno število porok

source: Earliest marriage
cy: Priodas gynharaf
hy: Ամենավաղ ամուսնությունը
ko: 가장 빠른 결혼
ne: प्रारम्भिक विवाह
sl: Najzgodnejša poroka

source: Latest marriage
cy: Priodas ddiweddaraf
hy: Վերջին ամուսնությունը
ko: 최근 결혼
ne: पछिल्लो विवाह
sl: Zadnja poroka

source: Total divorces
cy: Cyfanswm ysgariadau
hy: Ընդհանուր ամուսնալուծություններ
ko: 전체 이혼
ne: कुल सम्बन्धविच्छेदहरू
sl: Skupno število ločitev

source: Earliest divorce
cy: Ysgariad cynharaf
hy: Ամենավաղ ամուսնալուծությունը
ko: 가장 빠른 이혼
ne: प्रारम्भिक सम्बन्ध विच्छेद
sl: Najzgodnejša ločitev

source: Latest divorce
cy: Ysgariad diweddaraf
hy: Վերջին ամուսնալուծությունը
ko: 최근 이혼
ne: पछिल्लो सम्बन्ध विच्छेद
sl: Zadnja ločitev

source: Greatest age at death
cy: Yr oed mwyaf adeg marwolaeth
hy: Մահվան ամենամեծ տարիքը
ko: 사망한 최고연령
ne: मृत्युको सबैभन्दा ठूलो उमेर
sl: Najvišja starost ob smrti

source: Total births
cy: Cyfanswm genedigaethau
hy: Ընդհանուր ծնունդներ
ko: 전체 출생
ne: कुल जन्म
sl: Skupno število rojstev

source: Total deaths
cy: Cyfanswm y marwolaethau
hy: Ընդհանուր մահեր
ko: 전체 사망
ne: कुल मृत्यु
sl: Skupno število smrti

source: Lifespan
cy: Hyd oes
hy: Կյանքի տևողությունը
ko: 생애
ne: आयु
sl: Življenjska doba

source: Youngest male
cy: Gwryw ieuengaf
hy: Ամենաերիտասարդ տղամարդը
ko: 가장 어린 남성
ne: पुरुषमा सबैभन्दा कान्छो
sl: Najmlajši moški

source: Youngest female
cy: Benyw ieuengaf
hy: Ամենաերիտասարդ կին
ko: 가장 어린 여성
ne: महिलामा सबैभन्दा कान्छी
sl: Najmlajša ženska

source: Oldest male
cy: Gwryw hynaf
hy: Ամենատարեց տղամարդը
ko: 가장 나이가 많은 남성
ne: सबैभन्दा वृद्ध पुरुष
sl: Najstarejši moški

source: Oldest female
cy: Benyw hynaf
hy: Ամենատարեց կին
ko: 가장 나이가 많은 여성
ne: सबैभन्दा जेठी महिला
sl: Najstarejša ženska

source: Length of marriage
cy: Hyd y briodas
hy: Ամուսնության տևողությունը
ko: 결혼 기간
ne: विवाहको लम्बाइ
sl: Trajanje zakona

source: Longest marriage
cy: Priodas hiraf
hy: Ամենաերկար ամուսնությունը
ko: 최장 결혼 기간
ne: सबैभन्दा लामो विवाह
sl: Najdaljši zakon

source: Shortest marriage
cy: Priodas fyrraf
hy: Ամենակարճ ամուսնությունը
ko: 가장 짧은 결혼 기간
ne: सबैभन्दा छोटो विवाह
sl: Najkrajši zakon

source: Total given names
cy: Cyfanswm yr enwau cyntaf
hy: Ընդհանուր տրված անուններ
ko: 전체 이름
ne: जम्मा दिइएका नाम
sl: Skupno število imen

source: Oldest living individuals
cy: Unigolion byw hynaf
hy: Ամենահին կենդանի անհատները
ko: 가장 나이가 많은 인물
ne: सबैभन्दा जेठा जीवित व्यक्तिहरू
sl: Najstarejše žive osebe

source: First event
cy: Digwyddiad cyntaf
hy: Առաջին իրադարձություն
ko: 첫번째 이벤트
ne: पहिलो घटना
sl: Prvi dogodek

source: Last event
cy: Digwyddiad diwethaf
hy: Վերջին իրադարձություն
ko: 마지막 이벤트
ne: पछिल्लो घटना
sl: Zadnji dogodek

source: Birth places
cy: Mannau geni
hy: Ծննդավայրեր
ko: 출생 장소
ne: जन्मस्थान
sl: Kraji rojstva

source: Death places
cy: Mannau marwolaeth
hy: Մահվան վայրեր
ko: 사망 장소
ne: मृत्यु स्थानहरू
sl: Kraji smrti

source: Marriage places
cy: Lleoedd priodas
hy: Ամուսնության վայրեր
ko: 결혼 장소
ne: विवाह स्थलहरू
sl: Kraji porok

source: Events in countries
cy: Digwyddiadau mewn gwledydd
hy: Իրադարձություններ երկրներում
ko: 국가별 이벤트
ne: देशहरूमा घटनाहरू
sl: Dogodki v državah

source: Total individuals
cy: Cyfanswm yr unigolion
hy: Ընդհանուր անհատներ
ko: 전체 인물
ne: कुल व्यक्तिहरू
sl: Skupno število uporabnikov

source: Total males
cy: Cyfanswm y gwrywod
hy: Ընդհանուր արուներ
ko: 전체 남성
ne: कुल पुरुष
sl: Skupno število moških

source: Total females
cy: Cyfanswm y benywod
hy: Ընդհանուր իգական սեռի
ko: 전체 가족
ne: कुल महिला
sl: Skupno število žensk

source: Total living
cy: Cyfanswm yn fyw
hy: Ընդհանուր ապրուստ
ko: 전체 생존자
ne: कुल जिवित
sl: Skupno število živih

source: Total dead
cy: Cyfanswm y meirwon
hy: Ընդհանուր մահացած
ko: 전체 사망
ne: कुल मृतक
sl: Skupno število mrtvih

source: Story title
cy: Teitl y stori
hy: Պատմության վերնագիր
ko: 스토리 제목
ne: कथाको शिर्षक
sl: Naslov zgodbe

source: Story
cy: Stori
hy: Պատմություն
ko: 스토리
ne: कथा
sl: Zgodba

source: Month:
cy: Mis:
hy: Ամիս:
ko: 월:
ne: महिना :
sl: Mesec:

source: Day:
cy: Diwrnod:
hy: Օր:
ko: 일:
ne: दिन:
sl: Dan:

source: years
cy: blynedd
hy: տարիներ
ko: 세
ne: वर्षहरू
sl: leta

source: Year:
cy: Blwyddyn:
hy: Տարի:
ko: 년도:
ne: वर्ष:
sl: Leto:

source: Remove individual
cy: Tynnu unigolyn
hy: Հեռացնել անհատը
ko: 인물 제거
ne: व्यक्ति हटाउनुहोस्
sl: Odstrani osebo

source: Show an age cursor
cy: Dangos cyrchwr oed
hy: Ցույց տալ տարիքային կուրսորը
ko: 연령 커서 표시
ne: उमेर कर्सर देखाउनुहोस्
sl: Prikaži kazalec starosti

source: Show only events of living individuals
cy: Dangos dim ond digwyddiadau unigolion byw
hy: Ցույց տալ միայն կենդանի անհատների իրադարձությունները
ko: 살아있는 인물의 이벤트 표시
ne: बाँचिरहेका व्यक्तिहरूको मात्र घटनाक्रम देखाउनुहोस्
sl: Prikaži samo dogodke živih oseb

source: Research tasks are special events, added to individuals in your family tree, which identify the need for further research. You can use them as a reminder to check facts against more reliable sources, to obtain documents or photographs, to resolve conflicting information, etc.
cy: Mae tasgau ymchwil yn ddigwyddiadau arbennig, wedi'u hychwanegu at unigolion yn eich cart achau, sy'n nodi'r angen am ymchwil bellach. Gallwch eu defnyddio fel nodyn atgoffa i wirio ffeithiau yn erbyn ffynonellau mwy dibynadwy, i gael gafael ar ddogfennau neu ffotograffau, i ddatrys gwybodaeth sy'n gwrthdaro, ac ati.
hy: Հետազոտական առաջադրանքները հատուկ իրադարձություններ են, որոնք ավելացվում են ձեր տոհմածառի անհատներին, որոնք բացահայտում են հետագա հետազոտությունների անհրաժեշտությունը: Դուք կարող եք դրանք օգտագործել որպես հիշեցում՝ փաստերը ավելի վստահելի աղբյուրներից ստուգելու, փաստաթղթեր կամ լուսանկարներ ձեռք բերելու, հակասական տեղեկություններ լուծելու համար և այլն:
ko: 연구 작업은 귀하의 가족 나무에있는 개인에게 추가 된 특별 이벤트입니다.추가 연구의 필요성을 확인합니다.그들을 알림으로 사용할 수 있습니다보다 안정적인 소스에 대한 사실을 확인하고 문서를 구하거나상충되는 정보를 해결하기 위해 사진을 삭제합니다.
ne: अनुसन्धान कार्यहरू विशेष घटनाहरू हुन्, तपाईंको पारिवारिक रूखमा व्यक्तिहरूमा थपिएका, जसले थप अनुसन्धानको आवश्यकता पहिचान गर्दछ। तपाईंले तिनीहरूलाई थप विश्वसनीय स्रोतहरू विरुद्ध तथ्यहरू जाँच गर्न, कागजातहरू वा फोटोहरू प्राप्त गर्न, विवादित जानकारीहरू समाधान गर्न, आदिको लागि रिमाइन्डरको रूपमा प्रयोग गर्न सक्नुहुन्छ।
sl: Raziskovalna opravila so posebni dogodki, dodani osebam v vašem družinskem drevesu, ki kažejo na potrebo po nadaljnjih raziskavah. Uporabite jih lahko kot opomnik za preverjanje dejstev z zanesljivejšimi viri, za pridobivanje dokumentov ali fotografij, za reševanje nasprotujočih si informacij itd.

source: To create new research tasks, you must first add “research task” to the list of facts and events in the family tree’s preferences.
cy: I greu tasgau ymchwil newydd, yn gyntaf rhaid i chi ychwanegu “tasg ymchwil” at y rhestr o ffeithiau a digwyddiadau yn newisiadau'r cart achau.
hy: Նոր հետազոտական առաջադրանքներ ստեղծելու համար նախ պետք է «հետազոտական առաջադրանք» ավելացնել տոհմածառի նախապատվությունների փաստերի և իրադարձությունների ցանկին:
ko: 새로운 연구 과제를 만들려면 먼저 가계도 환경 설정의 정보 및 이벤트 목록에 “연구 과제”를 추가해야합니다.
ne: नयाँ अनुसन्धान कार्यहरू सिर्जना गर्न, तपाईंले पहिले पारिवारिक रूखको प्राथमिकताहरूमा तथ्य र घटनाहरूको सूचीमा "अनुसन्धान कार्य" थप्नुपर्छ।
sl: Če želite ustvariti nova raziskovalna opravila, morate v nastavitvah družinskega drevesa najprej dodati “raziskovalno opravilo” na seznam dejstev in dogodkov.

source: Research tasks are stored using the custom GEDCOM tag “_TODO”. Other genealogy applications may not recognize this tag.
cy: Mae tasgau ymchwil yn cael eu storio gan ddefnyddio'r tag GEDCOM cyfaddas “_TODO”. Efallai na fydd rhaglenni achyddiaeth eraill yn cydnadnabod y tag hwn.
hy: Հետազոտական առաջադրանքները պահվում են՝ օգտագործելով «_TODO» հատուկ GEDCOM պիտակը: Այլ ծագումնաբանական հավելվածները կարող են չճանաչել այս պիտակը:
ko: 연구 작업은 사용자 정의 GEDCOM 태그 "_TODO"를 사용하여 저장됩니다.다른 계보 응용 프로그램은이 태그를 인식하지 못할 수 있습니다.
ne: अनुसन्धान कार्यहरू अनुकूलन GEDCOM ट्याग "_TODO" प्रयोग गरेर भण्डारण गरिन्छ। अन्य वंशावली अनुप्रयोगहरूले यो ट्याग पहिचान नगर्न सक्छन्।
sl: Raziskovalna opravila so shranjena z uporabo oznake GEDCOM po meri “_TODO”. Drugi rodoslovni programi te oznake morda ne bodo prepoznali.

source: Show research tasks that are assigned to other users
cy: Dangos tasgau ymchwil sy'n cael eu rhoi i ddefnyddwyr eraill
hy: Ցույց տալ հետազոտական առաջադրանքները, որոնք հանձնարարված են այլ օգտվողների
ko: 다른 사용자에게 할당 된 연구 작업을 표시합니다
ne: अन्य प्रयोगकर्ताहरूलाई तोकिएका अनुसन्धान कार्यहरू देखाउनुहोस्
sl: Prikaži raziskovalna opravila, ki so dodeljena drugim uporabnikom

source: Show research tasks that are not assigned to any user
cy: Dangos tasgau ymchwil sydd heb eu neilltuo i unrhyw ddefnyddiwr
hy: Ցույց տալ հետազոտական առաջադրանքները, որոնք հանձնարարված չեն որևէ օգտվողի
ko: 모든 사용자에게 할당되지 않은 연구 작업 표시
ne: अनुसन्धान कार्यहरू देखाउनुहोस् जुन कुनै पनि प्रयोगकर्तालाई तोकिएको छैन
sl: Prikaži raziskovalna opravila, ki niso dodeljena nobenemu uporabniku

source: Show research tasks that have a date in the future
cy: Dangos tasgau ymchwil sydd â dyddiad yn y dyfodol
hy: Ցույց տալ հետազոտական առաջադրանքները, որոնք ունեն ապագա ամսաթիվ
ko: 미래 날짜가 있는 연구 작업 표시
ne: भविष्यमा मिति भएका अनुसन्धान कार्यहरू देखाउनुहोस्
sl: Prikaži raziskovalna opravila, ki imajo datum v prihodnosti

source: Number of given names
cy: Y nifer o enwau cyntaf
hy: Տրված անունների թիվը
ko: 이름의 수
ne: दिइएको नामहरूको संख्या
sl: Število imen

source: Number of pages
cy: Nifer o dudalennau
hy: Էջերի քանակը
ko: 페이지의 수
ne: पृष्ठहरूको संख्या
sl: Število strani

source: Date sent
cy: Dyddiad anfon
hy: Ուղարկելու ամսաթիվը
ko: 보낸 날짜
ne: पठाइएको मिति
sl: Datum pošiljanja

source: Reply
cy: Ateb
hy: Պատասխանել
ko: 회신
ne: जवाफ दिनुहोस्
sl: Odgovori

source: Are you sure you want to delete this message? It cannot be retrieved later.
cy: Ydych chi'n siŵr eich bod chi am ddileu'r neges hon? Ni fydd modd ei adfer yn nes ymlaen.
hy: Իսկապե՞ս ուզում եք ջնջել այս հաղորդագրությունը: Այն չի կարող ետ կանչվել:
ko: 이 메시지를 삭제하시겠습니까? 나중에 검색할 수 없습니다.
ne: के तपाइँ यो सन्देश मेटाउन निश्चित हुनुहुन्छ ? यसलाई पछि पुन: प्राप्त गर्न सकिँदैन ।
sl: Ste prepričani, da želite izbrisati to sporočilo? Sporočilo bo trajno izbrisano.

source: Delete selected messages
cy: Dileu'r negeseuon hyn
hy: Ջնջել ընտրված հաղորդագրությունները
ko: 선택한 메세지 삭제
ne: छनौट गरिएको खबरहरु मेट्नुहोस
sl: Izbriši izbrana sporočila

source: Add a journal entry
cy: Ychwanegu cofnod dyddlyfr
hy: Ավելացնել ամսագրի գրառում
ko: 저널 기입 추가
ne: एउटा जर्नल प्रविष्टि थप्नुहोस्
sl: Dodaj dnevniški zapis

source: This note has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r nodyn hwn wedi'i ddileu. Dylech adolygu'r dileu ac yna ei %1$s neu ei %2$s.
hy: Այս նշումը ջնջվել է։ Դուք պետք է վերանայեք ջնջումը, այնուհետև %1$s կամ %2$s այն:
ko: 이 노트가 삭제되었습니다. 삭제를 검토 한 다음 %1$s 또는 %2$s 해야합니다.
ne: यो नोट मेटाइएको छ। तपाईंले मेटाउने समीक्षा र त्यसपछि %1$s वा %2$s यसलाई समीक्षा गर्नुपर्छ।
sl: Ta opomba je izbrisana. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This note has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r nodyn hwn wedi'i ddileu. Bydd angen i'r cymedrolwr adolygu'r dileu.
hy: Այս նշումը ջնջվել է։ Ջնջումը պետք է վերանայվի մոդերատորի կողմից:
ko: 이 노트가 삭제되었습니다. 중재자가 삭제를 검토해야합니다.
ne: यो नोट मेटाइएको छ। मेटाउने कार्यलाई मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta opomba je izbrisana. Izbris mora pregledati moderator.

source: This note has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r nodyn hwn wedi'i olygu. Dylech adolygu'r newidiadau ac yna eu %1$s neu eu %2$s nhw.
hy: Այս նշումը խմբագրվել է։ Դուք պետք է վերանայեք փոփոխությունները, այնուհետև %1$s կամ %2$s դրանք:
ko: 이 노트가 편집되었습니다. 변경 사항을 검토 한 다음 %1$s 또는 %2$s 변경해야합니다.
ne: यो नोट सम्पादन गरिएको छ। तपाईंले परिवर्तनहरूको समीक्षा गर्नुपर्छ र त्यसपछि %1$s वा %2$s तिनीहरूलाई।
sl: Ta opomba je urejena. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This note has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r nodyn hwn wedi'i olygu. Mae angen i'r cymedrolwr adolygu'r newidiadau.
hy: Այս նշումը խմբագրվել է։ Փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից:
ko: 이 노트가 편집되었습니다. 중재자가 변경 사항을 검토해야합니다.
ne: यो नोट सम्पादन गरिएको छ। परिवर्तनहरू एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ta opomba je urejena. Spremembe mora pregledati moderator.

source: Accept
cy: Derbyn
hy: Ընդունել
ko: 승인
ne: स्वीकार गर्नुहोस्
sl: Sprejmi

source: Reject
cy: Gwrthod
hy: Մերժել
ko: 거부
ne: अस्वीकार
sl: Zavrni

source: Accept all changes
cy: Derbyn pob newid
hy: Ընդունեք բոլոր փոփոխությունները
ko: 모든 변경사항 승인
ne: सबै परिवर्तनहरू स्वीकार गर्नुहोस्
sl: Sprejmi vse spremembe

source: Are you sure you want to reject all the changes to this family tree?
cy: Ydych chi'n siŵr eich bod chi am wrthod yr holl newidiadau i'r cart achau hwn?
hy: Իսկապե՞ս ուզում եք մերժել այս տոհմածառի բոլոր փոփոխությունները?
ko: 이 가계도에 대한 모든 변경 사항을 거부하시겠습니까?
ne: के तपाईं यो पारिवारिक रूखमा भएका सबै परिवर्तनहरू अस्वीकार गर्न निश्चित हुनुहुन्छ?
sl: Ste prepričani, da želite zavrniti vse spremembe tega družinskega drevesa?

source: Reject all changes
cy: Gwrthod pob newid
hy: Մերժել բոլոր փոփոխությունները
ko: 모든 변경사항 거부
ne: सबै परिवर्तनहरू अस्वीकार गर्नुहोस्
sl: Zavrni vse spremembe

source: Add from clipboard
cy: Ychwanegu o'r clipfwrdd
hy: Ավելացնել սեղմատախտակից
ko: 클립보드에 추가
ne: क्लिपबोर्डबाट थप्नुहोस्
sl: Dodaj iz odložišča

source: Empty the clipboard
hy: Դատարկեք clipboard-ը
ko: 클립보드 비우기
ne: क्लिपबोर्ड खाली गर्नुहोस्

source: This record has been deleted. You should review the deletion and then %1$s or %2$s it.
cy: Mae'r cofnod hwn wedi'i ddileu. Dylech adolygu'r dileu ac yna ei %1$s neu ei %2$s.
hy: Այս գրառումը ջնջվել է։ Դուք պետք է վերանայեք ջնջումը, այնուհետև %1$s կամ %2$s այն:
ko: 이 레코드가 삭제되었습니다. 삭제를 검토 한 다음 %1$s 또는 %2$s 해야합니다.
ne: यो रेकर्ड मेटाइएको छ। तपाईंले मेटाउने समीक्षा र त्यसपछि %1$s वा %2$s यसलाई समीक्षा गर्नुपर्छ।
sl: Ta zapis je izbrisan. Izbris morate pregledati in ga nato %1$s ali %2$s.

source: This record has been deleted. The deletion will need to be reviewed by a moderator.
cy: Mae'r cofnod hwn wedi'i ddileu. Bydd angen i'r cymedrolwr adolygu'r dileu.
hy: Այս գրառումը ջնջվել է։ Ջնջումը պետք է վերանայվի մոդերատորի կողմից:
ko: 이 레코드가 삭제되었습니다. 중재자가 삭제를 검토해야합니다.
ne: यो रेकर्ड मेटाइएको छ। मेटाउने कार्यलाई मध्यस्थकर्ताद्वारा समीक्षा गर्न आवश्यक हुनेछ।
sl: Ta zapis je izbrisan. Izbris mora pregledati moderator.

source: This record has been edited. You should review the changes and then %1$s or %2$s them.
cy: Mae'r cofnod hwn wedi'i olygu. Dylech adolygu'r newidiadau ac yna eu %1$s neu eu %2$s nhw.
hy: Այս գրառումը խմբագրվել է։ Դուք պետք է վերանայեք փոփոխությունները, այնուհետև %1$s կամ %2$s դրանք:
ko: 이 레코드는 편집되었습니다. 변경 사항을 검토 한 다음 %1$s 또는 %2$s 변경해야합니다.
ne: यो रेकर्ड सम्पादन गरिएको छ। तपाईंले परिवर्तनहरूको समीक्षा गर्नुपर्छ र त्यसपछि %1$s वा %2$s तिनीहरूलाई।
sl: Ta zapis je urejen. Spremembe morate pregledati in jih nato %1$s ali %2$s.

source: This record has been edited. The changes need to be reviewed by a moderator.
cy: Mae'r cofnod hwn wedi'i olygu. Mae angen i'r cymedrolwr adolygu'r newidiadau.
hy: Այս գրառումը խմբագրվել է։ Փոփոխությունները պետք է վերանայվեն մոդերատորի կողմից:
ko: 이 레코드는 편집되었습니다. 중재자가 변경 사항을 검토해야합니다.
ne: यो रेकर्ड सम्पादन गरिएको छ। परिवर्तनहरू एक मध्यस्थ द्वारा समीक्षा गर्न आवश्यक छ।
sl: Ta zapis je urejen. Spremembe mora pregledati moderator.

source: <p>Notice: By completing and submitting this form, you agree:</p><ul><li>to protect the privacy of living individuals listed on our site;</li><li>and in the text box below, to explain to whom you are related, or to provide us with information on someone who should be listed on our website.</li></ul>
hy: <p>Ծանուցում․ լրացնելով և ներկայացնելով այս ձևը՝ դուք համաձայնում եք՝</p><ul><li>պաշտպանել մեր կայքում թվարկված կենդանի անհատների գաղտնիությունը,</li><li>և ստորև բերված տեքստային վանդակում բացատրել, թե ում հետ եք դուք ազգակցական, կամ տրամադրել մեզ տեղեկություններ այն անձի մասին, ով պետք է նշված լինի մեր կայքում։</li></ul>
ko: <p>알림: 이 양식을 작성하여 제출함으로써 귀하는 다음 사항에 동의하게 됩니다.</p><ul><li>당사 사이트 및 아래 텍스트 상자에 나열된 살아있는 개인의 개인정보 보호에 동의합니다;</li><li>귀하가 누구와 관련이 있는지 설명하거나 당사 웹사이트에 등재되어야 하는 사람에 대한 정보를 제공합니다.</li></ul>
ne: <p>सूचना: यो फारम भरेर र पेश गरेर, तपाईं सहमत हुनुहुन्छ:</p><ul><li>हाम्रो साइटमा सूचीबद्ध जीवित व्यक्तिहरूको गोपनीयताको रक्षा गर्न;</li><li>र तलको पाठ बाकसमा , तपाईं कोसँग सम्बन्धित हुनुहुन्छ भनेर व्याख्या गर्न, वा हाम्रो वेबसाइटमा सूचीबद्ध हुनु पर्ने कसैको बारेमा हामीलाई जानकारी प्रदान गर्न।</li></ul>

source: Explain why you are requesting an account.
cy: Esboniwch pam rydych chi'n gofyn am gyfrif.
hy: Բացատրեք, թե ինչու եք հաշիվ պահանջում:
ko: 계정을 요청하는 이유를 설명하세요.
ne: तपाइँ किन खाता अनुरोध गर्दै हुनुहुन्छ भनेर व्याख्या गर्नुहोस्।
sl: Pojasnite, zakaj želite ustvariti račun.

source: Use this field to tell the site administrator why you are requesting an account and how you are related to the genealogy displayed on this site. You can also use this to enter any other comments you may have for the site administrator.
cy: Defnyddiwch y maes hwn i ddweud wrth weinyddwr y wefan pam eich bod yn gofyn am gyfrif a sut rydych chi'n perthyn i'r achau sy'n cael ei dangos ar y wefan hon. Gallwch hefyd ddefnyddio hwn i nodi unrhyw sylwadau eraill sydd gennych ar gyfer gweinyddwr y wefan.
hy: Օգտագործեք այս դաշտը՝ կայքի ադմինիստրատորին հայտնելու համար, թե ինչու եք հաշիվ պահանջում և ինչպես եք կապված այս կայքում ցուցադրված ծագումնաբանության հետ: Դուք կարող եք նաև օգտագործել սա՝ կայքի ադմինիստրատորի համար ցանկացած այլ մեկնաբանություն մուտքագրելու համար:
ko: 이 필드를 사용하여 사이트 관리자에게 계정을 요청하는 이유와이 사이트에 표시된 계보와 관련이있는 방법을 알려줍니다. 이를 사용하여 사이트 관리자에 대해 다른 의견을 입력 할 수도 있습니다.
ne: तपाइँ किन खाता अनुरोध गरिरहनुभएको छ र तपाइँ यस साइटमा प्रदर्शित वंशावलीसँग कसरी सम्बन्धित हुनुहुन्छ भनेर साइट प्रशासकलाई बताउन यो क्षेत्र प्रयोग गर्नुहोस्। तपाईं यसलाई साइट प्रशासकको लागि हुन सक्ने कुनै पनि अन्य टिप्पणीहरू प्रविष्ट गर्न प्रयोग गर्न सक्नुहुन्छ।
sl: Uporabite to polje ter skrbniku spletišča pojasnite, zakaj zahtevate uporabniški račun in kako ste povezani z rodoslovjem, prikazanim na tem spletišču. Polje lahko uporabite tudi za vnos drugih komentarjev, ki jih morda imate za skrbnika spletišča.

source: Hello %s…<br>Thank you for your registration.
cy: Helo %s...<br> Diolch am eich cofrestriad.
hy: Բարև %s…<br>Շնորհակալություն գրանցման համար:
ko: 안녕하세요 %s...<br>등록해주셔서 감사합니다.
ne: नमस्कार %s...<br>तपाईँको दर्ताको लागि धन्यवाद।
sl: Živjo %s …<br>Zahvaljujemo se ti za registracijo.

source: We will now send a confirmation email to the address <b>%s</b>. You must verify your account request by following instructions in the confirmation email. If you do not confirm your account request within seven days, your application will be rejected automatically. You will have to apply again.<br><br>After you have followed the instructions in the confirmation email, the administrator still has to approve your request before your account can be used.<br><br>To sign in to this website, you will need to know your username and password.
cy: Byddwn nawr yn anfon e-bost cadarnhau i'r cyfeiriad <b>%s</b> . Rhaid i chi wirio'ch cais am gyfrif trwy ddilyn cyfarwyddiadau yn yr e-bost cadarnhau. Os na fyddwch yn cadarnhau eich cais am gyfrif o fewn saith diwrnod, bydd eich cais yn cael ei wrthod yn awtomatig. Bydd yn rhaid i chi wneud cais eto.<br><br> Ar ôl i chi ddilyn y cyfarwyddiadau yn yr e-bost cadarnhau, mae'n dal yn rhaid i'r gweinyddwr gymeradwyo'ch cais cyn bod modd i chi ddefnyddio'ch cyfrif.<br><br> I fewngofnodi i'r wefan hon, bydd angen i chi wybod eich enw defnyddiwr a'ch cyfrinair.
hy: Այժմ մենք հաստատման նամակ կուղարկենք <b>%s</b> հասցեին: Դուք պետք է հաստատեք ձեր հաշվի հարցումը՝ հետևելով հաստատման էլ. Եթե յոթ օրվա ընթացքում չհաստատեք ձեր հաշվի հարցումը, ձեր դիմումն ինքնաբերաբար կմերժվի: Դուք պետք է նորից դիմեք:<br><br>Հաստատման նամակում տրված հրահանգներին հետևելուց հետո ադմինիստրատորը դեռ պետք է հաստատի ձեր հարցումը, նախքան ձեր հաշիվն օգտագործելը:<br><br>Այս կայք մուտք գործելու համար դուք պետք է իմանաք ձեր օգտանունը և գաղտնաբառը:
ko: 이제 <b>%s</b> 주소로 확인 이메일을 보내드립니다. 확인 이메일의 지침에 따라 계정 요청을 확인해야합니다. 7일 이내에 계정 요청을 확인하지 않으면 신청서가 자동으로 거부됩니다. 다시 신청해야합니다. <br><br> 확인 이메일의 지침을 따른 후에도 관리자는 계정을 사용하기 전에 요청을 승인해야합니다. <br><br> 로그인하려면 웹 사이트에서 사용자 이름과 비밀번호를 알아야합니다.
ne: हामी अब <b>%s</b> ठेगानामा पुष्टिकरण इमेल पठाउनेछौं। तपाईंले पुष्टिकरण इमेलमा निर्देशनहरू पालना गरेर आफ्नो खाता अनुरोध प्रमाणित गर्नुपर्छ। यदि तपाईंले सात दिन भित्र आफ्नो खाता अनुरोध पुष्टि गर्नुभएन भने, तपाईंको आवेदन स्वतः अस्वीकृत हुनेछ। तपाईंले फेरि आवेदन दिनु पर्नेछ।<br><br>तपाईंले पुष्टिकरण इमेलमा दिइएका निर्देशनहरू पालना गरिसकेपछि, तपाईंको खाता प्रयोग गर्न अघि प्रशासकले अझै पनि तपाईंको अनुरोधलाई अनुमोदन गर्नुपर्छ।<br><br>यसमा साइन इन गर्न वेबसाइट, तपाईंले आफ्नो प्रयोगकर्ता नाम र पासवर्ड थाहा आवश्यक हुनेछ।
sl: Na elektronski naslov <b>%s</b> vam bomo poslali potrdilo. Zahtevek za uporabniški račun morate potrditi po navodilih, ki jih boste dobili v elektronski pošti. Če uporabniškega računa ne potrdite v tednu dni, bo vaša registracija samodejno zavrnjena. Morali se boste ponovno registrirati.<br><br>Po izpolnitvi navodil v elektronskem sporočilu bo skrbnik moral vaš zahtevek najprej odobriti, šele potem boste lahko uporabljali račun.<br><br>Za prijavo na to stran sta potrebna uporabniško ime in geslo.

source: Add more fields
cy: Ychwanegu rhagor o feysydd
hy: Ավելացնել ավելի շատ դաշտեր
ko: 더 많은 필드 추가
ne: अझै फिल्ड थप्नुहोस्
sl: Dodaj več polj

source: Father
cy: Tad
hy: Հայրիկ
ko: 아버지
ne: बुवा
sl: Oče

source: Mother
cy: Mam
hy: Մայրիկ
ko: 어머니
ne: आमा
sl: Mati

source: Search for
cy: Chwilio am
hy: Որոնել
ko: 검색
ne: यसको खोजी गर्नुहोस्
sl: Poišči
