Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Field value
hy: Դաշտի արժեքը
ne: फिल्ड भ्यालु

source: Bibliography
cy: Llyfryddiaeth
hy: Մատենագիտություն
ko: 관계 서적
ne: सन्दर्भसूची
sl: Literatura

source: Living
cy: Byw
hy: Ապրելով
ko: 살아있는
ne: बस्ने
sl: Živi

source: about %s
cy: tua %s
hy: մոտ %s
ko: 약 %s
ne: %s बारेमा
sl: okoli %s

source: calculated %s
cy: cyfrifwyd %s
hy: հաշվարկված %s
ko: 계산 된 %s
ne: %s गणना गरियो
sl: izračunano %s

source: estimated %s
cy: amcangyfrifwyd %s
hy: գնահատված %s
ko: 예상 %s
ne: अनुमानित %s
sl: ocenjeno %s

source: interpreted %s (%s)
cy: dehonglwyd %s (%s)
hy: մեկնաբանված %s (%s)
ko: 설명 %s(%s)
sl: interpretirano kot %s (%s)

source: before %s
cy: cyn %s
hy: %s - ից առաջ
ko: %s 이전
ne: अगाडि %s
sl: pred %s

source: after %s
cy: ar ôl %s
hy: %s - ից հետո
ko: %s 이후
ne: %s पछि
sl: po %s

source: from %s
cy: o %s
hy: %s - ից
ko: %s 에서
ne: %s बाट
sl: od %s

source: to %s
cy: hyd %s
hy: դեպի %s
ko: %s까지
ne: %s लाई
sl: do %s

source: between %s and %s
cy: rhwng %s a %s
hy: %s - ի և %s -ի միջև
ko: %s와 %s 사이
ne: %s र %s को बीचमा
sl: med %s in %s

source: from %s to %s
cy: o %s hyd %s
hy: %s - ից մինչև %s
ko: %s에서 %s까지
ne: %s देखि %s सम्म
sl: od %s do %s

source: Invalid date
cy: Dyddiad annilys
hy: Անվավեր ամսաթիվ
ko: 잘못된 날짜
ne: अमान्य मिति
sl: Neveljaven datum

source: Monday
cy: Dydd Llun
hy: Երկուշաբթի
ne: सोमबार
sl: ponedeljek

source: Tuesday
cy: Dydd Mawrth
hy: Երեքշաբթի
ne: मंगलबार
sl: torek

source: Wednesday
cy: Dydd Mercher
hy: չորեքշաբթի
ne: बुधबार
sl: sreda

source: Thursday
cy: Dydd Iau
hy: հինգշաբթի
ne: बिहीबार
sl: četrtek

source: Friday
cy: Dydd Gwener
hy: Ուրբաթ
ne: शुक्रबार
sl: petek

source: Saturday
cy: Dydd Sadwrn
hy: շաբաթ օրը
ne: शनिबार
sl: sobota

source: Sunday
cy: Dydd Sul
hy: Կիրակի
ne: आइतबार
sl: nedelja

source: Mon
cy: Llu
hy: Երկ
ne: सोम
sl: pon

source: Tue
cy: Maw
hy: Երք
ne: मंगल
sl: tor

source: Wed
cy: Mer
hy: Չրք
ne: बुध
sl: sre

source: Thu
cy: Iau
hy: Հինգշ
ne: बिही
sl: čet

source: Fri
cy: Gwe
hy: Ուրբ
ne: शुक्र
sl: pet

source: Sat
cy: Sad
hy: Շաբաթ
ne: शनि
sl: sob

source: Sun
cy: Sul
hy: Արև
ne: आइत
sl: ned

# NOMINATIVE
source: January
cy: Ionawr
hy: հունվար
ne: जनवरी
sl: januar

# NOMINATIVE
source: February
cy: Chwefror
hy: փետրվար
ne: फेब्रुवरी
sl: februar

# NOMINATIVE
source: March
cy: Mawrth
hy: մարտ
ne: मार्च
sl: marec

# NOMINATIVE
source: April
cy: Ebrill
hy: ապրիլ
ne: अप्रिल

# NOMINATIVE
source: May
cy: Mai
hy: մայիս
ne: मई
sl: maj

# NOMINATIVE
source: June
cy: Mehefin
hy: հունիս
ne: जुन
sl: junij

# NOMINATIVE
source: July
cy: Gorffennaf
hy: հուլիս
ne: जुलाई
sl: julij

# NOMINATIVE
source: August
cy: Awst
hy: օգոստոս
ne: अगस्ट
sl: avgust

# NOMINATIVE
source: September
cy: Medi
hy: սեպտեմբեր
ne: सेप्टेम्बर

# NOMINATIVE
source: October
cy: Hydref
hy: հոկտեմբեր
ne: अक्टोबर
sl: oktober

# NOMINATIVE
source: November
cy: Tachwedd
hy: նոյեմբեր
ne: नोभेम्बर

# NOMINATIVE
source: December
cy: Rhagfyr
hy: դեկտեմբեր
ne: डिसेम्बर

# GENITIVE
source: January
cy: Ionawr
hy: հունվարին
ne: जनवरी
sl: januarja

# GENITIVE
source: February
cy: Chwefror
hy: փետրվարին
ne: फेब्रुवरी
sl: februarja

# GENITIVE
source: March
cy: Mawrth
hy: մարտին
ne: मार्च
sl: marca

# GENITIVE
source: April
cy: Ebrill
hy: ապրիլին
ne: अप्रिल
sl: aprila

# GENITIVE
source: May
cy: Mai
hy: մայիսին
ne: मई
sl: maja

# GENITIVE
source: June
cy: Mehefin
hy: հունիսին
ne: जुन
sl: junija

# GENITIVE
source: July
cy: Gorffennaf
hy: հուլիսին
ne: जुलाई
sl: julija

# GENITIVE
source: August
cy: Awst
hy: օգոստոսին
ne: अगस्ट
sl: avgusta

# GENITIVE
source: September
cy: Medi
hy: սեպտեմբերին
ne: सेप्टेम्बर
sl: septembra

# GENITIVE
source: October
cy: Hydref
hy: հոկտեմբերին
ne: अक्टोबर
sl: oktobra

# GENITIVE
source: November
cy: Tachwedd
hy: նոյեմբերին
ne: नोभेम्बर
sl: novembra

# GENITIVE
source: December
cy: Rhagfyr
hy: դեկտեմբերին
ne: डिसेम्बर
sl: decembra

# LOCATIVE
source: January
cy: Ionawr
hy: հունվարին
ne: जनवरी
sl: januarju

# LOCATIVE
source: February
cy: Chwefror
hy: փետրվարին
ne: फेब्रुवरी
sl: februarju

# LOCATIVE
source: March
cy: Mawrth
hy: մարտին
ne: मार्च
sl: marcu

# LOCATIVE
source: April
cy: Ebrill
hy: ապրիլին
ne: अप्रिल
sl: aprilu

# LOCATIVE
source: May
cy: Mai
hy: մայիսին
ne: मई
sl: maju

# LOCATIVE
source: June
cy: Mehefin
hy: հունիսին
ne: जुन
sl: juniju

# LOCATIVE
source: July
cy: Gorffennaf
hy: հուլիսին
ne: जुलाई
sl: juliju

# LOCATIVE
source: August
cy: Awst
hy: օգոստոսին
ne: अगस्ट
sl: avgustu

# LOCATIVE
source: September
cy: Medi
hy: սեպտեմբերին
ne: सेप्टेम्बर
sl: septembru

# LOCATIVE
source: October
cy: Hydref
hy: հոկտեմբերին
ne: अक्टोबर
sl: oktobru

# LOCATIVE
source: November
cy: Tachwedd
hy: նոյեմբերին
ne: नोभेम्बर
sl: novembru

# LOCATIVE
source: December
cy: Rhagfyr
hy: դեկտեմբերին
ne: डिसेम्बर
sl: decembru

# INSTRUMENTAL
source: January
cy: Ionawr
hy: հունվար
ne: जनवरी
sl: januarjem

# INSTRUMENTAL
source: February
cy: Chwefror
hy: փետրվար
ne: फेब्रुवरी
sl: februarjem

# INSTRUMENTAL
source: March
cy: Mawrth
hy: մարտ
ne: मार्च
sl: marcem

# INSTRUMENTAL
source: April
cy: Ebrill
hy: ապրիլ
ne: अप्रिल
sl: aprilom

# INSTRUMENTAL
source: May
cy: Mai
hy: մայիս
ne: मई
sl: majem

# INSTRUMENTAL
source: June
cy: Mehefin
hy: հունիս
ne: जुन
sl: junijem

# INSTRUMENTAL
source: July
cy: Gorffennaf
hy: հուլիս
ne: जुलाई
sl: julijem

# INSTRUMENTAL
source: August
cy: Awst
hy: օգոստոս
ne: अगस्ट
sl: avgustom

# INSTRUMENTAL
source: September
cy: Medi
hy: սեպտեմբեր
ne: सेप्टेम्बर
sl: septembrom

# INSTRUMENTAL
source: October
cy: Hydref
hy: հոկտեմբեր
ne: अक्टोबर
sl: oktobrom

# INSTRUMENTAL
source: November
cy: Tachwedd
hy: նոյեմբեր
ne: नोभेम्बर
sl: novembrom

# INSTRUMENTAL
source: December
cy: Rhagfyr
hy: դեկտեմբեր
ne: डिसेम्बर
sl: decembrom

# Abbreviation for January
source: Jan
cy: Ion
hy: հուն
ne: जनवरी

# Abbreviation for February
source: Feb
cy: Chw
hy: փետր
ne: फेब्रुवरी

# Abbreviation for March
source: Mar
cy: Maw
hy: Մարտ
ne: मार्च

# Abbreviation for April
source: Apr
cy: Ebr
hy: ապր
ne: अप्रिल

# Abbreviation for May
source: May
cy: Mai
hy: մայիս
ne: मई
sl: maj

# Abbreviation for June
source: Jun
cy: Meh
hy: հուն
ne: जुन

# Abbreviation for July
source: Jul
cy: Gor
hy: հուլ
ne: जुलाई

# Abbreviation for August
source: Aug
cy: Aws
hy: օգ
ne: अगस्ट
sl: avg

# Abbreviation for September
source: Sep
cy: Med
hy: սեպտ
ne: सेप्टेम्बर

# Abbreviation for October
source: Oct
cy: Hyd
hy: հոկտ
ne: अक्टोबर
sl: okt

# Abbreviation for November
source: Nov
cy: Tac
hy: նոյ
ne: नोभेम्बर

# Abbreviation for December
source: Dec
cy: Rha
hy: դեկտ
ne: डिसेम्बर

# NOMINATIVE
source: Vendemiaire
hy: Վանդեմիաիր
ne: भेन्डेमाइर

# NOMINATIVE
source: Brumaire
hy: Բրումեյր
ne: ब्रुमेयर

# NOMINATIVE
source: Frimaire
hy: Ֆրիմեր
ne: फ्रिमेयर

# NOMINATIVE
source: Nivose
hy: Նիվոզե
ne: निभोस

# NOMINATIVE
source: Pluviose
hy: Պլյուվիոզ
ne: प्लुभिओस्
sl: pluviôse

# NOMINATIVE
source: Ventose
hy: Վենտոզե
ne: भेन्टोज

# NOMINATIVE
source: Germinal
hy: Ջերմինալ
ne: कीटाणुजन्य

# NOMINATIVE
source: Floreal
hy: Ֆլորեալ
ne: फ्लोरियल
sl: floréal

# NOMINATIVE
source: Prairial
hy: Պրայրիալ
ne: प्रेयरियल

# NOMINATIVE
source: Messidor
cy: Negesydd
hy: Մեսիդոր
ne: मेसीडोर

# NOMINATIVE
source: Thermidor
hy: Թերմիդոր
ne: थर्मिडर

# NOMINATIVE
source: Fructidor
hy: Ֆրուկտիդոր
ne: फ्रुक्टिडोर

# NOMINATIVE
source: jours complementaires
hy: լրացնող օրեր
sl: dodatni dnevi

# GENITIVE
source: Vendemiaire
hy: Վանդեմիաիր
ne: भेन्डेमाइर

# GENITIVE
source: Brumaire
hy: Բրումեյր
ne: ब्रुमेयर

# GENITIVE
source: Frimaire
hy: Ֆրիմեր
ne: फ्रिमेयर

# GENITIVE
source: Nivose
hy: Նիվոզե
ne: निभोस

# GENITIVE
source: Pluviose
hy: Պլյուվիոզ
ne: प्लुभिओस्
sl: pluviôse

# GENITIVE
source: Ventose
hy: Վենտոզե
ne: भेन्टोज

# GENITIVE
source: Germinal
hy: Ջերմինալ
ne: कीटाणुजन्य

# GENITIVE
source: Floreal
hy: Ֆլորեալ
ne: Floreal (फूल)
sl: floréal

# GENITIVE
source: Prairial
hy: Մարգագետին
ne: प्रेयरियल

# GENITIVE
source: Messidor
hy: Մեսիդոր
ne: मेसीडोर

# GENITIVE
source: Thermidor
hy: Թերմիդոր
ne: थर्मिडर

# GENITIVE
source: Fructidor
hy: Ֆրուկտիդոր
ne: फ्रुक्टिडोर

# GENITIVE
source: jours complementaires
cy: jours compleaires
hy: լրացուցիչ օրեր
sl: dodatni dnevi

# LOCATIVE
source: Vendemiaire
hy: Վանդեմիաիր
ne: भेन्डेमाइर

# LOCATIVE
source: Brumaire
hy: Բրումեյր
ne: ब्रुमेयर

# LOCATIVE
source: Frimaire
hy: Ֆրիմեր
ne: फ्रिमेयर

# LOCATIVE
source: Nivose
hy: Նիվոզե
ne: निभोस

# LOCATIVE
source: Pluviose
hy: Պլյուվիոզ
ne: प्लुभिओस्
sl: pluviôse

# LOCATIVE
source: Ventose
hy: Վենտոզե
ne: भेन्टोज

# LOCATIVE
source: Germinal
hy: Ջերմինալ
ne: कीटाणुजन्य

# LOCATIVE
source: Floreal
hy: Ֆլորեալ
ne: फ्लोरियल
sl: floréal

# LOCATIVE
source: Prairial
hy: Մարգագետին
ne: प्रेयरियल

# LOCATIVE
source: Messidor
cy: Negesydd
hy: Մեսիդոր
ne: मेसीडोर

# LOCATIVE
source: Thermidor
hy: Թերմիդոր
ne: थर्मिडर

# LOCATIVE
source: Fructidor
hy: Ֆրուկտիդոր
ne: फ्रुक्टिडोर

# LOCATIVE
source: jours complementaires
cy: jours compleaires
hy: լրացուցիչ օրեր
sl: dodatni dnevi

# INSTRUMENTAL
source: Vendemiaire
hy: Վանդեմիաիր
ne: भेन्डेमाइर

# INSTRUMENTAL
source: Brumaire
hy: Բրումեյր
ne: ब्रुमेयर

# INSTRUMENTAL
source: Frimaire
hy: Ֆրիմեր
ne: फ्रिमेयर

# INSTRUMENTAL
source: Nivose
hy: Նիվոզե
ne: निभोस

# INSTRUMENTAL
source: Pluviose
hy: Պլյուվիոզ
ne: प्लुभिओस्
sl: pluviôse

# INSTRUMENTAL
source: Ventose
hy: Վենտոզե
ne: भेन्टोज

# INSTRUMENTAL
source: Germinal
hy: Ջերմինալ
ne: कीटाणुजन्य

# INSTRUMENTAL
source: Floreal
hy: Ֆլորեալ
ne: फ्लोरियल
sl: floréal

# INSTRUMENTAL
source: Prairial
hy: Մարգագետին
ne: प्रेयरियल

# INSTRUMENTAL
source: Messidor
hy: Մեսիդոր
ne: मेसीडोर

# INSTRUMENTAL
source: Thermidor
hy: Թերմիդոր
ne: थर्मिडर

# INSTRUMENTAL
source: Fructidor
hy: Ֆրուկտիդոր
ne: फ्रुक्टिडोर

# INSTRUMENTAL
source: jours complementaires
cy: jours compleaires
hy: լրացուցիչ օրեր
sl: dodatni dnevi

# NOMINATIVE
source: Farvardin
hy: Ֆարվարդին
ne: फार्भार्डिन

# NOMINATIVE
source: Ordibehesht
hy: Օրդիբեհեշթ
ne: ओर्डिबेहेश
sl: ordibehešt

# NOMINATIVE
source: Khordad
hy: Խորդադ
ne: खोर्डाद
sl: kordad

# NOMINATIVE
source: Tir
hy: Տիր
ne: टिर

# NOMINATIVE
source: Mordad
hy: Մորդադ
ne: मोर्डाद

# NOMINATIVE
source: Shahrivar
hy: Շահրիվար
ne: शाह्रिभर
sl: šarivar

# NOMINATIVE
source: Mehr
hy: Մեհր
ne: मेहर
sl: mer

# NOMINATIVE
source: Aban
hy: Աբան
ne: अबान

# NOMINATIVE
source: Azar
hy: Ազար
ne: अजार

# NOMINATIVE
source: Dey
hy: Դեյ
ne: डेइ
sl: dej

# NOMINATIVE
source: Bahman
hy: Բահման
ne: बाहमन

# NOMINATIVE
source: Esfand
hy: Էսֆանդ
ne: इस्फान्ड

# NOMINATIVE
source: Tishrei
hy: Տիշրեյ
ne: तिश्री
sl: tišri

# NOMINATIVE
source: Heshvan
hy: Հեշվան
ne: हेस्भान
sl: ešvan

# NOMINATIVE
source: Kislev
hy: Կիսլև
ne: किस्लेभ

# NOMINATIVE
source: Tevet
hy: Տեւետ
ne: टेभेट

# NOMINATIVE
source: Shevat
hy: Շևաթ
ne: शेवत
sl: šebat

# NOMINATIVE
source: Adar I
hy: Ադար Ի
ne: अडार I
sl: adar

# NOMINATIVE
source: Adar
hy: Ադար
ne: अडार

# NOMINATIVE
source: Nissan
hy: Նիսաn
ne: निसान
sl: nisan

# NOMINATIVE
source: Iyar
hy: Իյար
ne: इयार
sl: ijar

# NOMINATIVE
source: Sivan
hy: Սիվան
ne: सिभान

# NOMINATIVE
source: Tamuz
hy: Թամուզ
ne: टामुज

# NOMINATIVE
source: Av
hy: Ավ
ne: एभ

# NOMINATIVE
source: Elul
hy: Էլուլ
ne: एलउल

# NOMINATIVE
source: Adar II
hy: Ադար II
ne: अडार II
sl: beadar

source: %s&nbsp;BCE
hy: %s&nbsp;մ.թ.ա
sl: %s&nbsp;pr. K.

source: This event occurred, but the details are unknown.
cy: Digwyddodd y digwyddiad hwn, ond nid yw'r manylion yn hysbys.
hy: Այս դեպքը տեղի է ունեցել, սակայն մանրամասները հայտնի չեն։
ko: 이 이벤트는 발생했지만, 자세한 내용은 알 수 없습니다.
ne: यो घटना घट्यो, तर विवरण अज्ञात छ।
sl: Dogodek se je zgodil, vendar podrobnosti niso znane.

source: yes
cy: iawn
hy: այո
ko: 예
ne: हो
sl: Da

source: Not recorded
hy: Չի գրանցված
ne: रेकर्ड नगरिएका

source: Adopted by both parents
cy: Mabwysiadwyd gan y ddau riant
hy: Ընդունված է երկու ծնողների կողմից
ko: 부모에 의해 입양
ne: दुबै आमाबाबुले ग्रहण गरेको
sl: Posvojila oba starša

source: child
cy: plentyn
hy: երեխա
ko: 자녀
ne: बच्चा
sl: otrok

source: infant
hy: նորածին
ko: 유아

source: stillborn
hy: մահացած ծնված
ko: 사산

source: %s week
cy: %s wythnosau
hy: %s շաբաթ
ko: %s 주
ne: %s हप्ता
sl: %s teden

source: unreliable evidence
cy: tystiolaeth annibynadwy
hy: անհուսալի ապացույցներ
ko: 신뢰할 수 없는 증거
ne: अविश्वसनीय प्रमाण
sl: nezanesljivi dokazi

source: questionable evidence
cy: tystiolaeth amheus
hy: կասկածելի ապացույցներ
ko: 의심스러운 증거
ne: शंकास्पद प्रमाण
sl: vprašljivi dokazi

source: secondary evidence
cy: tystiolaeth eilaidd
hy: երկրորդական ապացույցներ
ko: 2번째 증거
sl: posredni dokazi

source: primary evidence
cy: tystiolaeth sylfaenol
hy: առաջնային ապացույցներ
ko: 1차 증거
ne: प्राथमिक प्रमाण
sl: primarni dokazi

source: challenged
cy: heriwyd
hy: մարտահրավեր նետեց
ko: 장애가 있는
ne: चुनौती दिए
sl: izzvano

source: disproven
cy: gwrthbrofwyd
hy: հերքված
ko: 입증되지않은
ne: अस्वीकृत
sl: ovrženo

source: proven
cy: profwyd
hy: ապացուցված
ko: 입증된
ne: प्रमाणित
sl: dokazano

source: household
cy: aelwyd
hy: կենցաղային
ko: 일가
sl: gospodinjstvo

source: citizen
cy: dinesydd
hy: քաղաքացի
ko: 시민
ne: नागरिक
sl: državljan

source: online
hy: առցանց

source: local
hy: տեղական

# NOUN
source: copy
hy: պատճենել
ne: प्रतिलिपि गर्नुहोस्

source: photocopy
hy: լուսապատճեն

# NOUN
source: extract
hy: քաղվածք

source: before
hy: առաջ
ne: पहिले

source: after
hy: հետո
ne: पछि

source: political
cy: gwleidyddol
hy: քաղաքական
ko: 행정적인
ne: राजनीतिक
sl: politično

source: religious
cy: crefyddol
hy: կրոնական
ko: 종교적인
ne: धार्मिक
sl: versko

source: geographic
cy: daearyddol
hy: աշխարհագրական
ko: 지리정보
ne: भौगोलिक
sl: geografsko

source: cultural
cy: diwylliannol
hy: մշակութային
ne: सांस्कृतिक
sl: kulturno

source: Died as a child: exempt
cy: Bu farw fel plentyn: wedi'i eithrio
hy: Մահացել է մանուկ հասակում՝ ազատված
ko: 어린 시절 사망: 면제
ne: बच्चाको रूपमा मृत्यु भयो: exempt
sl: Umrl/a kot otrok: izvzeto

source: Completed; date unknown
cy: Wedi'i gwblhau; dyddiad anhysbys
hy: Ավարտված; ամսաթիվը անհայտ է
ko: 완료;날짜를 알 수 없습니다
ne: पूरा भयो; मिति अज्ञात
sl: Zaključeno; datum ni znan

source: Excluded from this submission
cy: Wedi'i eithrio o'r cyflwyniad hwn
hy: Բացառված է այս ներկայացումից
ko: 이 제출에서 제외됨
ne: यो सबमिशनबाट बहिष्कृत
sl: Izključeno iz te pošiljke

source: Completed before 1970; date not available
cy: Cwblhawyd cyn 1970; dyddiad ddim ar gael
hy: Ավարտվել է մինչև 1970 թվականը; ամսաթիվը հասանելի չէ
ko: 1970년 이전에 완료; 날짜를 사용할 수 없습니다
ne: 1970 अघि पूरा भएको; मिति उपलब्ध छैन
sl: Zaključeno pred 1970; datum ni na voljo

source: Stillborn: exempt
cy: Marw-anedig: eithriedig
hy: Մահացած ծնված՝ ազատված
ko: 사산 : 면제
ne: Stillborn: छुट
sl: Mrtvorojen: izvzeto

source: Submitted but not yet cleared
cy: Wedi'i gyflwyno ond heb ei glirio eto
hy: Ներկայացված է, բայց դեռ չմաքրված
ko: 제출했지만 아직 지워지지 않았습니다
ne: पेश गरियो तर अझै स्पष्ट छैन
sl: Poslano, vendar še ni odobreno

source: Uncleared: insufficient data
cy: Heb ei glirio: data annigonol
hy: Չպարզված. անբավարար տվյալներ
ko: 불분명 : 데이터 부족
ne: अस्पष्ट: अपर्याप्त डाटा
sl: Nepojasnjeno: ni dovolj podatkov

source: Born in the covenant
cy: Ganed yn y cyfamod
hy: Ծնվել է ուխտի մեջ
ne: करारमा जन्मियो
sl: Rojen v zavezi

source: Sealing canceled (divorce)
cy: Selio wedi'i ddiddymu (ysgariad)
hy: Կնքումը չեղյալ է հայտարարվել (ամուսնալուծություն)
ko: Sealing
ne: सिलिङ रद्द (सम्बन्धविच्छेद)
sl: Pečatenje preklicano (ločitev)

source: Do not seal: unauthorized
cy: Peidio â selio: heb awdurdod
hy: Մի կնքեք. չարտոնված է
ne: सील नगर्नुहोस्: अनाधिकृत
sl: Ne pečatite: nepooblaščeno

source: Do not seal, previous sealing canceled
cy: Peidio â selio, selio blaenorol wedi'i ddiddymu
hy: Մի կնքեք, նախորդ կնքումը չեղարկված է
ne: सील नगर्नुहोस्, अघिल्लो सील रद्द गरियो
sl: Ne pečatite, prejšnje pečatenje preklicano

source: Died less than 1 year old, sealing not required.
hy: Մահացել է 1 տարեկանից պակաս, կնքումը պարտադիր չէ:
ne: 1 वर्ष भन्दा कम उमेरमा मृत्यु भयो, सील आवश्यक छैन।

source: Common-law marriage
hy: Սովորական ամուսնություն
ne: सामान्य विवाह

source: If you modify the filename, you should also rename the file.
hy: Եթե դուք փոփոխում եք ֆայլի անունը, դուք նույնպես պետք է վերանվանեք ֆայլը:
ne: यदि तपाईंले फाइल नाम परिमार्जन गर्नुभयो भने, तपाईंले फाइलको नाम पनि पुन: नामाकरण गर्नुपर्छ।

source: adopted name
cy: enw mabwysiedig
hy: ընդունված անուն
ko: 입양 된 이름
ne: अपनाएको नाम
sl: posvojeno ime

source: also known as
cy: hefyd yn hysbys fel
hy: հայտնի է նաև որպես
ko: ~으로 알려진
ne: यस्तो पनि भनिन्छ
sl: znan/a tudi kot

source: birth name
cy: enw geni
hy: ծննդյան անունը
ko: 출생 이름
ne: जन्म नाम
sl: rojstno ime

source: change of name
cy: newid enw
hy: անվանափոխություն
ko: 이름 변경
ne: नाम परिवर्तन
sl: sprememba imena

source: estate name
cy: enw ystad
hy: գույքի անվանումը
ko: 부동산 이름
ne: स्टेट नाम
sl: hišno ime

source: immigration name
cy: enw mewnfudo
hy: ներգաղթի անունը
ko: 이민 온 이름
sl: ime po priselitvi

source: maiden name
cy: enw morwynol
hy: օրիորդական անուն
ko: 결혼 전의 성
sl: dekliško ime

source: married name
cy: enw priod
hy: ամուսնացած անունը
ko: 결혼한 이름
sl: poročno ime

source: religious name
cy: enw crefyddol
hy: կրոնական անուն
ko: 종교적 이름
ne: धार्मिक नाम
sl: versko ime

source: inline note
cy: nodyn mewnlin
hy: ներդիր գրառում
ko: 인라인 노트
sl: Opomba v besedilu

source: shared note
cy: nodyn i'w rannu
hy: ընդհանուր նշում
ko: 공유 노트
sl: Deljena opomba

source: no
cy: na
hy: ոչ
ko: 아니오
ne: होइन
sl: Ne

# Male pedigree
source: Birth
cy: Geni
hy: Ծնունդ
ko: 출생
ne: जन्म
sl: Rojstvo

# Male pedigree
source: Adopted
cy: Mabwysiadwyd
hy: Ընդունվել է
ko: 입양
ne: ग्रहण गरियो
sl: Posvojen

# Male pedigree
source: Foster
cy: Maethu
hy: Ֆոստեր
ko: 위탁입양
ne: पालनपोषण
sl: Rejnik

# Male pedigree
source: Sealing
cy: Selio
hy: Կնքումը
ne: सीलिङ
sl: Pečatenje

# Male pedigree
source: Rada
hy: Ռադա
ne: रादा
sl: Radāʿ

# Female pedigree
source: Birth
cy: Geni
hy: Ծնունդ
ko: 출생
ne: जन्म
sl: Rojstvo

# Female pedigree
source: Adopted
cy: Mabwysiadwyd
hy: Ընդունվել է
ko: 입양
ne: ग्रहण गरियो
sl: Posvojena

# Female pedigree
source: Foster
cy: Maethu
hy: Ֆոստեր
ko: 위탁
ne: पालनपोषण
sl: Rejnica

# Female pedigree
source: Sealing
cy: Selio
hy: Կնքումը
ne: सीलिङ
sl: Pečatenje

# Pedigree
source: Birth
cy: Genedigaeth
hy: Ծնունդ
ko: 출생
ne: जन्म
sl: Rojstvo

# Pedigree
source: Adopted
cy: Mabwysiadwyd
hy: Ընդունվել է
ko: 입양
ne: ग्रहण गरियो
sl: Posvojen

# Pedigree
source: Foster
cy: Maethu
hy: Ֆոստեր
ko: 위탁입양
ne: पालनपोषण
sl: Rejnik

# Pedigree
source: Sealing
cy: Selio
hy: Կնքումը
ne: सीलिङ
sl: Pečatenje

# MALE
source: Attendant
cy: Mynychwr
hy: սպասավոր
ko: 참석자
ne: परिचर
sl: Spremljevalec

# MALE
source: Attending
cy: Yn Mynychu
hy: Հաճախում
ko: 참석
ne: उपस्थित
sl: Spremljani

# MALE
source: Buyer
cy: Prynwr
hy: Գնորդ
ko: 구매자
ne: खरिदकर्ता
sl: Kupec

# MALE
source: Civil registrar
cy: Cofrestrydd sifil
hy: քաղաքացիական ռեգիստր
ko: 주민등록
ne: सिभिल रजिस्ट्रार
sl: Matičar

# MALE
source: Employee
cy: Gweithiwr
hy: Աշխատակից
ko: 직원
ne: कर्मचारी
sl: Uslužbenec

# MALE
source: Employer
cy: Cyflogwr
hy: Գործատու
ko: 직원
ne: रोजगारदाता
sl: Delodajalec

# MALE
source: Friend
cy: Ffrind
hy: Ընկեր
ko: 친구
ne: साथी
sl: Prijatelj

source: Godfather
cy: Tad bedydd
hy: Կնքահայր
ko: 대부
ne: गडफादर
sl: Boter

source: Godson
cy: Mab bedydd
hy: Սանիկ
ko: 대자
ne: छोरा
sl: Krščenec

# MALE
source: Guardian
cy: Gwarcheidwad
hy: Պահապան
ko: 보호자
ne: सरंक्षक
sl: Skrbnik

# MALE
source: Informant
cy: Hysbyswr
hy: Տեղեկատու
ko: 제보자
ne: सूचना दिने
sl: Obveščevalec

# MALE
source: Lodger
cy: Lletywr
hy: Բնակարան
ko: 동거인
ne: लजर
sl: Podnajemnik

# MALE
source: Nurse
cy: Nyrs
hy: Բուժքույր
ko: 유모
ne: नर्स
sl: Zdravstveni tehnik

# MALE
source: Owner
cy: Perchennog
hy: Սեփականատեր
ko: 오너
ne: मालिक
sl: Lastnik

# MALE
source: Registry officer
cy: Swyddog cofrestu
hy: Ռեեստրի աշխատակից
ko: 등록 담당자
ne: दर्ता अधिकारी
sl: Matičar

# MALE
source: Seller
cy: Gwerthwr
hy: Վաճառող
ko: 판매자
ne: बिक्रेता
sl: Prodajalec

# MALE
source: Servant
cy: Gwas
hy: Ծառա
ko: 하인
ne: सेवक
sl: Služabnik

# MALE
source: Slave
cy: Caethwas
hy: Ստրուկ
ko: 노예
ne: दास
sl: Suženj

# MALE
source: Ward
cy: Gwarchodaeth
hy: Վարդ
ko: 후견인
ne: वार्ड
sl: Rejenec

# FEMALE
source: Attendant
cy: Mynychwraig
hy: սպասավոր
ko: 참석자
ne: परिचर
sl: Spremljevalka

# FEMALE
source: Attending
cy: Yn Mynychu
hy: Հաճախում
ko: 참석
ne: उपस्थित
sl: Spremljana

# FEMALE
source: Buyer
cy: Prynwr
hy: Գնորդ
ko: 구매자
ne: खरिदकर्ता
sl: Kupec

# FEMALE
source: Civil registrar
cy: Cofrestrydd sifil
hy: քաղաքացիական ռեգիստր
ko: 주민등록
ne: सिभिल रजिस्ट्रार
sl: Matičarka

# FEMALE
source: Employee
cy: Gweithwraig
hy: Աշխատակից
ko: 직원
ne: कर्मचारी
sl: Uslužbenka

# FEMALE
source: Employer
cy: Cyflogwr
hy: Գործատու
ko: 직원
ne: रोजगारदाता
sl: Delodajalka

# FEMALE
source: Friend
cy: Ffrind
hy: Ընկեր
ko: 친구
ne: साथी
sl: Prijateljica

source: Godmother
cy: Mam fedydd
hy: Կնքամայր
ko: 대모
ne: गडमदर
sl: Botra

source: Goddaughter
cy: Merch fedydd
hy: Կնքուհին
ko: 대녀
ne: छोरी
sl: Krščenka

# FEMALE
source: Guardian
cy: Gwarcheidwad
hy: Պահապան
ko: 보호자
ne: सरंक्षक
sl: Skrbnica

# FEMALE
source: Informant
cy: Hysbyswr
hy: Տեղեկատու
ko: 제보자
ne: सूचना दिने
sl: Obveščevalka

# FEMALE
source: Lodger
cy: Lletywr
hy: Բնակարան
ko: 동거인
ne: लजर
sl: Podnajemnica

# FEMALE
source: Nurse
cy: Nyrs
hy: Բուժքույր
ko: 유모
ne: नर्स
sl: Medicinska sestra

# FEMALE
source: Owner
cy: Perchennog
hy: Սեփականատեր
ko: 오너
ne: मालिक
sl: Lastnica

# FEMALE
source: Registry officer
cy: Swyddog cofrestrfa
hy: Ռեեստրի աշխատակից
ko: 등록 담당자
ne: दर्ता अधिकारी
sl: Matičarka

# FEMALE
source: Seller
cy: Gwerthwr
hy: Վաճառող
ko: 판매자
ne: बिक्रेता
sl: Prodajalka

# FEMALE
source: Servant
cy: Gwas
hy: Ծառա
ko: 하인
ne: सेवक
sl: Služabnica

# FEMALE
source: Slave
cy: Caethwas
hy: Ստրուկ
ko: 노예
ne: दास
sl: Sužnja

# FEMALE
source: Ward
cy: Gwarchodaeth
hy: Վարդ
ko: 후견인
ne: वार्ड
sl: Rejenka

source: Attendant
cy: Mynychwr
hy: սպասավոր
ko: 참석자
ne: परिचर
sl: Spremljevalec

source: Attending
cy: Mynychu
hy: Հաճախում
ko: 참석
ne: उपस्थित
sl: Spremljani

source: Best man
cy: Gwas priodas
hy: Լավագույն մարդ
ko: 신랑 들러리
ne: बेस्ट म्यान
sl: Priča

source: Bridesmaid
cy: Morwyn briodas
hy: Հարսնաքույր
ko: 신부 들러리
ne: दुलही
sl: Družica

source: Buyer
cy: Prynwr
hy: Գնորդ
ko: 구매자
ne: खरिदकर्ता
sl: Kupec

source: Circumciser
cy: Enwaedydd
hy: Թլփատող
ko: 할례
ne: सर्कमसाइजर
sl: Obrezovalec

source: Civil registrar
cy: Cofrestrydd sifil
hy: քաղաքացիական ռեգիստր
ko: 주민등록
ne: सिभिल रजिस्ट्रार
sl: Matičar

source: Employee
cy: Gweithiwr
hy: Աշխատակից
ko: 직원
ne: कर्मचारी
sl: Uslužbenec

source: Employer
cy: Cyflogwr
hy: Գործատու
ko: 직원
ne: रोजगारदाता
sl: Delodajalec

source: Foster child
cy: Plentyn maeth
hy: Խնամատար երեխա
ko: 위탁 아동
ne: धर्मपुत्र वा पुत्री
sl: Rejenec

source: Foster father
cy: Tad maeth
hy: Խնամատար հայր
ko: 위탁입양 아버지
ne: धर्मपिता
sl: Krušni oče

source: Foster mother
cy: Mam faeth
hy: Խնամատար մայր
ko: 위탁입양 어머니
ne: धर्ममाता
sl: Krušna mati

source: Friend
cy: Ffrind
hy: Ընկեր
ko: 친구
ne: साथी
sl: Prijatelj

source: Godparent
cy: Rhiant bedydd
hy: կնքահայր
ko: 대부모
ne: गडप्यारेन्ट
sl: Boter

source: Godchild
cy: Plentyn bedydd
hy: Սանիկ
ko: 대자녀
ne: गडचाइल्ड
sl: Krščenec

source: Guardian
cy: Gwarcheidwad
hy: Պահապան
ko: 보호자
ne: सरंक्षक
sl: Skrbnik

source: Informant
cy: Hysbyswr
hy: Տեղեկատու
ko: 제보자
ne: सूचना दिने
sl: Obveščevalec

source: Lodger
cy: Lletywr
hy: Բնակարան
ko: 동거인
ne: लजर
sl: Podnajemnik

source: Multiple birth
hy: Բազմակի ծնունդ
ne: बहु जन्म

source: Nanny
cy: Nani
hy: Դայակ
ko: 유모
ne: नानी
sl: Varuška

source: Nurse
cy: Nyrs
hy: Բուժքույր
ko: 유모
ne: नर्स
sl: Medicinska sestra

source: Owner
cy: Perchennog
hy: Սեփականատեր
ko: 오너
ne: मालिक
sl: Lastnik

source: Proxy
cy: Dirprwy
hy: Վստահված անձ
ne: प्रोक्सी

source: Priest
cy: Offeiriad
hy: Քահանա
ko: 성직자
ne: पुजारी
sl: Duhovnik

source: Rabbi
hy: Ռաբբի
ko: 랍비
ne: रब्बी
sl: Rabin

source: Registry officer
cy: Swyddog cofrestu
hy: Ռեեստրի աշխատակից
ko: 등록 담당자
ne: दर्ता अधिकारी
sl: Matičar

source: Seller
cy: Gwerthwr
hy: Վաճառող
ko: 판매자
ne: बिक्रेता
sl: Prodajalec

source: Servant
cy: Gwas
hy: Ծառա
ko: 하인
ne: सेवक
sl: Služabnik

source: Slave
cy: Caethwas
hy: Ստրուկ
ko: 노예
ne: दास
sl: Suženj
