Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: LDS child sealing
cy: Selio plentyn LDS
hy: LDS երեխայի կնքումը
ko: 후기 성도 교회 자녀 인봉
ne: LDS बच्चा सीलिङ
sl: Pečatenje otroka LDS

source: Date of LDS child sealing
cy: Dyddiad selio plentyn LDS
hy: LDS երեխայի կնքման ամսաթիվը
ne: LDS बच्चा सील को मिति
sl: Datum pečatenja otroka LDS

source: Parents
cy: Rhieni
hy: Ծնողներ
ko: 부모
ne: मूल
sl: Starši

source: Place of LDS child sealing
cy: Man selio plentyn LDS
hy: LDS երեխայի կնքման վայրը
ne: LDS बच्चा सीलिङ गर्ने ठाउँ
sl: Kraj pečatenja otroka LDS

source: Social security number
cy: Rhif nawdd cymdeithasol
hy: Սոցիալական ապահովության համարը
ko: 주민등록번호
ne: सामाजिक सुरक्षा नम्बर
sl: Številka zdravstvenega zavarovanja

source: Will
cy: Ewyllys
hy: Կամք
ko: 유언
ne: हुनेछ
sl: Oporoka

source: Continuation
hy: Շարունակություն
ne: निरन्तरता

source: Binary data object
cy: Gwrthrych data deuaidd
hy: Երկուական տվյալների օբյեկտ
ko: 바이너리 데이터 객체
ne: बाइनरी डाटा वस्तु
sl: Podatki dvojiške oblike

source: Media type
cy: Math o gyfryngau
hy: Մեդիա տեսակը
ko: 미디어 유형
ne: मिडिया प्रकार
sl: Vrsta medija

# Repository
source: Name
cy: Enw
hy: Անուն
ko: 이름
ne: नाम
sl: Ime

source: Author
cy: Awdur
hy: Հեղինակ
ko: 작성자
ne: लेखक
sl: Avtor

source: Events
cy: Digwyddiadau
hy: Իրադարձություններ
ko: 이벤트
ne: घटनाहरू
sl: Dogodki

source: Date range
cy: Ystod dyddiad
hy: Ամսաթվերի միջակայք
ko: 날짜 범위
ne: मिति दायरा
sl: Časovno obdobje

source: Note on source data
hy: Նշում աղբյուրի տվյալների վերաբերյալ
ne: स्रोत डेटामा नोट गर्नुहोस्

source: Note on source
hy: Նշում աղբյուրի վրա
ne: स्रोतमा नोट

source: Publication
cy: Cyhoeddiad
hy: Հրապարակում
ne: प्रकाशन
sl: Publikacija

source: Call number
cy: Rhif galw
hy: Զանգի համարը
ko: 전화번호
ne: कल नम्बर
sl: Signatura

source: Note on repository reference
hy: Նշում պահեստի տեղեկանքի վերաբերյալ
ne: भण्डार सन्दर्भमा नोट

source: Generations of ancestors
cy: Cenedlaethau o hynafiaid
hy: Նախնիների սերունդներ
ko: 조상의 세대
ne: पुर्खाहरूको पुस्ता
sl: Generacije prednikov

source: Generations of descendants
cy: Cenedlaethau o ddisgynyddion
hy: Հետնորդների սերունդներ
ko: 후손의 세대
ne: सन्तानको पुस्ता
sl: Generacije potomcev

source: Family file
cy: Ffeil teulu
hy: Ընտանեկան ֆայլ
ko: 가족 파일
ne: पारिवारिक फाइल
sl: Družinska datoteka

source: Ordinance
cy: Ordinhad
hy: Հրամանագիր
ko: 법령(조례)
ne: अध्यादेश
sl: Odlok

source: Trailer
cy: Hysbysiad
hy: Թեյլեր
ko: 트레일러
ne: ट्रेलर
sl: Napovednik

source: You do not have permission to view this page.
cy: Nid oes gennych ganiatâd i weld y dudalen hon.
hy: Դուք այս էջը դիտելու թույլտվություն չունեք:
ko: 이 페이지를 볼 수있는 권한이 없습니다.
ne: तपाईंसँग यो पृष्ठ हेर्ने अनुमति छैन।
sl: Nimate dovoljenja za ogled te strani.

source: The server could not understand this request.
cy: Nid oedd y gweinydd yn deall y cais hwn.
hy: Սերվերը չկարողացավ հասկանալ այս հարցումը:
ko: 서버가 이 요청을 이해할 수 없습니다.
ne: सर्भरले यो अनुरोध बुझ्न सकेन।
sl: Strežnik ne razume te zahteve.

source: This page has been deleted.
hy: Այս էջը ջնջվել է։
ne: यो पृष्ठ मेटाइएको छ।

source: Too many requests. Try again later.
cy: Gormod o geisiadau. Ceisiwch eto yn nes ymlaen.
hy: Չափազանց շատ խնդրանքներ: Փորձեք ավելի ուշ:
ne: धेरै अनुरोधहरू। पछि फेरि प्रयास गर्नुहोस्।
sl: Preveč zahtev. Prosimo, poskusite kasneje.

source: The form data is incomplete. Perhaps you need to increase max_input_vars on your server?
hy: Ձևի տվյալները թերի են: Միգուցե դուք պետք է մեծացնեք max_input_vars-ը ձեր սերվերում?
ne: फारम डाटा अपूर्ण छ। सायद तपाईंले आफ्नो सर्भरमा max_input_vars बढाउन आवश्यक छ?

source: This form has expired. Try again.
cy: Mae'r ffurflen hon wedi dod i ben. Ceisiwch eto.
hy: Այս ձևի ժամկետը լրացել է: Նորից փորձեք:
ko: 이 양식은 만료되었습니다. 다시 시도하십시오.
ne: यो फारमको म्याद सकियो । फेरी प्रयास गर्नुहोस् ।
sl: Ta obrazec je potekel. Poskusite znova.

source: The module “%s” has been enabled.
cy: Mae'r modiwl “%s” wedi'i alluogi.
hy: «%s» մոդուլը միացված է:
ko: “%s”모듈이 활성화되었습니다.
ne: मोड्युल "%s" सक्षम गरिएको छ।
sl: Modul “%s” je omogočen.

source: The module “%s” has been disabled.
cy: Mae'r modiwl “%s” wedi'i analluogi.
hy: «%s» մոդուլն անջատված է:
ko: “%s”모듈이 비활성화되었습니다.
ne: मोड्युल "%s" असक्षम गरिएको छ।
sl: Modul “%s” je onemogočen.

source: My account
cy: Fy Nghyfrif
hy: Իմ հաշիվը
ko: 내 계정
ne: मेरो एकाउन्ट
sl: Moj račun

source: Duplicate username. A user with that username already exists. Please choose another username.
cy: Enw defnyddiwr dyblyg. Mae defnyddiwr gyda'r enw defnyddiwr hwnnw eisoes yn bodoli. Dewiswch enw defnyddiwr arall.
hy: Կրկնօրինակ օգտանուն: Այդ օգտանունով օգտվող արդեն գոյություն ունի: Խնդրում ենք ընտրել այլ օգտվողի անուն:
ko: 중복된 사용자 이름입니다. 해당 사용자 이름을 가진 사용자가 이미 있습니다. 다른 사용자 이름을 선택하십시오.
ne: डुप्लिकेट प्रयोगकर्ता नाम। त्यो प्रयोगकर्ता नाम भएको प्रयोगकर्ता पहिले नै अवस्थित छ। कृपया अर्को प्रयोगकर्ता नाम छान्नुहोस्।
sl: Podvoji uporabniško ime. Uporabnik s takim imenom že obstaja.Izberi drugo uporabniško ime.

source: Duplicate email address. A user with that email already exists.
cy: Cyfeiriad e-bost dyblyg. Mae defnyddiwr gyda'r e-bost hwnnw eisoes yn bodoli.
hy: Կրկնօրինակ էլփոստի հասցե: Այդ էլփոստով օգտվող արդեն գոյություն ունի:
ko: 이메일 주소가 중복되었습니다. 해당 이메일을 가진 사용자가 이미 존재합니다.
ne: डुप्लिकेट इमेल ठेगाना। त्यो इमेल भएको प्रयोगकर्ता पहिले नै अवस्थित छ।
sl: Podvojeni e-naslov. Uporabnik s tem e-naslovom že obstaja.

source: The details for “%s” have been updated.
cy: Mae'r manylion ar gyfer “%s” wedi'u diweddaru.
hy: «%s»-ի մանրամասները թարմացվել են:
ko: “%s”의 세부 정보가 업데이트되었습니다.
ne: "%s" को विवरण अद्यावधिक गरिएको छ।
sl: Podrobnosti za “%s” so posodobljene.

source: Add a son
cy: Ychwanegu mab
hy: Ավելացնել որդի
ko: 아들 추가
ne: छोरा थप्नुहोस्
sl: Dodaj sina

source: Add a daughter
cy: Ychwanegu merch
hy: Ավելացնել դուստր
ko: 딸 추가
ne: छोरी थप्नुहोस्
sl: Dodaj hčerko

source: Add a child
cy: Ychwanegu plentyn
hy: Ավելացնել երեխա
ko: 자녀 추가
ne: छोराछोरी थप्नुहोस्
sl: Dodaj otroka

source: Add a child to create a one-parent family
cy: Ychwanegu plentyn i greu teulu un rhiant
hy: Ավելացրեք երեխա՝ մեկ ծնողից բաղկացած ընտանիք ստեղծելու համար
ko: 한 부모 자녀 추가
ne: एक-अभिभावक परिवार सिर्जना गर्न बच्चा थप्नुहोस्
sl: Dodaj otroka enostarševski družini

source: There was an error uploading your file.
cy: Bu gwall wrth lwytho’ch ffeil.
hy: Ձեր ֆայլը վերբեռնելիս սխալ տեղի ունեցավ:
ko: 파일을 업로드하는 중에 오류가 발생했습니다.
ne: तपाईंको फाइल अपलोड गर्दा त्रुटि भयो।
sl: Zgodila se je napaka pri nalaganju vaše datoteke.

source: Add a media file
cy: Ychwanegu ffeil cyfryngau
hy: Ավելացնել մեդիա ֆայլ
ko: 미디어 파일 추가
ne: मिडिया फाइल थप्नुहोस्
sl: Dodaj medijsko datoteko

source: Add a mother
cy: Ychwanegu mam
hy: Մայր ավելացրեք
ko: 어머니 추가
ne: नयाँ आमा थप्नुहोस्
sl: Dodaj mater

source: Add a father
cy: Ychwanegu tad
hy: Ավելացրեք հայր
ko: 아버지 추가
ne: नयाँ बुवा थप्नुहोस्
sl: Dodaj očeta

source: Add a wife
cy: Ychwanegu gwraig
hy: Ավելացրեք կին
ko: 부인 추가
ne: नयाँ श्रीमती थप्नुहोस्
sl: Dodaj ženo

source: Add a husband
cy: Ychwanegu gŵr
hy: Ավելացնել ամուսին
ko: 남편 추가
ne: नयाँ श्रीमान् थप्नुहोस्
sl: Dodaj moža

source: Add a spouse
hy: Ավելացնել կողակից
ko: 배우자 추가
ne: श्रीमान/श्रीमती थप्नुहोस्

source: Create an individual
cy: Creu unigolyn
hy: Ստեղծել անհատ
ko: 인물 만들기
ne: व्यक्ति सिर्जना गर्नुहोस्
sl: Ustvari osebo

source: The parameter “path” is invalid.
hy: «Ճանապարհ» պարամետրն անվավեր է:
ne: "path" प्यारामिटर गलत छ।

source: The message was successfully sent to %s.
cy: Anfonwyd y neges yn llwyddiannus at %s.
hy: Հաղորդագրությունը հաջողությամբ ուղարկվեց %s-ին:
ko: 메시지가 %s에 성공적으로 전송되었습니다.
ne: सन्देश सफलतापूर्वक %s मा पठाइयो।
sl: Sporočilo je uspešno poslano uporabniku %s.

source: The message was not sent to %s.
hy: Հաղորդագրությունը չի ուղարկվել %s-ին:
ne: सन्देश %s लाई पठाइएको थिएन।

source: %s year anniversary
cy: Dathliad blwyddyn %s
hy: %s տարեդարձ
ko: %s 년 기념일
ne: %s वार्षिक उत्सव
sl: %s. obletnica

source: Day not set
cy: Diwrnod heb ei osod
hy: Օրը սահմանված չէ
ko: 날짜가 설정되지 않음
ne: दिन तोकिएको छैन
sl: Dan ni določen

source: Anniversary calendar
cy: Calendr dathliad
hy: Հոբելյանական օրացույց
ko: 기념일 달력
ne: वार्षिकोत्सव क्यालेन्डर
sl: Koledar obletnic

source: On this day…
cy: Ar y diwrnod hwn…
hy: Այս օրը…
ko: 오늘…
ne: यो दिनमा…
sl: Na današnji dan …

source: In this month…
cy: Yn y mis hwn…
hy: Այս ամսում…
ko: 이 달…
ne: यो महिनामा …
sl: V tem mesecu …

source: In this year…
cy: Eleni…
hy: Այս տարում…
ko: 올 해…
ne: यो वर्षमा…
sl: V tem letu …

source: Change family members
cy: Newid aelodau'r teulu
hy: Փոխեք ընտանիքի անդամներին
ko: 가족 구성원 변경
ne: परिवारका सदस्यहरू परिवर्तन गर्नुहोस्
sl: Spremeni člane družine

source: Invalid GEDCOM record.
hy: Անվավեր GEDCOM գրառում:
ne: अमान्य GEDCOM रेकर्ड।

source: Invalid GEDCOM level number.
hy: Անվավեր GEDCOM մակարդակի համար:
ne: अमान्य GEDCOM स्तर नम्बर।

source: Custom GEDCOM tags are discouraged. Try to use only standard GEDCOM tags.
hy: Հատուկ GEDCOM պիտակները չեն խրախուսվում: Փորձեք օգտագործել միայն ստանդարտ GEDCOM թեգերը:
ne: अनुकूलन GEDCOM ट्यागहरू निरुत्साहित छन्। मानक GEDCOM ट्यागहरू मात्र प्रयोग गर्ने प्रयास गर्नुहोस्।

source: Invalid GEDCOM tag.
hy: Անվավեր GEDCOM թեգ:
ne: अमान्य GEDCOM ट्याग।

source: %s does not exist.
hy: %s գոյություն չունի:
ko: %s 존재하지 않음.
ne: %s उपलब्ध छैन ।

source: %1$s does not have a link back to %2$s.
cy: Nid oes gan %1$s ddolen yn ôl i %2$s.
hy: %1$s-ը %2$s-ի հետ կապ չունի:
ko: %1$s 에 %2$s 에 대한 링크가 없습니다.
ne: %1$s सँग %2$s मा फर्किने लिङ्क छैन।
sl: %1$s ne vsebuje povezave nazaj na %2$s.

source: %1$s does not exist. Did you mean %2$s?
cy: Nid yw %1$s yn bodoli. Oeddech chi'n golygu %2$s?
hy: %1$s գոյություն չունի: Նկատի ունեիք %2$s?
ko: %1$s 존재하지 않음. %2$s 을(를) 의미 했습니까?
ne: %1$s उपलब्ध छैन. तपाईको मतलब %2$s हो ?
sl: %1$s ne obstaja. Ste mislili %2$s?

source: Inline-source records are discouraged.
hy: Ներքին աղբյուրի գրառումները չեն խրախուսվում:
ne: इनलाइन-स्रोत रेकर्डहरू निरुत्साहित छन्।

source: Invalid GEDCOM value.
hy: GEDCOM-ի անվավեր արժեք:
ne: अमान्य GEDCOM मान।

source: “%1$s” should be “%2$s”.
hy: «%1$s»-ը պետք է լինի «%2$s»:
ne: "%1$s" "%2$s" हुनुपर्छ।

source: webtrees does not recognise this file format.
hy: webtrees-ը չի ճանաչում այս ֆայլի ձևաչափը:
ne: webtrees ले यो फाइल ढाँचा पहिचान गर्दैन।

source: webtrees cannot create thumbnails for this file format.
hy: webtrees-ը չի կարող այս ֆայլի ձևաչափի մանրապատկերներ ստեղծել:
ne: webtrees ले यो फाइल ढाँचाको लागि थम्बनेलहरू सिर्जना गर्न सक्दैन।

source: This filename is not compatible with the GEDZIP file format.
hy: Այս ֆայլի անունը համատեղելի չէ GEDZIP ֆայլի ձևաչափի հետ:
ne: यो फाइलनाम GEDZIP फाइल ढाँचासँग उपयुक्त छैन।

source: %s occurs too many times.
hy: %s-ը տեղի է ունենում չափազանց շատ անգամ:
ne: %s धेरै पटक हुन्छ।

source: Check for errors
cy: Gwiriwch am wallau
hy: Ստուգեք սխալների համար
ko: 오류 확인
ne: त्रुटिहरूको लागि जाँच गर्नुहोस्
sl: Preveri napake

source: %1$s is a %2$s but a %3$s is expected.
cy: Mae %1$s yn %2$s ond mae disgwyl %3$s.
hy: %1$s-ը %2$s է, բայց սպասվում է %3$s:
ko: %1$s 은(는) %2$s 이지만 %3$s 이(가) 예상됩니다.
ne: %1$s एक %2$s हो तर %3$s अपेक्षित छ।
sl: %1$s je %2$s vendar je pričakovano %3$s.

source: Line number
hy: Տողի համարը
ne: लाइन नम्बर

source: Clean up data folder
cy: Glanhau ffolder data
hy: Մաքրել տվյալների թղթապանակը
ko: 데이터 폴더 정리
ne: डाटा फोल्डर सफा गर्नुहोस्
sl: Čiščenje podatkovne mape

source: Please try again.
cy: Ceisiwch eto.
hy: Խնդրում ենք կրկին փորձել:
ko: 다시 시도해주세요.
ne: पुन: प्रयास गर्नुहोस्।
sl: Prosimo, poizkusite ponovno.

source: Please enter a valid email address.
cy: Rhowch gyfeiriad e-bost dilys.
hy: Խնդրում ենք մուտքագրել վավեր էլփոստի հասցե:
ko: 유효한 이메일 주소를 입력하세요.
ne: कृपया वैद्य ई-मेल भर्नुहोस।
sl: Prosimo, vnesite veljaven e-poštni naslov.

source: You are not allowed to send messages that contain external links.
cy: Nid oes gennych ganiatâd i anfon negeseuon sy'n cynnwys dolenni allanol.
hy: Ձեզ չի թույլատրվում ուղարկել արտաքին հղումներ պարունակող հաղորդագրություններ:
ko: 외부 링크가 포함 된 메시지를 보낼 수 없습니다.
ne: तपाईंलाई बाह्य लिङ्कहरू समावेश भएका सन्देशहरू पठाउन अनुमति छैन।
sl: Pošiljanje sporočil, ki vsebujejo zunanje povezave, ni dovoljeno.

source: You should delete the “%1$s” from “%2$s” and try again.
cy: Dylech ddileu'r “%1$s” o “%2$s” a rhoi cynnig arall arni.
hy: Դուք պետք է ջնջեք «%1$s»-ը «%2$s»-ից և նորից փորձեք:
ko: "%2$s"에서 "%1$s"를 삭제하고 다시 시도해야합니다.
ne: तपाईंले "%2$s" बाट "%1$s" मेटाउनुपर्छ र फेरि प्रयास गर्नुपर्छ।
sl: Izbrisati morate “%1$s” iz “%2$s” in poskusiti znova.

source: The message was not sent.
cy: Heb anfon y neges.
hy: Հաղորդագրությունը չի ուղարկվել։
ko: 메시지가 전송되지 않았습니다.
ne: सन्देश पठाइएन।
sl: Sporočilo ni poslano.

source: Send a message
cy: Anfon neges
hy: Ուղարկել հաղորդագրություն
ko: 메시지 보내기
ne: सन्देश पठाउनुहोस्
sl: Pošlji sporočilo

source: Control panel
cy: Panel rheoli
hy: Կառավարման վահանակ
ko: 제어판
ne: कन्ट्रोल प्यानल
sl: Nadzorna plošča

source: “%s“ has been copied to the clipboard.
hy: «%s»-ը պատճենվել է սեղմատախտակին:
ko: "%s"이(가) 클립보드에 복사되었습니다.
ne: "%s" क्लिपबोर्डमा प्रतिलिपि गरिएको छ।

source: Use the “edit“ menu to paste this into another record.
hy: Օգտագործեք «խմբագրել» ընտրացանկը՝ սա մեկ այլ գրառման մեջ տեղադրելու համար:
ko: "편집" 메뉴를 사용하여 이것을 다른 레코드에 붙여넣습니다.
ne: यसलाई अर्को रेकर्डमा टाँस्न "सम्पादन" मेनु प्रयोग गर्नुहोस्।

source: The location has been created
cy: Mae'r lleoliad wedi'i greu
hy: Տեղադրությունը ստեղծվել է
ko: 위치가 생성되었습니다
ne: स्थान बनाइएको छ
sl: Lokacija je ustvarjena

source: The media object has been created
cy: Mae'r gwrthrych cyfryngau wedi'i greu
hy: Մեդիա օբյեկտը ստեղծվել է
ko: 미디어 객체가 생성되었습니다
ne: मिडिया वस्तु सिर्जना गरिएको छ
sl: Medijski predmet je ustvarjen

source: The note has been created
cy: Mae'r nodyn wedi'i greu
hy: Գրառումը ստեղծվել է
ko: 노트가 생성되었습니다
ne: नोट सिर्जना गरिएको छ
sl: Opomba je ustvarjena

source: The repository has been created
cy: Mae'r storfan wedi'i greu
hy: Պահեստը ստեղծվել է
ko: 저장소가 작성되었습니다
ne: भण्डार बनाइएको छ
sl: Skladišče je ustvarjeno

source: The source has been created
cy: Mae'r ffynhonnell wedi'i chreu
hy: Աղբյուրը ստեղծվել է
ko: 출처가 생성되었습니다
ne: स्रोत बनाइएको छ
sl: Vir je ustvarjen

source: The submission has been created
cy: Mae'r cyflwyniad wedi'i greu
hy: Ներկայացումը ստեղծվել է
ko: 제안이 생성되었습니다
ne: सबमिशन सिर्जना गरिएको छ
sl: Pošiljka je ustvarjena

source: The submitter has been created
cy: Mae'r cyflwynydd wedi'i greu
hy: Ներկայացնողը ստեղծվել է
ko: 제출자가 생성되었습니다
ne: पेशकर्ता बनाइएको छ
sl: Pošiljatelj je ustvarjen

source: The family tree “%s” already exists.
cy: Mae'r cart achau “%s” eisoes yn bodoli.
hy: «%s» տոհմածառն արդեն գոյություն ունի:
ko: 가계도 “%s”이(가) 이미 존재합니다.
ne: पारिवारिक रूख "%s" पहिले नै अवस्थित छ।
sl: Družinsko drevo “%s” že obstaja.

source: The family tree “%s” has been created.
cy: Mae'r cart achau “%s” wedi'i greu.
hy: «%s» տոհմածառը ստեղծվել է:
ko: 가계도 “%s”이(가) 생성되었습니다.
ne: पारिवारिक रूख "%s" सिर्जना गरिएको छ।
sl: Družinsko drevo “%s” je ustvarjeno.

source: Create a family tree
cy: Creu cart achau
hy: Ստեղծեք տոհմածառ
ko: 가계도 만들기
ne: एउटा पारिवारिक वृक्ष बनाउनुहोस्
sl: Ustvari družinsko drevo

source: My family tree
cy: Fy nghart achau
hy: Իմ տոհմածառը
ko: 나의 가족 가계도
ne: मेरो परिवार वृक्ष
sl: Moje družinsko drevo

source: Data fixes
cy: Cywiro data
hy: Տվյալների շտկում
ko: 데이터 수정
ne: डाटा फिक्स
sl: Popravki podatkov

source: Preview
cy: Rhagolwg
hy: Նախադիտում
ko: 미리보기
ne: पूर्वावलोकन
sl: Predogled

source: Update
cy: Diweddariad
hy: Թարմացնել
ko: 업데이트
ne: अपडेट
sl: Posodobi

source: The file %s could not be deleted.
cy: Nid oedd modd dileu'r ffeil %s.
hy: %s ֆայլը չհաջողվեց ջնջել:
ko: 파일 %s을(를) 지울 수 없습니다.
ne: फाइल %s मेटाउन सकिएन।
sl: Datoteke “%s” ni mogoče izbrisati.

source: The folder %s has been deleted.
cy: Mae'r ffolder %s wedi'i ddileu.
hy: %s պանակը ջնջվել է:
ko: 폴더 %s이(가) 삭제되었습니다.
ne: फोल्डर %s मेटाइएको छ।
sl: Mapa “%s” je izbrisana.

source: The folder %s could not be deleted.
cy: Nid oedd modd dileu'r ffolder %s.
hy: %s պանակը չհաջողվեց ջնջել:
ko: 폴더 %s을(를) 삭제할 수 없습니다.
ne: फोल्डर %s मेटाउन सकिएन।
sl: Mape “%s” ni mogoče izbrisati.

source: The file %s has been deleted.
cy: Mae'r ffeil %s wedi'i dileu.
hy: %s ֆայլը ջնջվել է:
ko: 파일 %s이(가) 삭제되었습니다.
ne: फाइल %s मेटाइएको छ।
sl: Datoteka “%s” je izbrisana.

source: The family “%s” has been deleted because it only has one member.
cy: Mae'r teulu “%s” wedi'i ddileu oherwydd mai dim ond un aelod sydd ganddo.
hy: «%s» ընտանիքը ջնջվել է, քանի որ այն ունի միայն մեկ անդամ:
ko: “%s” 가계는 하나의 구성원 만 있기 때문에 삭제되었습니다.
ne: परिवार "%s" मेटाइएको छ किनभने यसमा एक सदस्य मात्र छ।
sl: Družinsko drevo “%s” je izbrisano, ker ima samo enega člana.

source: The link from “%1$s” to “%2$s” has been deleted.
cy: Mae'r ddolen o “%1$s” i “%2$s” wedi'i dileu.
hy: «%1$s»-ից «%2$s» կապը ջնջվել է:
ko: %1$s”에서“%2$s”로의 링크가 삭제되었습니다.
ne: "%1$s" देखि "%2$s" सम्मको लिङ्क मेटाइएको छ।
sl: Povezava med “%1$s” in “%2$s” je izbrisana.

source: The family tree “%s” has been deleted.
cy: Mae'r cart achau “%s” wedi'i ddileu.
hy: «%s» տոհմածառը ջնջվել է:
ko: 가계도 “%s”이(가) 삭제되었습니다.
ne: पारिवारिक रूख "%s" मेटाइएको छ।
sl: Družinsko drevo “%s” je izbrisano.

source: The media file %1$s has been renamed to %2$s.
cy: Mae'r ffeil cyfryngau %1$s wedi'i ailenwi i %2$s.
hy: %1$s մեդիա ֆայլը վերանվանվել է %2$s:
ko: 미디어 파일 %1$s의 이름이 %2$s(으)로 바뀌었습니다.
ne: मिडिया फाइल %1$s लाई %2$s मा पुन: नामाकरण गरिएको छ।
sl: Medijska datoteka %1$s je preimenovana v %2$s.

source: The media file %1$s could not be renamed to %2$s.
cy: Nid oedd modd ailenwi'r ffeil cyfryngau %1$s yn %2$s.
hy: %1$s մեդիա ֆայլը չհաջողվեց վերանվանել %2$s:
ko: 미디어 파일 %1$s의 이름을 %2$s(으)로 바꿀 수 없습니다.
ne: मिडिया फाइल %1$s लाई %2$s मा पुन: नामाकरण गर्न सकिएन।
sl: Medijske datoteke %1$s ni mogoče preimenovati v %2$s.

source: Edit a media file
cy: Golygu ffeil cyfryngau
hy: Խմբագրել մեդիա ֆայլը
ko: 미디어 파일 편집
ne: मिडिया फाइल सम्पादन गर्नुहोस्
sl: Uredi medijsko datoteko

source: Edit the shared note
cy: Golygu'r nodyn i'w rannu
hy: Խմբագրել ընդհանուր նշումը
ko: 공유 노트 편집
ne: साझा नोट सम्पादन गर्नुहोस्
sl: Uredi deljeno opombo

source: Edit the raw GEDCOM
cy: Golygu'r GEDCOM bras
hy: Խմբագրել չմշակված GEDCOM-ը
ko: raw GEDCOM 편집
ne: कच्चा GEDCOM सम्पादन गर्नुहोस्
sl: Uredi neobdelani GEDCOM

source: The website preferences have been updated.
cy: Mae'r dewisiadau'r wefan wedi'u diweddaru.
hy: Կայքի նախապատվությունները թարմացվել են:
ko: 웹 사이트 환경 설정이 업데이트되었습니다.
ne: वेबसाइट प्राथमिकताहरू अद्यावधिक गरिएको छ।
sl: Nastavitve spletišča so posodobljene.

source: Sending email
cy: Anfon e-bost
hy: Ուղարկելով էլ
ko: 이메일 보내기
ne: इमेल पठाउँदै
sl: E-pošta pošiljatelja

source: Export a GEDCOM file
cy: Allforio ffeil GEDCOM
hy: Արտահանել GEDCOM ֆայլ
ko: GEDCOM 파일 내보내기
ne: GEDCOM फाइल निर्यात गर्नुहोस्
sl: Izvozi datoteko GEDCOM

source: The family tree has been exported to %s.
cy: Mae'r cart achau wedi'i allforio i %s.
hy: Տոհմածառը արտահանվել է %s:
ko: 가계도를 %s로 내보냈습니다.
ne: परिवार रूख %s मा निर्यात गरिएको छ।
sl: Družinsko drevo je bilo izvoženo v %s.

source: The file %s could not be created.
cy: Nid oedd modd creu'r ffeil %s.
hy: %s ֆայլը չհաջողվեց ստեղծել:
ko: 파일 %s을(를) 만들 수 없습니다.
ne: फाइल %s सिर्जना गर्न सकिएन।
sl: Datoteke “%s” ni mogoče ustvariti.

source: Children
cy: Plentyn
hy: Երեխաներ
ko: 자녀
ne: छोराछोरी
sl: Otroci

source: Find duplicates
cy: Canfod dyblygiadau
hy: Գտեք կրկնօրինակներ
ko: 중복 찾기
ne: डुप्लिकेट पत्ता लगाउनुहोस्
sl: Najdi dvojnike

source: Link media objects to facts and events
cy: Cysylltu gwrthrychau cyfryngau â ffeithiau a digwyddiadau
hy: Կապել լրատվամիջոցների օբյեկտները փաստերի և իրադարձությունների հետ
ko: 미디어 개체를 사실 및 이벤트에 연결
ne: मिडिया वस्तुहरूलाई तथ्य र घटनाहरूसँग लिङ्क गर्नुहोस्
sl: Povezovanje medijskih predmetov z dejstvi in dogodki

source: Invalid GEDCOM file - no trailer record found.
hy: Անվավեր GEDCOM ֆայլ. թրեյլերի գրառում չի գտնվել:
ne: अमान्य GEDCOM फाइल - कुनै ट्रेलर रेकर्ड फेला परेन।

source: Deleting…
hy: Ջնջվում է…
ne: मेटाइँदैछ…

source: Invalid GEDCOM file - no header record found.
cy: Ffeil GEDCOM annilys - heb ganfod cofnod pennyn.
hy: Անվավեր GEDCOM ֆայլ. վերնագրի գրառում չի գտնվել:
ko: 잘못된 GEDCOM 파일 - 헤더 레코드를 찾을 수 없습니다.
ne: अवैध GEDCOM फाइल - कुनै हेडर रेकर्ड फेला परेन।
sl: Neveljavna GEDCOM datoteka - ne najdem zapisa z glavo.

source: Romanized
cy: Rhufeinig
hy: Ռոմանացված
ko: 로마자
ne: रोमनाइज्ड
sl: Romanizirano

source: Hebrew
cy: Hebraeg
hy: եբրայերեն
ko: 유대인
ne: हिब्रु
sl: Hebrejščina

source: Associate events with this source
cy: Cysylltu digwyddiadau â'r ffynhonnell hon
hy: Իրադարձությունները կապեք այս աղբյուրի հետ
ko: 이 출처와 관련 된 이벤트
ne: यस स्रोतसँग घटनाहरू सम्बद्ध गर्नुहोस्
sl: Poveži dogodke s tem virom

source: Pending changes
cy: Cynigion newydd
hy: Սպասվող փոփոխություններ
ko: 보류 중인 변경 사항
ne: विचाराधीन परिवर्तनहरू
sl: Čakajoče spremembe

source: Restrict to immediate family
cy: Cyfyngu i'r teulu agos
hy: Սահմանափակել անմիջական ընտանիքով
ko: 직계 가족에게 제한합니다
ne: तत्काल परिवारमा सीमित गर्नुहोस्
sl: Omeji na ožjo družino

source: Help
cy: Cymorth
hy: Օգնություն
ko: 도움말
ne: मद्दत
sl: Pomoč

source: The help text has not been written for this item.
cy: Nid yw'r testun cymorth wedi'i ysgrifennu ar gyfer yr eitem hon.
hy: Օգնության տեքստը չի գրվել այս տարրի համար:
ko: 이 항목에 대한 도움말 텍스트가 작성되지 않았습니다.
ne: यस वस्तुको लागि मद्दत पाठ लेखिएको छैन।
sl: Besedilo pomoči za ta element še ni napisano.

source: No GEDCOM file was received.
cy: Heb dderbyn ffeil GEDCOM.
hy: GEDCOM ֆայլ չի ստացվել:
ko: GEDCOM 파일이 수신되지 않았습니다.
ne: कुनै GEDCOM फाइल प्राप्त भएन।
sl: Ni prejete datoteke GEDCOM.

source: Import a GEDCOM file
cy: Mewnforio ffeil GEDCOM
hy: Ներմուծեք GEDCOM ֆայլ
ko: GEDCOM 파일 가져오기
ne: GEDCOM फाइल ल्याउनुहोस्
sl: Uvoz datoteke GEDCOM

# Male
source: (aged %s)
cy: (yn %s oed)
hy: (%s տարեկան)
ko: (나이 %s)
ne: (उमेर %s)
sl: (star %s)

# Female
source: (aged %s)
cy: (yn %s oed)
hy: (%s տարեկան)
ko: (나이 %s)
ne: (उमेर %s)
sl: (stara %s)

source: (aged %s)
cy: (yn %s oed)
hy: (%s տարեկան)
ko: (나이 %s)
ne: (उमेर %s)
sl: (starost %s)

source: (age %s)
cy: (oed %s)
hy: (տարիքը %s)
ko: (나이 %s)
ne: (उमेर %s)
sl: (starost %s)

source: Spouse
cy: Priod
hy: Ամուսին
ko: 배우자
ne: पति/पत्नि
sl: Zakonec

source: Link this individual to an existing family as a child
cy: Cysylltu yr unigolyn hwn â theulu sy'n bodoli eisoes fel plentyn
hy: Կապեք այս անհատին գոյություն ունեցող ընտանիքի հետ որպես երեխա
ko: 이 인물을 기존 가족에 자녀로 연결
ne: यो व्यक्तिलाई बच्चाको रूपमा अवस्थित परिवारसँग लिङ्क गर्नुहोस्
sl: Poveži to osebo z obstoječo družino kot otroka

source: Add a husband using an existing individual
cy: Ychwanegu gŵr gan ddefnyddio unigolyn sy'n bodoli eisoes
hy: Ավելացրեք ամուսին՝ օգտագործելով գոյություն ունեցող անհատը
ko: 기존 인물 데이터베이스 자료를 사용하여 남편 추가
ne: उहाँको श्रीमान् थप्नुहोस्
sl: Dodaj moža izmed obstoječih oseb

source: Add a wife using an existing individual
cy: Ychwanegu g wraig gan ddefnyddio unigolyn sy'n bodoli eisoes
hy: Ավելացրեք կին՝ օգտագործելով գոյություն ունեցող անհատը
ko: 기존 인물 데이터베이스 자료를 사용하여 부인 추가
ne: अवस्थित व्यक्ति प्रयोग गरेर पत्नी थप्नुहोस्
sl: Dodaj ženo izmed obstoječih oseb

source: A new version of webtrees is available.
cy: Mae fersiwn newydd o webtrees ar gael.
hy: Հասանելի է վեբ ծառերի նոր տարբերակը:
ko: 새로운 버전의 Webtrees를 사용할 수 있습니다.
ne: वेबट्रिजको नयाँ संस्करण उपलब्ध छ ।
sl: Na voljo je nova različica webtrees.

source: Upgrade to webtrees %s.
cy: Uwchraddio i webtrees %s.
hy: Թարմացրեք վեբ ծառերի %s:
ko: %s Webtrees로 업그레이드하십시오.
ne: वेबट्री %s मा अपग्रेड गर्नुहोस्।
sl: Posodobi na webtrees %s.

source: You cannot sign in because your browser does not accept cookies.
cy: Nid oes modd i chi fewngofnodi oherwydd nad yw'ch porwr yn derbyn cwcis.
hy: Դուք չեք կարող մուտք գործել, քանի որ ձեր դիտարկիչը չի ընդունում թխուկները:
ko: 브라우저가 쿠키를 허용하지 않기 때문에 로그인 할 수 없습니다.
ne: तपाइँ साइन इन गर्न सक्नुहुन्न किनभने तपाइँको ब्राउजरले कुकीहरू स्वीकार गर्दैन।
sl: Ne morete se prijaviti, ker vaš brskalnik ne sprejema piškotkov.

source: The username or password is incorrect.
cy: Mae'r enw defnyddiwr neu'r cyfrinair yn anghywir.
hy: Օգտվողի անունը կամ գաղտնաբառը սխալ է:
ko: 사용자 이름 또는 비밀번호가 올바르지 않습니다.
ne: प्रयोगकर्ता नाम वा पासवर्ड गलत छ।
sl: Uporabniško ime ali geslo ni pravilno.
