Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Seattle, Washington, United States
cy: Seattle, Washington, Unol Daleithiau
hy: Սիեթլ, Վաշինգտոն, Ամերիկայի Միացյալ Նահանգներ
ne: Seattle, वासिङ्गटन, संयुक्त राज्य अमेरिका
sl: Seattle, Washington, Združene države Amerike

source: Seoul, Korea
hy: Սեուլ, Կորեա
ne: सोल, कोरिया
sl: Seoul, Koreja

source: St. George, Utah, United States
cy: San Siôr, Utah, Unol Daleithiau
hy: Սուրբ Ջորջ, Յուտա, Միացյալ Նահանգներ
ne: सेन्ट जर्ज, युटा, संयुक्त राज्य अमेरिका
sl: St. George, Utah, Združene države Amerike

source: San José, Costa Rica
hy: Սան Խոսե, Կոստա Ռիկա
ne: सान जोस, कोस्टारिका

source: Salt Lake City, Utah, United States
cy: Salt Lake City, Utah, Unol Daleithiau
hy: Սոլթ Լեյք Սիթի, Յուտա, Միացյալ Նահանգներ
ne: Salt Lake City, Utah, संयुक्त राज्य अमेरिका
sl: Salt Lake City, Utah, Združene države Amerike

source: St. Louis, Missouri, United States
cy: St Louis, Missouri, Unol Daleithiau
hy: Սենթ Լուիս, Միսսուրի, Միացյալ Նահանգներ
ne: सेन्ट लुइस, मिसौरी, संयुक्त राज्य अमेरिका
sl: St. Louis, Missouri, Združene države Amerike

source: Snowflake, Arizona, United States
cy: Pluen eira, Arizona, Unol Daleithiau
hy: Snowflake, Արիզոնա, Ամերիկայի Միացյալ Նահանգներ
ne: Snowflake, एरिजोना, संयुक्त राज्य अमेरिका
sl: Snowflake, Arizona, Združene države Amerike

source: São Paulo, Brazil
hy: Սան Պաուլո, Բրազիլիա
ne: साओ पाउलो, ब्राजिल

source: St. Paul, Minnesota, United States
cy: St Paul, Minnesota, Unol Daleithiau
hy: Սենտ Փոլ, Մինեսոտա, Ամերիկայի Միացյալ Նահանգներ
ne: St. Paul, मिनिसोटा, संयुक्त राज्य अमेरिका
sl: St. Paul, Minnesota, Združene države Amerike

source: Spokane, Washington, United States
cy: Spokane, Washington, Unol Daleithiau
hy: Spokane, Վաշինգտոն, Ամերիկայի Միացյալ Նահանգներ
ne: Spokane, वासिङ्गटन, संयुक्त राज्य अमेरिका
sl: Spokane, Washington, Združene države Amerike

source: Stockholm, Sweden
hy: Ստոկհոլմ, Շվեդիա
ne: स्टकहोम, स्वीडेन
sl: Stockholm, Švedska

source: Suva, Fiji
hy: Սուվա, Ֆիջի
ne: सुवा, फिजी
sl: Suva, Fidži

source: Bern, Switzerland
cy: Bern, y Swistir
hy: Բեռն, Շվեյցարիա
ne: बर्न, स्वीट्जरल्याण्ड
sl: Bern, Švica

source: Sydney, Australia
cy: Sydney, Awstralia
hy: Սիդնեյ, Ավստրալիա
ne: सिड्नी, अष्ट्रेलिया
sl: Sydney, Avstralija

source: Taipei, Taiwan
hy: Թայփեյ, Թայվան
ne: ताइपेइ, ताइवान
sl: Taipei, Tajvan

source: Tampico, Mexico
cy: Tampico, Mecsico
hy: Տամպիկո, Մեքսիկա
ne: Tampico, मेक्सिको
sl: Tampico, Mehika

source: Tegucigalpa, Honduras
hy: Տեգուսիգալպա, Հոնդուրաս
ne: टेगुसिगाल्पा, होन्डुरस

source: Tuxtla Gutiérrez, Mexico
hy: Tuxtla Gutiérrez, Մեքսիկա
ne: Tuxtla Gutiérrez, मेक्सिको

source: Tijuana, Mexico
cy: Tijuana, Mecsico
hy: Տիխուանա, Մեքսիկա
ne: तिजुआना, मेक्सिको
sl: Tijuana, Mehika

source: Tokyo, Japan
hy: Տոկիո, Ճապոնիա
ne: टोकियो, जापान
sl: Tokyo, Japonska

source: Toronto, Ontario, Canada
hy: Տորոնտո, Օնտարիո, Կանադա
ne: टोरन्टो, ओन्टारियो, क्यानाडा
sl: Toronto, Ontario, Kanada

source: Trujillo, Peru
cy: Trujillo, Periw
hy: Տրուխիլյո, Պերու
ne: ट्रुजिलो, पेरु

source: Twin Falls, Idaho, United States
cy: Twin Falls, Idaho, Unol Daleithiau
hy: Twin Falls, Այդահո, Ամերիկայի Միացյալ Նահանգներ
ne: Twin Falls, Idaho, संयुक्त राज्य अमेरिका
sl: Twin Falls, Idaho, Združene države Amerike

source: Vancouver, British Columbia, Canada
hy: Վանկուվեր, Բրիտանական Կոլումբիա, Կանադա
ne: Vancouver, ब्रिटिश कोलम्बिया, क्यानाडा
sl: Vancouver, Britanska Kolumbija, Kanada

source: Veracruz, Mexico
cy: Veracruz, Mecsico
hy: Վերակրուս, Մեքսիկա
ne: भेराक्रुज, मेक्सिको
sl: Veracruz, Mehika

source: Vernal, Utah, United States
cy: Vernal, Utah, Unol Daleithiau
hy: Vernal, Յուտա, Ամերիկայի Միացյալ Նահանգներ
ne: Vernal, युटा, संयुक्त राज्य अमेरिका
sl: Vernal, Utah, Združene države Amerike

source: Villa Hermosa, Mexico
cy: Villa Hermosa, Mecsico
hy: Villa Hermosa, Մեքսիկա
ne: विला हर्मोसा, मेक्सिको
sl: Villa Hermosa, Mehika

source: Washington, District of Columbia, United States
cy: Washington, Rhanbarth Columbia, Unol Daleithiau
hy: Վաշինգտոն, Կոլումբիայի շրջան, Միացյալ Նահանգներ
ne: वासिङटन, डीसी
sl: Washington, District of Columbia, Združene države Amerike

source: Winter Quarters, Nebraska, United States
cy: Chwarteri Gaeaf, Nebraska, Unol Daleithiau
hy: Winter Quarters, Նեբրասկա, Ամերիկայի Միացյալ Նահանգներ
ne: शीतकालीन क्वार्टर, नेब्रास्का, संयुक्त राज्य अमेरिका
sl: Winter Quarters, Nebraska, Združene države Amerike

source: No temple - living ordinance
cy: Dim teml - ordinhad fyw
hy: Ոչ մի տաճար՝ կենդանի արարողություն
ko: 성전 없음 - 생활 의식
ne: कुनै मन्दिर - जीवित अध्यादेश
sl: Ni cerkve - verskih obredov

source: Unrecognized GEDCOM code
cy: Cod GEDCOM heb ei adnabod
hy: Չճանաչված GEDCOM կոդը
ko: 인식 할 수없는 GEDCOM 코드
ne: अपरिचित GEDCOM कोड
sl: Neznana koda GEDCOM

source: Create a location
cy: Creu lleoliad
hy: Ստեղծեք տեղադրություն
ko: 위치 만들기
ne: स्थान सिर्जना गर्नुहोस्
sl: Ustvari lokacijo

source: Create a media object
cy: Creu gwrthrych cyfryngau
hy: Ստեղծեք մեդիա օբյեկտ
ko: 미디어 개체 작성
ne: मिडिया वस्तु सिर्जना गर्नुहोस्
sl: Ustvari medijski predmet

source: Create a shared note
cy: Creu nodyn i'w rannu
hy: Ստեղծեք ընդհանուր նշում
ko: 공유 노트 만들기
ne: साझा नोट सिर्जना गर्नुहोस्
sl: Ustvari deljeno opombo

source: Create a repository
cy: Creu storfan
hy: Ստեղծեք պահեստ
ko: 저장소 작성
ne: एउटा भण्डार सिर्जना गर्नुहोस्
sl: Ustvari skladišče

source: Create a source
cy: Creu ffynhonnell
hy: Ստեղծեք աղբյուր
ko: 출처 작성
ne: स्रोत सिर्जना गर्नुहोस्
sl: Ustvari vir

source: Create a submission
cy: Creu cyflwyniad
hy: Ստեղծեք ներկայացում
ko: 제출물 만들기
ne: सबमिशन सिर्जना गर्नुहोस्
sl: Ustvari pošiljko

source: Create a submitter
cy: Creu cyflwynydd
hy: Ստեղծեք ներկայացնող
ko: 제출자 만들기
ne: पेशकर्ता सिर्जना गर्नुहोस्
sl: Ustvari pošiljatelja

source: No file was received. Please try again.
cy: Heb dderbyn ffeil. Ceisiwch eto.
hy: Ոչ մի ֆայլ չի ստացվել: Խնդրում ենք կրկին փորձել:
ko: 파일이 수신되지 않았습니다. 다시 시도해 주세요.
ne: कुनै फाइल प्राप्त भएको छैन। फेरि प्रयास गर्नुहोस।
sl: Ni prejete datoteke. Ponovno jo naložite.

source: File successfully uploaded
cy: Llwythwyd y ffeil yn llwyddiannus
hy: Ֆայլը հաջողությամբ վերբեռնվեց
ko: 파일이 성공적으로 업로드되었습니다
ne: फाइल सफलतापूर्वक अपलोड गरियो
sl: Datoteka uspešno naložena

source: The uploaded file exceeds the allowed size.
cy: Mae'r ffeil a lwythwyd i fyny'n fwy na'r maint sy'n cael ei ganiatáu.
hy: Վերբեռնված ֆայլը գերազանցում է թույլատրելի չափը:
ko: 업로드 된 파일이 허용 된 크기를 초과합니다.
ne: अपलोड गरिएको फाइलले अनुमति दिएको साइज नाघ्यो।
sl: Naložena datoteka presega dovoljeno velikost.

source: The file was only partially uploaded. Please try again.
cy: Dim ond yn rhannol y mae'r ffeil wedi'i llwytho. Rhowch gynnig arall arni.
hy: Ֆայլը միայն մասամբ է վերբեռնվել: Խնդրում ենք կրկին փորձել:
ko: 파일이 부분적으로 만 업로드되었습니다. 다시 시도하십시오.
ne: फाइल आंशिक रूपमा मात्र अपलोड गरिएको थियो। फेरि प्रयास गर्नुहोस।
sl: Datoteka je naložena le delno. Prosimo, poskusite ponovno.

source: The PHP temporary folder is missing.
cy: Mae ffolder dros dro PHP ar goll.
hy: PHP-ի ժամանակավոր թղթապանակը բացակայում է:
ko: PHP 임시 폴더가 없습니다.
ne: PHP अस्थायी फोल्डर हराइरहेको छ।
sl: Manjka začasna mapa za PHP.

source: PHP failed to write to disk.
cy: Methodd PHP ag ysgrifennu ar ddisg.
hy: PHP-ին չհաջողվեց գրել սկավառակի վրա:
ko: PHP가 디스크에 쓰지 못했습니다.
ne: PHP डिस्कमा लेख्न असफल भयो।
sl: PHP ne more pisati na disk.

source: PHP blocked the file because of its extension.
cy: Rhwystrodd PHP y ffeil oherwydd ei estyniad.
hy: PHP-ն արգելափակել է ֆայլը՝ դրա ընդլայնման պատճառով:
ko: PHP는 확장자로 인해 파일을 차단했습니다.
ne: PHP ले यसको विस्तारको कारण फाइल ब्लक गर्यो।
sl: PHP je zavrnil datoteko zaradi končnice.

source: Invalid GEDCOM record
cy: Cofnod GEDCOM annilys
hy: Անվավեր GEDCOM գրառում
ko: 잘못된 GEDCOM 레코드
ne: अमान्य GEDCOM रेकर्ड
sl: Neveljaven GEDCOM zapis

source: Error: converting GEDCOM files from %s encoding to UTF-8 encoding not currently supported.
cy: Gwall: nid yw trosi ffeiliau GEDCOM o amgodio %s i amgodio UTF-8 yn cael ei gefnogi ar hyn o bryd.
hy: Սխալ. GEDCOM ֆայլերի փոխակերպումը %s կոդավորումից UTF-8 կոդավորման ներկայումս չի աջակցվում:
ko: 오류: GEDCOM 파일을 %s 인코딩에서 UTF-8 인코딩으로 변환하는 것은 현재 지원되지 않습니다.
ne: Error: GEDCOM फाइलहरूलाई %s इन्कोडिङबाट UTF-8 इन्कोडिङमा रूपान्तरण गर्ने हाल समर्थित छैन।
sl: Napaka: Pretvorba datotek GEDCOM iz kodiranja %s v kodiranje UTF-8 trenutno ni podprta.

source: Gregorian
cy: Gregoraidd
hy: Գրիգորյանը
ko: 그레고리안
ne: जर्जियाली
sl: Gregorjanski

source: Julian
cy: Juliaidd
hy: Ջուլիան
ne: जुलियन
sl: Julijanski

source: French
cy: Ffrengig
hy: ֆրանսերեն
ne: फ्रान्सेली
sl: Francoski

source: Jewish
cy: Iddewig
hy: հրեական
ko: 유대인
ne: यहुदी
sl: Judovski

source: Hijri
hy: հիջրի
ne: हिज्रि
sl: Hidžretski

source: Jalali
hy: Ջալալի
ne: जालली
sl: Džalali

source: Husband
cy: Gŵr
hy: Ամուսին
ko: 남편
ne: श्रीमान्
sl: Mož

source: Husband’s age
cy: Oed gŵr
hy: Ամուսնու տարիքը
ko: 남편의 나이
ne: श्रीमानको उमेर
sl: Starost moža

source: Wife
cy: Gwraig
hy: Կին
ko: 부인
ne: पत्नी
sl: Žena

source: Wife’s age
cy: Oed y wraig
hy: Կնոջ տարիքը
ko: 부인의 나이
ne: श्रीमतीको उमेर
sl: Starost žene

source: Annulment
cy: Dirymiad
hy: Չեղյալ հայտարարում
ko: 결혼무효선언(혼인신고를 무효화)
ne: खारेज
sl: Razveljavitev

source: Family census
cy: Cyfrifiad teulu
hy: Ընտանեկան մարդահամար
ko: 가족 인구조사
ne: पारिवारिक जनगणना
sl: Družinski popis

source: Child
cy: Plentyn
hy: Երեխա
ko: 자녀
ne: शाखा
sl: Otrok

source: Divorce
cy: Ysgariad
hy: Ամուսնալուծություն
ko: 이혼
ne: सम्बन्धविच्छेद
sl: Ločitev

source: Date of divorce
cy: Dyddiad ysgariad
hy: Ամուսնալուծության ամսաթիվը
ko: 이혼 날짜
ne: सम्बन्धविच्छेदको मिति
sl: Datum ločitve

source: Divorce filed
cy: Cais am ysgariad
hy: Ամուսնալուծություն է ներկայացվել
ko: 이혼 필드
ne: सम्बन्धविच्छेद दर्ता गराइयो
sl: Zahtevana ločitev

source: Engagement
cy: Dyweddïo
hy: Նշանադրություն
ko: 약혼
ne: संलग्नता
sl: Zaroka

source: Date of engagement
cy: Dyddiad y dyweddïo
hy: Նշանադրության ամսաթիվը
ko: 약혼 날짜
ne: संलग्नता मिति
sl: Datum zaroke

source: Place of engagement
cy: Man y dyweddïo
hy: Նշանադրության վայրը
ko: 약혼 장소
ne: संलग्नताको स्थान
sl: Kraj zaroke

source: Marriage banns
cy: Cyhoeddiad priodas
hy: Ամուսնության արգելքները
ko: 결혼예고(가톨릭교회법)
ne: विवाह प्रतिबन्ध
sl: Prepovedi poroke

source: Date of marriage banns
cy: Dyddiad y cyhoeddiad priodas
hy: Ամուսնության արգելքի ամսաթիվը
ko: 결혼예고(가톨릭교회법) 날짜
ne: विवाह प्रतिबन्धको मिति
sl: Datum prepovedi poroke

source: Place of marriage banns
cy: Man y cyhoeddiad priodas
hy: Ամուսնության արգելքների վայրը
ko: 결혼예고(가톨릭교회법) 장소
ne: विवाह प्रतिबन्धित स्थान
sl: Kraj prepovedi poroke

source: Marriage contract
cy: Contract priodas
hy: Ամուսնության պայմանագիր
ko: 계약 결혼 (혼인 전 계약서 작성)
ne: विवाह सम्झौता
sl: Poročna pogodba

source: Marriage license
cy: Trwydded briodas
hy: Ամուսնության լիցենզիա
ko: 혼인신고
ne: विवाह लाइसेन्स
sl: Dovoljenje za poroko

source: Date of marriage
cy: Dyddiad y briodas
hy: Ամուսնության ամսաթիվը
ko: 결혼 날짜
ne: विवाह मिति
sl: Datum poroke

source: Place of marriage
cy: Man priodas
hy: Ամուսնության վայրը
ko: 결혼 장소
ne: विवाह गर्ने ठाउँ
sl: Kraj poroke

source: Type of marriage
cy: Math o briodas
hy: Ամուսնության տեսակը
ko: 결혼 유형
ne: विवाहको प्रकार
sl: Vrsta poroke

source: Marriage settlement
cy: Setliad priodas
hy: Ամուսնության կարգավորում
ko: 계약결혼(법적 책임이 있는 혼전계약서 작성 후 결혼)
ne: विवाह सम्झौता
sl: Poročna poravnava

source: Number of children
cy: Nifer y plant
hy: Երեխաների թիվը
ko: 자녀의 수
ne: बालबालिकाको संख्या
sl: Število otrok

source: Type of reference number
cy: Math o gyfeirnod
hy: Հղման համարի տեսակը
ko: 참조 번호의 유형
ne: सन्दर्भ संख्याको प्रकार
sl: Vrsta referenčne številke

source: LDS spouse sealing
cy: Selio priod LDS
hy: LDS ամուսնու կնքումը
ko: 후기 성도 교회 배우자 인봉
ne: LDS दम्पत्ति सीलिङ
sl: Pečatenje zakoncev LDS

source: Date of LDS spouse sealing
cy: Dyddiad selio priod LDS
hy: LDS ամուսինների կնքման ամսաթիվը
ne: LDS पति वा पत्नी सील को मिति
sl: Datum pečatenja zakoncev LDS

source: Place of LDS spouse sealing
cy: Lle selio priod LDS
hy: LDS ամուսնու կնքման վայրը
ne: LDS जीवनसाथी सीलिङ गर्ने ठाउँ
sl: Kraj pečatenja zakoncev LDS

source: Status change date
cy: Dyddiad newid statws
hy: Կարգավիճակի փոփոխության ամսաթիվը
ko: 날짜 변경 상태
ne: स्थिति परिवर्तन मिति
sl: Sprememba datuma stanja

source: Submitter
cy: Cyflwynydd
hy: Ներկայացնող
ko: 제출자
ne: पेस गर्ने
sl: Pošiljatelj

source: Header
cy: Pennyn
hy: Վերնագիր
ne: हेडर
sl: Glava

source: Character set
cy: Set nod
hy: Նիշերի հավաքածու
ko: 문자셋
ne: क्यारेक्टर सेट
sl: Nabor znakov

source: Copyright
cy: Hawlfraint
hy: Հեղինակային իրավունք
ne: प्रतिलिपि अधिकार
sl: Avtorske pravice

source: Filename
cy: Enw ffeil
hy: Ֆայլի անունը
ko: 파일이름
ne: फाइलनाम
sl: Ime datoteke

source: Place hierarchy
cy: Hierarchaeth lleoedd
hy: Տեղերի հիերարխիա
ko: 기록 된 장소
ne: स्थानको आधारमा
sl: Hierarhija krajev

source: Application ID
hy: Դիմումի ID
ne: आवेदन आईडी

source: Corporation
cy: Corfforaeth
hy: կորպորացիա
ko: 법인
ne: संघ
sl: Korporacija

source: Application name
hy: Դիմումի անվանումը
ne: आवेदन नाम

source: Submission
cy: Cyflwyniad
hy: Ներկայացում
ko: 제출
ne: सबमिशन
sl: Pošiljka

source: Age
cy: Oed
hy: Տարիքը
ko: 나이
ne: उमेर
sl: Starost

source: Adoption
cy: Mabwysiadu
hy: Որդեգրում
ko: 양자
ne: ग्रहण
sl: Posvojitev

source: Date of adoption
cy: Dyddiad mabwysiadu
hy: Ընդունման ամսաթիվը
ko: 입양 날짜
ne: ग्रहण मिति
sl: Datum posvojitve

source: Adoptive parents
cy: Rhieni mabwysiadol
hy: Որդեգրող ծնողներ
ko: 양부모
ne: ग्रहण गरिएका आमाबुवा
sl: Posvojitelji

source: Place of adoption
cy: Man mabwysiadu
hy: Որդեգրման վայրը
ko: 입양 장소
ne: ग्रहण गर्ने ठाउँ
sl: Kraj posvojitve

source: Ancestral file number
cy: Rhif ffeil hynafiaid
hy: Նախնիների ֆայլի համարը
ko: 조상 파일 번호
ne: पुर्खाको फाइल नम्बर
sl: Številka datoteke prednika

source: Alias
cy: Enw Arall
hy: Այլանուն
ko: 동일인일 수 있는 사람
ne: उपनाम
sl: Vzdevek

source: Ancestors interest
cy: Diddordeb hynafiaid
hy: Նախնիների հետաքրքրությունը
ko: 관심 있는 조상
ne: पुर्खाहरूको रूचि
sl: Raziskovanje prednikov

source: LDS baptism
cy: Bedydd LDS
hy: LDS մկրտություն
ko: 후기 성도 교회 침례
ne: LDS बप्तिस्मा
sl: Krst LDS

source: Date of LDS baptism
cy: Dyddiad bedydd LDS
hy: LDS մկրտության ամսաթիվը
ko: 후기 성도 교회 침례 날짜
ne: LDS बप्तिस्मा को मिति
sl: Datum krsta LDS

source: Place of LDS baptism
cy: Lle bedydd LDS
hy: LDS մկրտության վայրը
ne: LDS बप्तिस्मा को स्थान
sl: Kraj krsta LDS

source: Baptism
cy: Bedydd
hy: Մկրտություն
ko: 침례
ne: बप्तिस्मा
sl: Krst

source: Date of baptism
cy: Dyddiad y bedydd
hy: Մկրտության ամսաթիվը
ko: 침례 날짜
ne: बप्तिस्मा को मिति
sl: Datum krsta

source: Place of baptism
cy: Man y bedydd
hy: Մկրտության վայրը
ko: 침례 장소
ne: बप्तिस्मा गर्ने ठाउँ
sl: Kraj krsta

source: Bar mitzvah
hy: Բար միցվա
ne: बार mitzvah

source: Date of bar mitzvah
cy: Dyddiad y bar mitzvah
hy: Բար միցվայի ամսաթիվը
ne: बार mitzvah को मिति
sl: Datum bar mitzvah

source: Place of bar mitzvah
cy: Man y bar mitzvah
hy: Բար միցվայի տեղը
ne: बार mitzvah को स्थान
sl: Kraj bar mitzvah

source: Bat mitzvah
hy: Բաթ միցվա
ne: ब्याट मिट्ज्वा

source: Date of bat mitzvah
cy: Dyddiad y bat mitzvah
hy: Չղջիկ միցվայի ամսաթիվը
ne: ब्याट mitzvah को मिति
sl: Datum bat mitzvah

source: Place of bat mitzvah
cy: Man y bat mitzvah
hy: Չղջիկ միցվայի ամսաթիվը
ne: ब्याट mitzvah को स्थान
sl: Kraj bat mitzvah

source: Birth
cy: Genedigaeth
hy: Ծնունդ
ko: 출생
ne: जन्म
sl: Rojstvo

source: Date of birth
cy: Dyddiad geni
hy: Ծննդյան ամսաթիվ
ko: 출생 날짜
ne: जन्म मिति
sl: Datum rojstva

source: Birth parents
cy: Rhieni biolegol
hy: Ծննդյան ծնողներ
ko: 부모님의 출생
ne: बुवाआमाको जन्म
sl: Biološki starši

source: Place of birth
cy: Man geni
hy: Ծննդավայր
ko: 출생 장소
ne: जन्मस्थान
sl: Kraj rojstva

source: Blessing
cy: Bendith
hy: Օրհնություն
ko: 축복
ne: आशिर्वाद
sl: Blagoslov

source: Date of blessing
cy: Dyddiad y fendith
hy: Օրհնության ամսաթիվ
ko: 축복 날짜
ne: आशीर्वाद दिन
sl: Datum blagoslova

source: Place of blessing
cy: Man y fendith
hy: Օրհնության վայր
ko: 축복 장소
ne: आशीर्वाद दिने ठाउँ
sl: Kraj blagoslova

source: Burial
cy: Claddu
hy: Հուղարկավորություն
ko: 매장
ne: दाहसंस्कार
sl: Pokop

source: Date of burial
cy: Dyddiad claddu
hy: Թաղման ամսաթիվը
ko: 매장 날짜
ne: दाहसंस्कार मिति
sl: Datum pokopa

source: Place of burial
cy: Man claddu
hy: Թաղման վայրը
ko: 매장 장소
ne: दाहसंस्कार गर्ने ठाउँ
sl: Kraj pokopa

source: Caste
cy: Cast
hy: Կաստա
ko: 카스트
ne: जाति
sl: Kasta

source: Census
cy: Cyfrifiad
hy: մարդահամար
ko: 인구조사
ne: जनगणना
sl: Popis prebivalstva

source: Census date
cy: Dyddiad y cyfrifiad
hy: Մարդահամարի ամսաթիվը
ko: 인구조사 날짜
ne: जनगणना मिति
sl: Datum popisa

source: Census place
cy: Man y cyfrifiad
hy: Մարդահամարի վայր
ko: 인구조사 장소
ne: जनगणना स्थान
sl: Kraj popisa

source: Christening
cy: Bedydd
hy: Մկրտություն
ko: 세례식
ne: नामकरण
sl: Krst (imenovanje)

source: Date of christening
cy: Dyddiad y bedydd
hy: Մկրտության ամսաթիվը
ko: 세례식 날짜
ne: नामकरण मिति
sl: Datum krsta (imenovanja)

source: Place of christening
cy: Man y bedydd
hy: Մկրտության վայրը
ko: 세례식 장소
ne: नामकरण गर्ने ठाउँ
sl: Kraj krsta (imenovanja)

source: Adult christening
cy: Bedydd oedolion
hy: Մեծահասակների մկրտություն
ko: 성인 세례식
ne: वयस्क नामकरण
sl: Krst odraslih

source: Confirmation
cy: Cadarnhad
hy: Հաստատում
ko: 견진성사
ne: स्वीकृति
sl: Potrditev (birma)

source: Date of confirmation
cy: Dyddiad bedydd esgob
hy: Հաստատման ամսաթիվը
ko: 견진성사 날짜
ne: पुष्टि मिति
sl: Datum potrditve (birma)

source: Place of confirmation
cy: Man y bedydd esgob
hy: Հաստատման վայրը
ko: 견진성사 장소
ne: पुष्टि गर्ने ठाउँ
sl: Kraj potrditve (birma)

source: LDS confirmation
cy: Cadarnhad LDS
hy: LDS հաստատում
ko: 후기 성도 교회 검증
ne: LDS पुष्टिकरण
sl: Potrditev LDS

source: Date of LDS confirmation
cy: Dyddiad cadarnhau LDS
hy: LDS-ի հաստատման ամսաթիվը
ne: LDS पुष्टि मिति
sl: Datum potrditve LDS

source: Place of LDS confirmation
cy: Man y cadarnhad LDS
hy: LDS հաստատման վայրը
ne: LDS पुष्टि स्थान
sl: Kraj potrditve LDS

source: Cremation
cy: Amlosgiad
hy: Դիակիզում
ko: 화장
ne: दाहसंस्कार
sl: Upepelitev

source: Date of cremation
cy: Dyddiad yr amlosgi
hy: Դիակիզման ամսաթիվը
ko: 화장 날짜
ne: दाहसंस्कार मिति
sl: Datum upepelitve

source: Place of cremation
cy: Man yr amlosgi
hy: Դիակիզման վայրը
ko: 화장 장소
ne: दाहसंस्कार गर्ने ठाउँ
sl: Kraj upepelitve

source: Death
cy: Marwolaeth
hy: Մահ
ko: 사망
ne: मृत्यु
sl: Smrt

source: Date of death
cy: Dyddiad marwolaeth
hy: Մահվան ամսաթիվը
ko: 사망 날짜
ne: मृत्यु मिति
sl: Datum smrti

source: Place of death
cy: Man y farwolaeth
hy: Մահվան վայրը
ko: 사망 장소
ne: मृत्यु स्थान
sl: Kraj smrti

source: Descendants interest
cy: Diddordeb disgynyddion
hy: Հետնորդների հետաքրքրությունը
ko: 관심 있는 후손
ne: वंशजको चासो
sl: Raziskovanje potomcev

source: Education
cy: Addysg
hy: Կրթություն
ko: 교육
ne: शिक्षा
sl: Izobrazba

source: School or college
cy: Ysgol neu goleg
hy: Դպրոց կամ քոլեջ
ko: 학교 또는 대학
ne: स्कूल वा कलेज
sl: Šola ali fakulteta

source: Emigration
cy: Ymfudo
hy: Արտագաղթ
ko: 타국으로 이민
ne: आप्रवासन
sl: Izselitev

source: Date of emigration
cy: Dyddiad yr ymfudo
hy: Արտագաղթի ամսաթիվը
ko: 이민 간 날짜
ne: प्रवासको मिति
sl: Datum izselitve

source: Place of emigration
cy: Man yr ymfudo
hy: Արտագաղթի վայրը
ko: 이민 간 장소
ne: बसाइ सरेको ठाउँ
sl: Kraj izselitve

source: LDS endowment
cy: Gwaddol LDS
hy: LDS օժտում
ko: 후기 성도 교회 기부
ne: LDS अनुदान
sl: Obdaritev LDS

source: Date of LDS endowment
cy: Dyddiad gwaddoli LDS
hy: LDS նվիրատվության ամսաթիվը
ne: LDS निधिको मिति
sl: Datum obdaritve LDS

source: Place of LDS endowment
cy: Lle y gwaddol LDS
hy: LDS նվիրատվության վայրը
ne: LDS अनुदान को स्थान
sl: Kraj obdaritve LDS

source: Family as a child
cy: Teulu fel plentyn
hy: Ընտանիքը որպես երեխա
ko: 어린 시절 가족
ne: बच्चाको रूपमा परिवार
sl: Družina, kot otrok

source: Relationship to parents
cy: Perthynas i'r rhieni
hy: Հարաբերություններ ծնողների հետ
ko: 부모님과 관계
ne: आमाबुवासँगको सम्बन्ध
sl: Sorodstveno razmerje do staršev

source: Family as a spouse
cy: Teulu fel priod
hy: Ընտանիքը որպես ամուսին
ko: 배우자의 가족
ne: जीवनसाथीको रूपमा परिवार
sl: Družina, kot zakonec

source: First communion
cy: Cymun cyntaf
hy: Առաջին հաղորդություն
ko: 첫 영성체
ne: पहिलो भेटघाट
sl: Prvo obhajilo

source: Date of first communion
cy: Dyddiad y cymun cyntaf
hy: Առաջին հաղորդության ամսաթիվը
ko: 첫 영성체 날짜
ne: पहिलो सम्वादको मिति
sl: Datum prvega obhajila

source: Place of first communion
cy: Man y cymun cyntaf
hy: Առաջին հաղորդության վայրը
ko: 첫 영성체 장소
ne: पहिलो भेटघाटको स्थान
sl: Kraj prvega obhajila

source: Graduation
cy: Graddio
hy: Ավարտական
ko: 등급 분류
ne: स्नातक
sl: Diploma

source: Identification number
cy: Rhif adnabod
hy: Նույնականացման համարը
ko: 식별 번호
ne: परिचय नम्बर
sl: Identifikacijska številka

source: Type of identification number
cy: Math o rif adnabod
hy: Նույնականացման համարի տեսակը
ko: 식별 번호 유형
ne: पहिचान नम्बरको प्रकार
sl: Vrsta identifikacijske številke

source: Immigration
cy: Mewnfudo
hy: Ներգաղթ
ko: 이민오다
ne: अध्यागमन
sl: Priselitev

source: Date of immigration
cy: Dyddiad y mewnfudo
hy: Ներգաղթի ամսաթիվը
ko: 이민 온 날짜
ne: अध्यागमन मिति
sl: Datum priselitve

source: Place of immigration
cy: Man y mewnfudo
hy: Ներգաղթի վայրը
ko: 이민 온 장소
ne: अध्यागमन स्थान
sl: Kraj priselitve

source: Name
cy: Enw
hy: Անուն
ko: 이름
ne: नाम
sl: Ime

source: Phonetic name
cy: Enw ffonetig
hy: Հնչյունական անուն
ko: 발음(소리 나는) 이름
ne: फोनेटिक नाम
sl: Fonetično ime

source: Given names
cy: Enwau cyntaf
hy: Տրված անուններ
ko: 이름
ne: दिइएका नामहरू
sl: Osebna imena

source: Nickname
cy: Llysenw
hy: Մականուն
ko: 별명
ne: उपनाम
sl: Vzdevek

source: Note on phonetic name
hy: Նշում հնչյունական անվան վրա
ne: फोनेटिक नाममा नोट गर्नुहोस्

source: Name prefix
cy: Rhagddodiad enw
hy: Անվան նախածանց
ko: 형제순번
ne: नाम उपसर्ग
sl: Predpona imena

source: Name suffix
cy: Ôl-ddodiad enw
hy: Անվան ածանց
ko: 본관
ne: नाम प्रत्यय
sl: Pripona imena

source: Surname prefix
cy: Rhagddodiad cyfenw
hy: Ազգանունի նախածանց
ko: 본관 분파
ne: थर उपसर्ग
sl: Predpona priimka

source: Surname
cy: Cyfenw
hy: Ազգանունը
ko: 가문이름
ne: थर
sl: Priimek

source: Phonetic type
cy: Math ffonetig
hy: Հնչյունական տեսակ
ko: 발음(소리 나는) 유형
ne: फोनेटिक प्रकार
sl: Fonetična vrsta

source: Romanized name
cy: Enw Rhufeinig
hy: Ռոմանացված անուն
ko: 로마자 이름
ne: रोमनाइज्ड नाम
sl: Romanizirano ime

source: Note on romanized name
hy: Ծանոթագրություն ռոմանիզացված անվան վերաբերյալ
ne: रोमनाइज्ड नाममा नोट

source: Romanized type
cy: Math Rhufeinig
hy: Ռոմանիզացված տեսակ
ko: 로마자 유형
ne: रोमनाइज्ड प्रकार
sl: Vrsta romanizacije

source: Type of name
cy: Math o enw
hy: Անվան տեսակը
ko: 이름 유형
ne: नामको प्रकार
sl: Vrsta imena

source: Nationality
cy: Cenedl
hy: Ազգություն
ko: 국적
ne: राष्ट्रियता
sl: Narodnost

source: Naturalization
cy: Naturoli
hy: Բնականացում
ko: 귀화
ne: प्राकृतिकीकरण
sl: Naturalizacija

source: Date of naturalization
cy: Dyddiad naturoli
hy: Հպատակագրման ամսաթիվը
ko: 귀화 날짜
ne: प्राकृतिकीकरण को मिति
sl: Datum naturalizacije

source: Place of naturalization
cy: Man naturoli
hy: Հպատակագրման վայրը
ko: 귀화 장소
ne: प्राकृतिकीकरण को स्थान
sl: Kraj naturalizacije

source: Number of marriages
cy: Nifer y priodasau
hy: Ամուսնությունների թիվը
ko: 결혼의 수
ne: विवाहको संख्या
sl: Število porok

source: Religious institution
cy: Sefydliad crefyddol
hy: Կրոնական հաստատություն
ko: 종교시설
ne: धार्मिक संस्था
sl: Verska ustanova

source: Date of ordination
cy: Dyddiad ordeinio
hy: Ձեռնադրության ամսաթիվը
ko: 서품(안수) 날짜
ne: समायोजन मिति
sl: Datum posvečenja

source: Place of ordination
cy: Man ordeinio
hy: Ձեռնադրության վայրը
ko: 서품(안수) 장소
ne: समन्वय गर्ने ठाउँ
sl: Kraj posvečenja

source: Probate
cy: Profiant
hy: Վճռաբեկ
ko: 유언 공증
ne: प्रोबेट
sl: Zapuščinska razsodba

source: Property
cy: Eiddo
hy: Սեփականություն
ko: 재산
ne: गुण
sl: Posest

source: Date of residence
cy: Dyddiad preswylio
hy: Բնակության ամսաթիվը
ko: 거주 날짜
ne: बस्ने मिति
sl: Datum bivanja

source: Place of residence
cy: Man preswylio
hy: Բնակության վայրը
ko: 거주 장소
ne: बसोबास स्थल
sl: Kraj bivanja

source: Retirement
cy: Ymddeoliad
hy: Թոշակի անցնելը
ko: 퇴직
ne: सेवानिवृत्ति
sl: Upokojitev

source: Record file number
cy: Cofnodi rhif ffeil
hy: Գրանցեք ֆայլի համարը
ko: 레코드 파일 번호
ne: फाइल नम्बर रेकर्ड गर्नुहोस्
sl: Številka datoteke zapisa
