Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Dominican Republic
cy: Y Weriniaeth Ddominicaidd
hy: Դոմինիկյան Հանրապետություն
ne: डोमिनिकन गणराज्य
sl: Dominikanska republika

source: Algeria
hy: Ալժիր
ne: अल्जेरिया
sl: Alžirija

source: Ecuador
cy: Ecwador
hy: Էկվադոր
ne: इक्युडर
sl: Ekvador

source: Egypt
cy: Yr Aifft
hy: Եգիպտոս
ne: इजिप्ट
sl: Egipt

source: England
cy: Lloegr
hy: Անգլիա
ne: इङ्ल्यान्ड
sl: Anglija

source: Eritrea
hy: Էրիթրեա
ne: इरिट्राया
sl: Eritreja

source: Western Sahara
cy: Gorllewin Sahara
hy: Արևմտյան Սահարա
ne: पश्चिमी साहारा
sl: Zahodna Sahara

source: Spain
cy: Sbaen
hy: Իսպանիա
ne: स्पेन
sl: Španija

source: Estonia
hy: Էստոնիա
ne: इस्टोनिया
sl: Estonija

source: Ethiopia
hy: Եթովպիա
ne: इथोपिया
sl: Etiopija

source: Finland
cy: Y Ffindir
hy: Ֆինլանդիա
ne: फिनल्याण्ड
sl: Finska

source: Fiji
cy: Ffiji
hy: Ֆիջի
ne: फिजी
sl: Fidži

source: Flanders
cy: Fflandrys
hy: Ֆլանդրիա
ne: फ्ल्यान्डर्स
sl: Flandrija

source: Falkland Islands
cy: Ynysoedd y Falklands
hy: Ֆոլքլենդյան կղզիներ
ne: फकल्यान्ड द्विप
sl: Falklandski otoki (Malvini)

source: France
cy: Ffrainc
hy: Ֆրանսիա
ne: फ्रान्स
sl: Francija

source: Faroe Islands
cy: Ynysoedd Ffaro
hy: Ֆարերյան կղզիներ
ne: फेइरो द्वीप
sl: Ferski otoki

source: Micronesia
hy: Միկրոնեզիա
ne: माइक्रोनेसिया
sl: Mikronezija

source: Gabon
hy: Գաբոն
ne: गाबोन

source: United Kingdom
cy: Y Deyrnas Gyfunol
hy: Միացյալ Թագավորություն
ne: संयुक्त अधिराज्य
sl: Združeno kraljestvo

source: Georgia
hy: Վրաստան
ne: जर्जिया
sl: Gruzija

source: Guernsey
hy: Գերնսի
ne: ग्वर्नसे

source: Ghana
hy: Գանա
ne: घाना
sl: Gana

source: Gibraltar
hy: Ջիբրալթար
ne: गिब्राल्टर

source: Guinea
cy: Gini
hy: Գվինեա
ne: गुयना
sl: Gvineja

source: Guadeloupe
hy: Գվադելուպե
ne: ग्वाडेलुप
sl: Gvadelup

source: Gambia
hy: Գամբիա
ne: जाम्बिया
sl: Gambija

source: Guinea-Bissau
cy: Gini Bisaw
hy: Գվինեա-Բիսաու
ne: गुयना-बिसाउ
sl: Gvineja Bissau

source: Equatorial Guinea
cy: Gini Gyhydeddol
hy: Հասարակածային Գվինեա
ne: इक्वेटोरिअल गुयना
sl: Ekvatorialna Gvineja

source: Greece
cy: Groeg
hy: Հունաստան
ne: ग्रीस
sl: Grčija

source: Grenada
hy: Գրենադա
ne: ग्रेनाडा
sl: Granada

source: Greenland
cy: Yr Ynys Las
hy: Գրենլանդիա
ne: ग्रिनल्याण्ड
sl: Grenlandija

source: Guatemala
hy: Գվատեմալա
ne: ग्वाटेमाला
sl: Gvatemala

source: French Guiana
cy: Guyane
hy: Ֆրանսիական Գվիանա
ne: फ्रेन्च गुयना
sl: Francoska Gvajana

source: Guam
hy: Գուամ
ne: गुयम
sl: Gvam

source: Guyana
hy: Գայանա
ne: गुयाना
sl: Gvajana

source: Heard Island and McDonald Islands
cy: Heard Island a McDonald Islands
hy: Հերդ կղզի և Մակդոնալդ կղզիներ
ne: हर्ड टापु र एमसी डोनाल्ड टापु
sl: Heardov otok in McDonaldovi otoki

source: Honduras
cy: Hondwras
hy: Հոնդուրաս
ne: होन्डुरस

source: Croatia
hy: Խորվաթիա
ne: क्रोएसिया
sl: Hrvaška

source: Haiti
hy: Հաիթի
ne: हाइटी

source: Hungary
cy: Hwngari
hy: Հունգարիա
ne: हङ्गेरी
sl: Madžarska

source: Indonesia
hy: Ինդոնեզիա
ne: इन्डोनेसिया
sl: Indonezija

source: India
hy: Հնդկաստան
ne: भारत
sl: Indija

source: Isle of Man
cy: Ynys Manaw
hy: Մեն կղզի
ne: इस्ले अफ म्यान
sl: Otok Man

source: British Indian Ocean Territory
hy: Բրիտանական Հնդկական օվկիանոսի տարածք
ne: ब्रिटिश इन्डियन ओसन टेरिटोरी
sl: Britansko ozemlje v Indijskem oceanu

source: Ireland
cy: Iwerddon
hy: Իռլանդիա
ne: आयरल्याण्ड
sl: Irska

source: Iran
hy: Իրան
ne: इरान

source: Iraq
cy: Irac
hy: Իրաք
ne: इराक
sl: Irak

source: Iceland
cy: Gwlad yr Iâ
hy: Իսլանդիա
ne: आइसल्याण्ड
sl: Islandija

source: Israel
hy: Իսրայել
ne: इज्रायल
sl: Izrael

source: Italy
cy: Yr Eidal
hy: Իտալիա
ne: इटली
sl: Italija

source: Jamaica
hy: Ճամայկա
ne: जमैका
sl: Jamajka

source: Jordan
hy: Հորդանան
ne: जोर्डन
sl: Jordanija

source: Japan
hy: Ճապոնիա
ne: जापान
sl: Japonska

source: Kazakhstan
hy: Ղազախստան
ko: 카자흐스탄
ne: कजाकस्तान
sl: Kazahstan

source: Kenya
hy: Քենիա
ne: केन्या
sl: Kenija

source: Kyrgyzstan
cy: Cirgistan
hy: Ղրղզստան
ne: किर्गिजस्तान
sl: Kirgizistan

source: Cambodia
hy: Կամբոջա
ne: कम्बोडिया
sl: Kambodža

source: Kiribati
hy: Կիրիբատի
ne: किरिबाती

source: Saint Kitts and Nevis
cy: Saint Kitts a Nevis
hy: Սենթ Քիթս և Նևիս
ne: सेन्ट किट्स र नेभिस
sl: Sveti Krištof in Nevis

source: Korea
cy: Corea
hy: Կորեա
ne: कोरिया
sl: Koreja

source: Kuwait
hy: Քուվեյթ
ne: कुवेत
sl: Kuvajt

source: Laos
hy: Լաոս
ne: लाओस

source: Lebanon
cy: Libanus
hy: Լիբանան
ne: लेबनन
sl: Libanon

source: Liberia
hy: Լիբերիա
ne: लाइबेरिया
sl: Liberija

source: Libya
hy: Լիբիա
ne: लिब्या
sl: Libija

source: Saint Lucia
hy: Սուրբ Լուչիա
ne: सेन्ट लुसिया
sl: Sveta Lucija

source: Liechtenstein
hy: Լիխտենշտեյն
ne: लिचेनेस्टियन
sl: Lihtenštajn

source: Sri Lanka
hy: Շրի Լանկա
ne: श्रीलङ्का
sl: Šrilanka

source: Lesotho
hy: Լեսոտո
ne: लोसेथो
sl: Lesoto

source: Lithuania
cy: Lithiwania
hy: Լիտվա
ne: लिथुनिया
sl: Litva

source: Luxembourg
cy: Lwcsembwrg
hy: Լյուքսեմբուրգ
ne: लक्जेमबोर्ग
sl: Luxembursko

source: Latvia
cy: Latfia
hy: Լատվիա
ne: लात्भिया
sl: Latvija

source: Macau
hy: Մակաո
ne: मकाउ
sl: Macao

source: Morocco
cy: Moroco
hy: Մարոկկո
ne: मोरक्को
sl: Maroko

source: Monaco
hy: Մոնակո
ne: मोनाको
sl: Monako

source: Moldova
hy: Մոլդովա
ko: oldova
ne: मोल्डोभा
sl: Moldavija

source: Madagascar
hy: Մադագասկար
ne: माडागास्कर
sl: Madagaskar

source: Maldives
hy: Մալդիվներ
ne: माल्दिभ्स
sl: Maldivi

source: Mexico
cy: Mecsico
hy: Մեքսիկա
ne: मेक्सिको
sl: Mehika

source: Marshall Islands
cy: Ynysoedd Marshall
hy: Մարշալյան կղզիներ
ne: मार्सल आइस्ल्यान्ड्स
sl: Marshallovi otoki

source: Macedonia
hy: Մակեդոնիա
ne: मसेडोनिया
sl: Severna Makedonija

source: Mali
hy: Մալի
ne: माली

source: Malta
hy: Մալթա
ne: माल्टा

source: Myanmar
hy: Մյանմար
ne: म्यान्मार
sl: Mjanmar

source: Mongolia
hy: Մոնղոլիա
ne: मङ्गोलिया
sl: Mongolija

source: Northern Mariana Islands
hy: Հյուսիսային Մարիանյան կղզիներ
ne: उत्तरिय मरिआना टापु
sl: Severni Marijanski otoki

source: Montenegro
hy: Մոնտենեգրո
ne: मोन्टेनेग्रो
sl: Črna gora

source: Mozambique
hy: Մոզամբիկ
ne: मोजाम्बिक
sl: Mozambik

source: Mauritania
hy: Մավրիտանիա
ne: माउरिटानिया
sl: Mavretanija

source: Montserrat
hy: Մոնսերատ
ne: मन्टसेराट
sl: Monserat

source: Martinique
hy: Մարտինիկ
ne: मार्टिनिक
sl: Martinik

source: Mauritius
hy: Մավրիկիոս
ne: मरिसस
sl: Mavricij

source: Malawi
hy: Մալավի
ne: मलावी
sl: Malavi

source: Malaysia
hy: Մալայզիա
ne: मलेसिया
sl: Malezija

source: Mayotte
hy: Մայոթ
ne: मेयोट्टे

source: Namibia
hy: Նամիբիա
ne: नामिबिया
sl: Namibija

source: New Caledonia
hy: Նոր Կալեդոնիա
ne: न्यू क्यालेडोनिया
sl: Nova Kaledonija

source: Niger
hy: Նիգեր
ne: नाइजर

source: Norfolk Island
hy: Նորֆոլկ կղզի
ne: नोर्फल्क आइस्ल्यान्ड
sl: Norfolški otok

source: Nigeria
hy: Նիգերիա
ne: नाइजेरिया
sl: Nigerija

source: Nicaragua
cy: Nicaragwa
hy: Նիկարագուա
ne: निकारागुआ
sl: Nikaragva

source: Northern Ireland
cy: Gogledd Iwerddon
hy: Հյուսիսային Իռլանդիա
ne: उत्तरी आइरल्यान्ड
sl: Severna Irska

source: Niue
hy: Նիուե
ne: निउ

source: Netherlands
cy: Yr Iseldiroedd
hy: Նիդեռլանդներ
ne: नेदरल्याण्ड
sl: Nizozemska

source: Norway
cy: Norwy
hy: Նորվեգիա
ne: नर्वे
sl: Norveška

source: Nepal
hy: Նեպալ
ne: नेपाल

source: Nauru
hy: Նաուրու
ne: नाउरू

source: New Zealand
cy: Seland Newydd
hy: Նոր Զելանդիա
ne: न्यूजिल्याण्ड
sl: Nova Zelandija

source: Oman
hy: Օման
ne: ओमन

source: Pakistan
cy: Pacistan
hy: Պակիստան
ne: पाकिस्तान

source: Panama
hy: Պանամա
ne: पानामा

source: Pitcairn
hy: Փիթքերն
ne: पिटक्याइरन

source: Peru
cy: Periw
hy: Պերու
ne: पेरु

source: Philippines
cy: Ynysoedd Philippines
hy: Ֆիլիպիններ
ne: फिलिपिन्स
sl: Filipini

source: Palau
hy: Պալաու
ne: पालाउ
sl: Palav

source: Papua New Guinea
cy: Papwa Gini Newydd
hy: Պապուա Նոր Գվինեա
ne: पपुवा न्यू गिनी
sl: Papua Nova Gvineja

source: Poland
cy: Gwlad Pwyl
hy: Լեհաստան
ne: पोल्याण्ड
sl: Poljska

source: Puerto Rico
hy: Պուերտո Ռիկո
ne: पुर्टोरिका
sl: Portoriko

source: North Korea
cy: Gogledd Korea
hy: Հյուսիսային Կորեա
ne: उत्तर कोरिया
sl: Severna Koreja

source: Portugal
cy: Portiwgal
hy: Պորտուգալիա
ne: पोर्चुगल
sl: Portugalska

source: Paraguay
hy: Պարագվայ
ne: पाराग्वे
sl: Paragvaj

source: Occupied Palestinian Territory
cy: Tiriogaeth Palestina Meddianedig
hy: Պաղեստինի օկուպացված տարածք
ne: प्यालेस्टिनियन क्षेत्र ओगटियो
sl: Okupirano palestinsko ozemlje

source: French Polynesia
hy: Ֆրանսիական Պոլինեզիա
ne: फ्रेन्च पोलिनेसिया
sl: Francoska Polinezija

source: Qatar
hy: Քաթար
ne: कतार
sl: Katar

source: Réunion
hy: Ռեյունիոն
ne: रियूनियन

source: Romania
hy: Ռումինիա
ne: रोमानिया
sl: Romunija

source: Russia
cy: Rwsia
hy: Ռուսաստան
ne: रूस
sl: Rusija

source: Rwanda
hy: Ռուանդա
ne: रुवान्डा
sl: Ruanda

source: Saudi Arabia
cy: Sawdi-Arabia
hy: Սաուդյան Արաբիա
ne: साउदी अरेबिया
sl: Savdska Arabija

source: Scotland
cy: Yr Alban
hy: Շոտլանդիա
ne: स्कटल्यान्ड
sl: Škotska

source: Sudan
cy: Swdan
hy: Սուդան
ne: सुडान

source: At sea
cy: Ar y môr
hy: Ծովում
ne: समुद्रमा
sl: Na morju

source: Senegal
hy: Սենեգալ
ne: सेनेगल

source: Serbia
hy: Սերբիա
ne: सर्बिया
sl: Srbija

source: Singapore
cy: Singapôr
hy: Սինգապուր
ne: सिङ्गापुर
sl: Singapur

source: South Georgia and the South Sandwich Islands
cy: De Georgia ac Ynysoedd De Sandwich
hy: Հարավային Ջորջիա և Հարավային Սենդվիչ կղզիներ
ne: दक्षिण जर्जिया र दक्षिण स्यान्डविच टापु
sl: Južna Georgija in Južni Sandwichevi otoki

source: Saint Helena
hy: Սուրբ Հելենա
ne: सेन्ट हेलेन
sl: Sveta Helena

source: Svalbard and Jan Mayen
cy: Svalbard a Jan Mayen
hy: Սվալբարդ և Յան Մայեն
ne: स्वाल्बार्ड र जान मायन
sl: Svalbard in Jan Mayen

source: Solomon Islands
cy: Ynysoedd Solomon
hy: Սողոմոնի կղզիներ
ne: सोलोमन द्विप
sl: Salomonovi otoki

source: Sierra Leone
hy: Սիերա Լեոնե
ne: सिरिया लिवन

source: El Salvador
hy: Էլ Սալվադոր
ne: एल साल्भाडोर
sl: Salvador

source: San Marino
hy: Սան Մարինո
ne: सन मारिनो

source: Somalia
hy: Սոմալի
ne: सोमालिया
sl: Somalija

source: Saint Pierre and Miquelon
cy: Saint Pierre a Miquelon
hy: Սեն Պիեռ և Միկելոն
ne: सेन्ट पियर र मिक्युलोन
sl: Sveta Peter in Mihael

source: South Sudan
cy: De Swdan
hy: Հարավային Սուդան
ne: दक्षिण सुडान
sl: Južni Sudan

source: Sao Tome and Principe
cy: Sao Tome a Principe
hy: Սան Տոմե և Պրինսիպ
ne: साओ टम र प्रिन्सिपे
sl: Sveti Tomaž in Princ

source: Suriname
cy: Swrinam
hy: Սուրինամ
ne: सुरिनेम
sl: Surinam

source: Slovakia
cy: Slofacia
hy: Սլովակիա
ne: स्लोभाकिया
sl: Slovaška

source: Slovenia
cy: Slofenia
hy: Սլովենիա
ne: स्लोभेनिया
sl: Slovenija

source: Sweden
hy: Շվեդիա
ne: स्वीडेन
sl: Švedska

source: Swaziland
cy: Gwlad Swasi
hy: Սվազիլենդ
ne: स्वाजिल्याण्ड
sl: Svazi

source: Seychelles
hy: Սեյշելներ
ne: सेचलेज
sl: Sejšeli

source: Syria
hy: Սիրիա
ne: सिरिया
sl: Sirija

source: Turks and Caicos Islands
cy: Turks a Caicos Islands
hy: Թերքս և Կայկոս կղզիներ
ko: Turks and Caicos Island
ne: टर्क र केकोस द्विप
sl: Otoki Turks in Caicos

source: Chad
hy: Չադ
ne: चाड
sl: Čad

source: Togo
hy: Տոգո
ne: टोगो

source: Thailand
cy: Gwlad Thai
hy: Թաիլանդ
ne: थाइल्याण्ड
sl: Tajska

source: Tajikistan
cy: Tajicistan
hy: Տաջիկստան
ne: ताजकिस्तान
sl: Tadžikistan

source: Tokelau
hy: Տոկելաու
ne: टोकेलाउ
sl: Tokelav

source: Turkmenistan
cy: Tyrcmentistan
hy: Թուրքմենստան
ne: तुर्कमेनिस्तान

source: Timor-Leste
hy: Թիմոր-Լեստե
ne: टिमोर-लेस्टे
sl: Vzhodni Timor

source: Tonga
hy: Տոնգա
ne: टोङ्गा

source: Trinidad and Tobago
cy: Trinidad a Tobago
hy: Տրինիդադ և Տոբագո
ne: ट्रिनिडाड र टोबागो
sl: Trinidad in Tobago

source: Tunisia
hy: Թունիս
ne: ट्युनिसिया
sl: Tunizija

source: Turkey
cy: Twrci
hy: Թուրքիա
ne: टर्की
sl: Turčija

source: Tuvalu
hy: Տուվալու
ne: टुभालु

source: Taiwan
hy: Թայվան
ne: ताइवान
sl: Tajvan

source: Tanzania
cy: Tansanïa
hy: Տանզանիա
ne: टान्जानिया
sl: Tanzanija

source: Uganda
hy: Ուգանդա
ne: युगान्डा

source: Ukraine
cy: Ukrain
hy: Ուկրաինա
ne: यूक्रेन
sl: Ukrajina

source: US Minor Outlying Islands
cy: Mân Ynysoedd Allanol yr UD
hy: ԱՄՆ հեռավոր փոքր կղզիներ
ne: यूएस माइनर आउटलाइङ टापुहरू
sl: Ameriški manjši zunanji otoki

source: Uruguay
hy: Ուրուգվայ
ne: उरुग्वे
sl: Urugvaj

source: United States
cy: Unol Daleithiau
hy: Միացյալ Նահանգներ
ne: संयुक्त राज्य अमेरिका
sl: Združene države Amerike

source: Uzbekistan
hy: Ուզբեկստան
ne: उज्बेकिस्तान

source: Vatican City
cy: Dinas y Fatican
hy: Վատիկան քաղաք
ne: भ्याटिकन सीटी
sl: Vatikan

source: Saint Vincent and the Grenadines
cy: Saint Vincent a'r Grenadines
hy: Սենթ Վինսենթ և Գրենադիններ
ne: सेन्ट भिन्सेन्ट एण्ड दि ग्रेनडिन्स
sl: Sveti Vincencij in Grenadine

source: Venezuela
hy: Վենեսուելա
ko: Vendemiaire
ne: भेनेजुएला

source: British Virgin Islands
cy: Ynysoedd Virgin Prydeinig
hy: Բրիտանական Վիրջինյան կղզիներ
ne: ब्रिटिश भर्जिन आइस्ल्यान्डस्
sl: Britanski Deviški otoki

source: US Virgin Islands
cy: Ynysoedd Virgin yr UD
hy: ԱՄՆ Վիրջինյան կղզիներ
ne: युएस भर्जिन टापुहरू
sl: Ameriški Deviški otoki

source: Vietnam
cy: Fiet-nam
hy: Վիետնամ
ne: भीयतनाम

source: Vanuatu
hy: Վանուատու
ne: भानुएटु

source: Wallis and Futuna
cy: Wallis a Futuna
hy: Ուոլիս և Ֆուտունա
ne: वालिस र Futuna
sl: Wallis in Futuna

source: Wales
cy: Cymru
hy: Ուելս
ne: वेल्स

source: Samoa
hy: Սամոա
ne: सामोआ

source: Yemen
hy: Եմեն
ne: येमन
sl: Jemen

source: South Africa
cy: De Affrica
hy: Հարավային Աֆրիկա
ne: दक्षिण अफ्रिका
sl: Južna Afrika

source: Zambia
hy: Զամբիա
ne: जाम्बिया
sl: Zambija

source: Zimbabwe
hy: Զիմբաբվե
ne: जिम्बावे
sl: Zimbabve

# Surname tradition
source: none
cy: dim
hy: ոչ մեկը
ko: 없음
ne: कुनैपनि होइन
sl: Brez

# Surname tradition
source: Icelandic
cy: Eislandeg
hy: իսլանդերեն
ne: आइसल्यान्डिक
sl: Islandska

source: Children take a patronym instead of a surname.
cy: Mae plant yn cymryd patronym yn lle cyfenw.
hy: Երեխաները ազգանվան փոխարեն ընդունում են հայրանուն.
ko: 자녀들은 성 대신 가명을 사용합니다.
ne: छोराछोरीले थरको सट्टा संरक्षक नाम लिन्छन्।
sl: Otroci namesto priimka prevzamejo patronimik.

# Surname tradition
source: Lithuanian
cy: Lithwaneg
hy: լիտվերեն
ne: लिथुनियन
sl: Litovska

source: Children take their father’s surname.
cy: Mae plant yn cymryd cyfenw eu tad.
hy: Երեխաները վերցնում են իրենց հոր ազգանունը.
ko: 자녀들은 아버지의 성을 가집니다.
ne: छोराछोरीले आफ्नो बुबाको थर लिन्छन्।
sl: Otroci prevzamejo očetov priimek.

source: Wives take their husband’s surname.
cy: Mae gwragedd yn cymryd cyfenw eu gŵr.
hy: Կանայք վերցնում են իրենց ամուսնու ազգանունը.
ko: 아내는 남편의 가문이름을 가져옵니다.
ne: पत्नीहरूले आफ्नो पतिको थर लिन्छन्।
sl: Žene prevzamejo možev priimek.

source: Surnames are inflected to indicate an individual’s sex and marital status.
hy: Ազգանունները շեղվում են՝ ցույց տալու անհատի սեռը և ամուսնական կարգավիճակը:
ne: उपनामहरू एक व्यक्तिको लिंग र वैवाहिक स्थितिलाई संकेत गर्नका लागि प्रभावित हुन्छन्।

source: matrilineal
cy: mamlinachol
hy: մայրուղային
ko: 모계
sl: Po materini liniji

source: Children take their mother’s surname.
cy: Mae plant yn cymryd cyfenw eu mam.
hy: Երեխաները վերցնում են իրենց մոր ազգանունը.
ko: 자녀들은 어머니의 성을 가집니다.
ne: छोराछोरीहरूले आमाको थर लिन्छन् ।
sl: Otroci prevzamejo materin priimek.

# Surname tradition
source: paternal
cy: tadol
hy: հայրական
ko: 부계
ne: पैतृक
sl: Očetovska

source: patrilineal
cy: tadlinachol
hy: հայրական
ko: 부계
sl: Po očetovi liniji

# Surname tradition
source: Polish
cy: Pwyleg
hy: լեհ
ne: पोलिस
sl: Poljska

source: Surnames are inflected to indicate an individual’s sex.
hy: Ազգանունները շեղվում են՝ ցույց տալու անհատի սեռը:
ne: उपनामहरू एक व्यक्तिको लिङ्ग संकेत गर्नका लागि विलम्बित हुन्छन्।

# Surname tradition
source: Portuguese
cy: Portiwgaleg
hy: պորտուգալերեն
ne: पोर्चुगाली
sl: Portugalska

source: Children take one surname from the mother and one surname from the father.
cy: Mae plant yn cymryd un cyfenw gan y fam ac un cyfenw gan y tad.
hy: Երեխաները մորից վերցնում են մեկ ազգանուն, հորից՝ մեկ ազգանուն։
ko: 자녀들은 어머니로부터 하나의 성을, 아버지로부터 하나의 성을 얻습니다.
ne: छोराछोरीले आमाबाट एउटा थर र बुवाबाट एउटा थर लिन्छन्।
sl: Otroci prevzamejo en priimek po materi in en priimek po očetu.

# Surname tradition
source: Spanish
cy: Sbaeneg
hy: իսպաներեն
ne: स्पेनिस
sl: Španska

source: Children take one surname from the father and one surname from the mother.
cy: Mae plant yn cymryd un cyfenw gan y tad ac un cyfenw gan y fam.
hy: Երեխաները մեկ ազգանուն են վերցնում հորից, մեկ ազգանուն՝ մորից։
ko: 자녀들은 아버지로부터 하나의 성을 가져오고 어머니로부터 하나의 성을 가져옵니다.
ne: छोराछोरीले बुवाबाट एउटा थर र आमाबाट एउटा थर लिन्छन्।
sl: Otroci prevzamejo en priimek po očetu in en priimek po materi.

source: The parameter “%s” is missing.
cy: Mae'r paramedr “%s” ar goll.
hy: «%s» պարամետրը բացակայում է:
ko: "%s" 매개 변수가 없습니다.
ne: प्यारामिटर "%s" हराइरहेको छ।
sl: Parameter “%s” manjka.

source: Modules
cy: Modiwlau
hy: Մոդուլներ
ko: 모듈
ne: मोड्युलहरू
sl: Moduli

source: save
cy: cadw
hy: փրկել
ko: 저장
ne: सेभ
sl: Shrani

source: cancel
cy: diddymu
hy: չեղարկել
ko: 취소
ne: रद्द गर्नुहोस्
sl: Prekliči

# Email sender
source: From
cy: Oddiwrth
hy: Սկսած
ne: बाट
sl: Od

# Email recipient
source: To
cy: At
hy: Դեպի
ne: को
sl: Za

source: Subject
cy: Pwnc
hy: Թեմա
ko: 제목
ne: विषय
sl: Predmet

source: Message
cy: Neges
hy: Հաղորդագրություն
ko: 메세지
ne: सन्देश
sl: Sporočilo

source: Send
cy: Anfon
hy: Ուղարկել
ko: 보내기
ne: पठाउनुहोस्
sl: Pošlji

# Start of date range
source: From
cy: Oddiwrth
hy: Սկսած
ko: 에서
ne: बाट
sl: Od

# End of date range
source: To
cy: At
hy: Դեպի
ko: 까지
ne: को
sl: Do

source: Record
cy: Cofnodi
hy: Ձայնագրեք
ko: 레코드
ne: रेकर्ड गर्नुहोस्
sl: Zapis

source: Old data
cy: Hen ddata
hy: Հին տվյալներ
ko: 오래된 데이터
ne: पुरानो डाटा
sl: Stari podatki

source: New data
cy: Data newydd
hy: Նոր տվյալներ
ko: 신규 데이터
ne: नयाँ डाटा
sl: Novi podatki

source: search
cy: chwilio
hy: որոնում
ko: 검색
ne: खोज्नुहोस्
sl: Najdi

source: reset
cy: ailosod
hy: վերակայել
ko: 재설정
ne: रिसेट
sl: Ponastavi

source: download
cy: llwytho i lawr
hy: բեռնել
ko: 다운로드
ne: डाउनलोड गर्नुहोस्
sl: Prenos

source: Permanently delete these records?
cy: Dileu'r cofnodion hyn yn barhaol?
hy: Ընդմիշտ ջնջե՞լ այս գրառումները?
ko: 이 레코드를 영구적으로 삭제하시겠습니까?
ne: यी रेकर्डहरू स्थायी रूपमा मेटाउने हो?
sl: Dokončno izbrišem te zapise?

source: delete
cy: dileu
hy: ջնջել
ko: 삭제
ne: मेटाउनुहोस्
sl: Izbriši

source: Timestamp
cy: Stamp amser
hy: Ժամացույց
ko: 타임스탬프
ne: टाइमस्ट्याम्प
sl: Časovni žig

source: Files marked with %s are required for proper operation and cannot be removed.
cy: Mae angen y ffeiliau sydd wedi'u marcio â %s er mwyn gweithredu'n iawn ac nid oes modd eu tynnu.
hy: %s-ով նշված ֆայլերը պահանջվում են ճիշտ աշխատանքի համար և չեն կարող հեռացվել:
ko: %s(으)로 표시된 파일은 올바른 작업에 필요하며 제거할 수 없습니다.
ne: %s सँग चिन्ह लगाइएका फाइलहरू उचित सञ्चालनका लागि आवश्यक छन् र हटाउन सकिँदैन।
sl: Datoteke, označene z znakom %s so potrebne za pravilno delovanje in jih ni mogoče odstraniti.

source: Module
cy: Modiwl
hy: Մոդուլ
ko: 모듈
ne: मोड्युल
sl: Modul

source: Enabled
cy: Galluogwyd
hy: Միացված է
ko: 활성화
ne: सक्षम पारिएको
sl: Omogočeno

source: Access level
cy: Lefel mynediad
hy: Մուտքի մակարդակ
ko: 접근 레벨
ne: पहुँच स्तर
sl: Raven dostopa

source: Move up
cy: Symud i fyny
hy: Շարժվեք վերև
ko: 위로 이동
ne: माथि सार्नुहोस्
sl: Premakni gor

source: Move down
cy: Symud i lawr
hy: Տեղափոխեք ներքև
ko: 아래로 이동
ne: तल सार्नुहोस्
sl: Premakni dol

source: close
cy: cau
hy: փակել
ko: 닫기
ne: नजिक
sl: Zapri

source: edit
cy: golygu
hy: խմբագրել
ko: 편집
ne: सच्याउनुहोस्
sl: Uredi

source: Website
cy: Gwefan
hy: Կայք
ko: 웹사이트
ne: वेबसाइट
sl: Spletišče

source: Support and documentation can be found at %s.
cy: Mae cefnogaeth a dogfennaeth i'w gweld yn %s.
hy: Աջակցություն և փաստաթղթեր կարելի է գտնել %s կայքում:
ko: 지원 및 설명서는 %s에서 찾을 수 있습니다.
ne: समर्थन र कागजातहरू %s मा फेला पार्न सकिन्छ।
sl: Podporo in dokumentacijo lahko najdete na %s.

source: There was an error checking for a new version.
hy: Սխալ առաջացավ նոր տարբերակի ստուգման ժամանակ:
ne: नयाँ संस्करणको लागि जाँच गर्दा त्रुटि भयो।

source: Last checked %s.
hy: Վերջին անգամ ստուգվել է %s:
ne: पछिल्लो पटक जाँच गरिएको %s।

source: check now
hy: ստուգեք հիմա
ne: अहिले जाँच गर्नुहोस्

source: An upgrade is available.
cy: Mae uwchraddiad ar gael.
hy: Հասանելի է թարմացում։
ko: 업그레이드가 가능합니다.
ne: अपग्रेड उपलब्ध छ ।
sl: Na voljo je posodobitev.

source: For more information, see %s.
hy: Լրացուցիչ տեղեկությունների համար տե՛ս %s:
ko: 자세한 내용은 %s을 참조하십시오.
ne: थप जानकारीको लागि, %s हेर्नुहोस्।

source: You need to create a family tree.
cy: Mae angen i chi greu cart achau.
hy: Դուք պետք է ստեղծեք տոհմածառ:
ko: 가계도를 만들어야합니다.
ne: तपाईंले एउटा पारिवारिक रूख सिर्जना गर्न आवश्यक छ।
sl: Ustvariti morate družinsko drevo.

source: Users
cy: Defnyddwyr
hy: Օգտատերեր
ko: 사용자
ne: प्रयोगकर्ताहरु
sl: Uporabniki

source: Administrators
cy: Gweinyddwyr
hy: Ադմինիստրատորներ
ko: 관리자
ne: प्रशासकहरू
sl: Skrbniki

source: Managers
cy: Rheolwyr
hy: Մենեջերներ
ko: 관리자
ne: प्रबन्धकहरू
sl: Upravitelji

source: Moderators
cy: Cymedrolwyr
hy: Մոդերատորներ
ko: 중재자
ne: मोडरेटरहरू
sl: Moderatorji

source: Not verified by the user
cy: Heb ei wirio gan y defnyddiwr
hy: Չի հաստատվել օգտագործողի կողմից
ko: 사용자가 확인하지 않음
ne: प्रयोगकर्ताद्वारा प्रमाणित नभएको
sl: Uporabnik ni preveril

source: Not approved by an administrator
cy: Heb ei gymeradwyo gan weinyddwr
hy: Հաստատված չէ ադմինիստրատորի կողմից
ko: 관리자가 승인하지 않음
ne: एडमिनद्वारा अप्रुभ गरिएको छैन
sl: Uporabniki, ki jih ni odobril skrbnik

source: Genealogy
cy: Achyddiaeth
hy: Ծագումնաբանություն
ko: 계보
ne: वंशावली
sl: Rodoslovje

source: Individual page
cy: Tudalen unigol
hy: Անհատական էջ
ko: 인물 페이지
ne: व्यक्तिगत पृष्ठ
sl: Osebna stran

source: Old files found
cy: Wedi canfod hen ffeiliau
hy: Գտնվել են հին ֆայլեր
ko: 오래된 파일 발견
ne: पुराना फाइलहरू भेटिए
sl: Najdene so stare datoteke

source: Files have been found from a previous version of webtrees. Old files can sometimes be a security risk. You should delete them.
cy: Daethpwyd o hyd i ffeiliau o fersiwn flaenorol o webtrees. Weithiau gall hen ffeiliau fod yn risg diogelwch. Dylech eu dileu.
hy: Ֆայլեր են հայտնաբերվել վեբ ծառերի նախորդ տարբերակից: Հին ֆայլերը երբեմն կարող են անվտանգության վտանգ լինել: Դուք պետք է ջնջեք դրանք:
ko: 이전 버전의 웹트리에서 파일을 찾았습니다. 오래된 파일은 때때로 보안 위험이 될 수 있습니다. 삭제해야 합니다.
ne: वेबट्रीको अघिल्लो संस्करणबाट फाइलहरू फेला परेका छन्। पुराना फाइलहरू कहिलेकाहीं सुरक्षा जोखिम हुन सक्छ। तपाईंले तिनीहरूलाई हटाउनु पर्छ।
sl: Najdene so bile datoteke iz prejšnje različice webtrees. Stare datoteke lahko včasih predstavljajo varnostno tveganje, zato jih je treba izbrisati.

source: Custom module
cy: Modiwl cyfaddas
hy: Պատվերով մոդուլ
ko: 사용자정의 모듈
ne: अनुकूलन मोड्युल
sl: Modul po meri

source: Update all
cy: Diweddaru'r cyfan
hy: Թարմացրեք բոլորը
ko: 전부 업데이트
ne: सबै अपडेट गर्नुहोस
sl: Posodobi vse

source: Data fix
cy: Trwsio data
hy: Տվյալների ամրագրում
ko: 데이터 수정
ne: डाटा फिक्स
sl: Popravek podatkov

source: Why does this list include records that do not need to be updated?
cy: Pam mae'r rhestr hon yn cynnwys cofnodion nad oes angen eu diweddaru?
hy: Ինչո՞ւ է այս ցանկը ներառում գրառումներ, որոնք թարմացման կարիք չունեն?
ko: 이 목록에 업데이트 할 필요가없는 레코드가 포함 된 이유는 무엇입니까?
ne: किन यस सूचीमा रेकर्डहरू समावेश छन् जुन अद्यावधिक गर्न आवश्यक छैन?
sl: Zakaj ta seznam vključuje zapise, ki jih ni treba posodobiti?

source: &lt;select&gt;
cy: &lt;dewis&gt;
hy: &lt;ընտրել&gt;
ko: &lt;선택&gt;
ne: &lt;चयन&gt;
sl: &lt;izberi&gt;

source: next
cy: nesaf
hy: հաջորդ
ko: 다음
ne: पछिल्लो
sl: Naprej

source: Move the media object?
cy: Symud y gwrthrych cyfryngau?
hy: Տեղափոխե՞լ մեդիա օբյեկտը?
ko: 미디어 개체를 이동하시겠습니까?
ne: मिडिया वस्तु सार्ने ?
sl: Premaknem medijski predmet?
