Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Add the GEDCOM media path to filenames
cy: Ychwanegu llwybr cyfryngau GEDCOM at enwau ffeiliau
sl: Dodaj medijsko pot GEDCOM imenom datotek

source: Advanced fact preferences
cy: Dewisiadau ffeithiau uwch
sl: Napredne nastavitve dejstev

source: Advanced name facts
cy: Ffeithiau enw uwch
sl: Napredno ime dejstev

source: Advanced place name facts
cy: Ffeithiau enw lle uwch
sl: Napredno ime dejstev kraja

source: Age related to death year
cy: Oed yn gysylltiedig â blwyddyn marwolaeth
sl: Starost glede na leto smrti

source: Aland Islands
cy: Ynysoedd yr Aland
sl: Ålandski otoki

source: All family facts
cy: Holl ffeithiau'r teulu
sl: Vsa družinska dejstva

source: All individual facts
cy: Pob ffaith unigol
sl: Vsa osebna dejstva

source: All repository facts
cy: Pob ffaith storfan
sl: Vsa dejstva o skladišču

source: All source facts
cy: Pob ffaith ffynhonnell
sl: Vsa dejstva o viru

source: An associate is another individual who was involved with this fact or event, such as a witness or a priest.
cy: Mae cysylltiad yn unigolyn arall a oedd yn ymwneud â'r ffaith neu'r digwyddiad hwn, fel tyst neu offeiriad.
sl: Sodelavec je druga oseba, ki je bila vpletena v to dejstvo ali dogodek, na primer priča ali duhovnik.

source: An associate is another individual who was involved with this individual, such as a friend or an employer.
cy: Mae cysylltiad yn unigolyn arall a oedd yn ymwneud â'r unigolyn hwn, fel ffrind neu gyflogwr.
sl: Sodelavec je druga oseba, ki je bila v stiku s to osebo, na primer prijatelj ali delodajalec.

source: An individual can have more than one set of parents. For example, birth and adopted.
cy: Gall unigolyn gael mwy nag un set o rieni. Er enghraifft, genedigaeth a mabwysiadwyd.
sl: Oseba ima lahko več kot en par staršev. Na primer, biološke starše in posvojitelje.

source: Asuncion, Paraguay
sl: Asuncion, Paragvaj

# Abbreviation for Persian month: Azar
source: Azar
ne: अजार
sl: aza

source: Batch update
cy: Diweddaru swp
sl: Posodobitev v paketu

source: Bogota, Colombia
sl: Bogota, Kolumbija

source: Case insensitive
cy: Maint nodau ansensitif
sl: Ne razlikuje med velikimi in malimi črkami

source: Ciudad Juarez, Mexico
cy: Ciudad Juarez, Mecsico
sl: Ciudad Juarez, Mehika

source: Cleared but not yet completed
cy: Wedi'i glirio ond heb ei gwblhau eto
sl: Očiščeno, vendar še ni dokončano

source: Colonia Juarez, Mexico
cy: Colonia Juarez, Mecsico
sl: Colonia Juarez, Mehika

source: Comparison
cy: Cymhariaeth
ko: 비교
sl: Primerjava

source: Compress the GEDCOM file
cy: Cywasgu'r ffeil GEDCOM
sl: Stisni datoteko GEDCOM

source: Concatenation
cy: Cydgadwyn
sl: Združevanje

source: Continued
cy: Parhad
sl: Nadaljevano

source: Convert CEME tags to GEDCOM 5.5.1
cy: Trosi tagiau CEME i GEDCOM 5.5.1
sl: Pretvori oznake CEME v GEDCOM 5.5.1

source: Convert NAME:_XXX tags to GEDCOM 5.5.1
cy: Trosi tagiau NAME:_XXX i GEDCOM 5.5.1
sl: Pretvori oznake NAME:_XXX v GEDCOM 5.5.1

source: Convert _PRIM tags to GEDCOM 5.5.1
cy: Trosi tagiau _PRIM i GEDCOM 5.5.1
sl: Pretvori oznake _PRIM v GEDCOM 5.5.1

source: Convert from UTF-8 to ISO-8859-1
cy: Trosi o UTF-8 i ISO-8859-1
sl: Spremeni UTF-8 v ISO-8859-1

source: Cote d’Ivoire
sl: Slonokoščena obala

source: Custom fact
cy: Ffaith cyfaddas
sl: Dejstvo po meri

source: Decade of birth
cy: Degawd genedigaethau
sl: Dekada rojstva

source: Decade of death
cy: Degawd marwolaethau
sl: Dekada smrti

source: Decade of marriage
cy: Degawd priodasau
sl: Dekada poroke

source: Delete all existing geographic data before importing the file.
cy: Dileu'r holl ddata daearyddol presennol cyn mewnforio'r ffeil.
sl: Pred uvozom datoteke izbriši vse obstoječe geografske podatke.

# Abbreviation for Persian month: Dey
source: Dey
ne: डेइ
sl: dej

# GENITIVE
source: Dey
ne: डेइ
sl: dej

# INSTRUMENTAL
source: Dey
ne: डेइ
sl: dej

# LOCATIVE
source: Dey
ne: डेइ
sl: dej

# GENITIVE
source: Dhu al-Hijjah
ne: धु अल हिज्जा
sl: zul-hidže

# INSTRUMENTAL
source: Dhu al-Hijjah
ne: धु अल हिज्जा
sl: zul-hidže

# LOCATIVE
source: Dhu al-Hijjah
ne: धु अल हिज्जा
sl: zul-hidže

# NOMINATIVE
source: Dhu al-Hijjah
ne: धु अल हिज्जा
sl: zul-hidže

# GENITIVE
source: Dhu al-Qi’dah
ne: धु अल-किदाह
sl: zul-ka’de

# INSTRUMENTAL
source: Dhu al-Qi’dah
ne: धु अल-किदाह
sl: zul-ka’de

# LOCATIVE
source: Dhu al-Qi’dah
ne: धु अल-किदाह
sl: zul-ka’de

# NOMINATIVE
source: Dhu al-Qi’dah
ne: धु अल-किदाह
sl: zul-ka’de

source: Died as an infant: exempt
cy: Bu farw yn faban: eithriedig
sl: Umrl/a kot dojenček: izvzeto

source: Do not use maps
cy: Peidiwch â defnyddio mapiau
sl: Ne uporabi zemljevidov

source: Edit the gender
cy: Golygu'r rhyw
ko: 성별 수정
sl: Uredi spol

source: Editing restriction
cy: Cyfyngiad golygu
sl: Omejitev urejanja

source: Facts for repository records
cy: Ffeithiau ar gyfer cofnodion storfan
sl: Dejstva za zapise skladišč

source: Facts for source records
cy: Ffeithiau ar gyfer cofnodion ffynhonnell
sl: Dejstva za zapise virov

source: Gender
cy: Rhyw
ko: 성별
sl: Spol

# GENITIVE
source: Heshvan
ne: हेस्भान
sl: ešvan

# INSTRUMENTAL
source: Heshvan
ne: हेस्भान
sl: ešvan

# LOCATIVE
source: Heshvan
ne: हेस्भान
sl: ešvan

source: If the thumbnail image is a custom image, you should add it to the media object.
cy: Os yw'r ddelwedd bach yn ddelwedd wedi'i haddasu, dylech ei hychwanegu at y gwrthrych cyfryngau.
ko: 썸네일 이미지가 사용자 지정 이미지인 경우 미디어 개체에 추가해야 합니다.
sl: Če je sličica slika po meri, jo morate dodati medijskemu predmetu.

source: If the thumbnail image is the same as the original image, it is no longer needed and you should delete it.
cy: Os yw'r ddelwedd bach yr un peth â'r ddelwedd wreiddiol, nid oes ei hangen mwyach a dylech ei dileu.
ko: 썸네일 이미지가 원본 이미지와 동일하면 더 이상 필요하지 않으므로 삭제해야 합니다.
sl: Če je sličica enaka izvirni sliki, je ne potrebujemo več in jo morate izbrisati.

source: If you connect to the database using a UNIX socket, enter the path here and leave the port number empty.
cy: Os ydych chi'n cysylltu â'r gronfa ddata gan ddefnyddio soced UNIX, nodwch y llwybr yma a gadewch rif y porthladd yn wag.
sl: Če se s podatkovno bazo povezujete prek vtičnice UNIX, vnesite tukaj pot in pustite številko vrat prazno.

source: Import custom thumbnails from webtrees version 1
cy: Mewnforio lluniau bach cyfaddas o webtrees fersiwn 1
ko: 웹트리 버전 1에서 사용자 정의 축소판 가져오기
sl: Uvozi sličice po meri iz webtrees različice 1

source: In webtrees version 1, you could add custom thumbnails to media objects by creating files in the “thumbs” folders.
cy: Yn fersiwn 1 webtrees, roeddech chi'n gallu ychwanegu lluniau bach wedi'u haddasu at wrthrychau cyfryngau trwy greu ffeiliau yn y ffolderi “thumbs”.
ko: 웹트리 버전 1에서는 "thumbs" 폴더에 파일을 만들어 미디어 개체에 사용자 정의 축소판을 추가할 수 있습니다.
sl: V webtrees različici 1 ste lahko medijskim predmetom dodali sličice po meri tako, da ste v mapah “thumbs” ustvarili datoteke.

source: In webtrees version 2, custom thumbnails are stored as a second media file in the same media object.
cy: Yn fersiwn 2 webtrees, mae lluniau bach cyfaddas yn cael eu storio fel ail ffeil cyfryngau yn yr un gwrthrych cyfryngau.
ko: 웹트리 버전 2에서 사용자 정의 축소판은 동일한 미디어 개체에 두 번째 미디어 파일로 저장됩니다.
sl: V webtrees različici 2 so sličice po meri shranjene kot druga medijska datoteka v istem medijskem predmetu.

source: Include media (automatically zips files)
cy: Yn cynnwys cyfryngau (yn sipio ffeiliau'n awtomatig)
sl: Vključi medije (samodejno stisni datoteke)

source: Individuals with surname %s
cy: Unigolion â chyfenw %s
ko: 가문이름이 %s인 인물
sl: Osebe s priimkom %s

source: Infant
cy: Baban
sl: Dojenček

# GENITIVE
source: Iyar
ne: इयार
sl: ijar

# INSTRUMENTAL
source: Iyar
ne: इयार
sl: ijar

# LOCATIVE
source: Iyar
ne: इयार
sl: ijar

# GENITIVE
source: Jumada al-awwal
ne: जुमाद अल अव्वल
sl: džumadel-ula

# INSTRUMENTAL
source: Jumada al-awwal
ne: जुमाद अल अव्वल
sl: džumadel-ula

# LOCATIVE
source: Jumada al-awwal
ne: जुमाद अल अव्वल
sl: džumadel-ula

# NOMINATIVE
source: Jumada al-awwal
ne: जुमाद अल अव्वल
sl: džumadel-ula

# GENITIVE
source: Jumada al-thani
ne: जुमादा अल थानी
sl: džumadel-uhra

# INSTRUMENTAL
source: Jumada al-thani
ne: जुमादा अल थानी
sl: džumadel-uhra

# LOCATIVE
source: Jumada al-thani
ne: जुमादा अल थानी
sl: džumadel-uhra

# NOMINATIVE
source: Jumada al-thani
ne: जुमादा अल थानी
sl: džumadel-uhra

# Abbreviation for Persian month: Khordad
source: Khor
ne: खोर
sl: kor

# GENITIVE
source: Khordad
ne: खोर्डाद
sl: kordad

# INSTRUMENTAL
source: Khordad
ne: खोर्डाद
sl: kordad

# LOCATIVE
source: Khordad
ne: खोर्डाद
sl: kordad

source: Linked database ID
cy: ID cronfa ddata gysylltiedig
sl: ID povezane podatkovne baze

source: Mailing name
cy: Enw postio
sl: Poštno ime

source: Map provider
cy: Darparwr mapiau
sl: Ponudnik zemljevidov

source: Marriage status
cy: Statws priodasol
sl: Zakonski stan

source: Marriage type unknown
cy: Math o briodas yn anhysbys
sl: Vrsta poroke neznana

source: Married surname
cy: Cyfenw priod
sl: Poročni priimek

source: Media filenames will be prefixed by %s.
cy: Bydd enwau ffeiliau cyfryngau yn cael eu rhagddodi gyda %s.
sl: Imena medijskih datotek bodo imela predpono %s.

source: Medical condition
cy: Cyflwr meddygol
sl: Zdravstveno stanje

# Abbreviation for Persian month: Mehr
source: Mehr
ne: मेहर
sl: mer

# GENITIVE
source: Mehr
ne: मेहर
sl: mer

# INSTRUMENTAL
source: Mehr
ne: मेहर
sl: mer

# LOCATIVE
source: Mehr
ne: मेहर
sl: mer

source: Most sites are configured to use the default value of 3306.
cy: Mae'r mwyafrif o wefannau wedi'u ffurfweddu i ddefnyddio'r gwerth rhagosodedig 3306.
sl: Večina spletišč je nastavljenih tako, da uporabljajo privzeto vrednost 3306.

# GENITIVE
source: Muharram
ne: मुहाराम
sl: muharrem

# INSTRUMENTAL
source: Muharram
ne: मुहाराम
sl: muharrem

# LOCATIVE
source: Muharram
ne: मुहाराम
sl: muharrem

# NOMINATIVE
source: Muharram
ne: मुहाराम
sl: muharrem

# GENITIVE
source: Nissan
ne: निसान
sl: nisan

# INSTRUMENTAL
source: Nissan
ne: निसान
sl: nisan

# LOCATIVE
source: Nissan
ne: निसान
sl: nisan

# GENITIVE
source: Ordibehesht
ne: ओर्डिबेहेश
sl: ordibehešt

# INSTRUMENTAL
source: Ordibehesht
ne: ओर्डिबेहेश
sl: ordibehešt

# LOCATIVE
source: Ordibehesht
ne: ओर्डिबेहेश
sl: ordibehešt

source: Parent
cy: Rhiant
sl: Starš

source: Phonetic
cy: Ffonetig
sl: Fonetičen

source: Phonetic title
cy: Teitl ffonetig
sl: Fonetični naslov

source: Place names can change over time. In genealogy, it is customary to use the current name for a town or country. The historic name can be shown in sources, notes, etc.
cy: Gall enwau lleoedd newid dros amser. Mewn achau, mae'n arferol defnyddio'r enw cyfredol ar gyfer tref neu wlad. Mae modd dangos yr enw hanesyddol mewn ffynonellau, nodiadau, ac ati.
sl: Imena krajev se lahko sčasoma spreminjajo. V rodoslovju je običajno, da uporabimo trenutno ime za mesto ali državo. Zgodovinsko ime je lahko prikazano v virih, opombah itd.

source: Presentation style
cy: Arddull cyflwyno
sl: Slog predstavitve

source: Privacy restriction
cy: Cyfyngiad preifatrwydd
sl: Omejitev zasebnosti

source: Quick repository facts
cy: Ffeithiau storfan cyflym
sl: Hitra dejstva o skladišču

source: Quick source facts
cy: Ffeithiau ffynhonnell cyflym
sl: Hitra dejstva o viru

source: RE:
cy: Ynghylch:
ne: पुन:
sl: Odg:

# GENITIVE
source: Rabi’ al-awwal
ne: रबि अल अव्वल
sl: rebiul-ewel

# INSTRUMENTAL
source: Rabi’ al-awwal
ne: रबि अल अव्वल
sl: rebiul-ewel

# LOCATIVE
source: Rabi’ al-awwal
ne: रबि अल अव्वल
sl: rebiul-ewel

# NOMINATIVE
source: Rabi’ al-awwal
ne: रबि अल अव्वल
sl: rebiul-ewel

# GENITIVE
source: Rabi’ al-thani
ne: रबी अल थानी
sl: rebiul-ahir

# INSTRUMENTAL
source: Rabi’ al-thani
ne: रबी अल थानी
sl: rebiul-ahir

# LOCATIVE
source: Rabi’ al-thani
ne: रबी अल थानी
sl: rebiul-ahir

# NOMINATIVE
source: Rabi’ al-thani
ne: रबी अल थानी
sl: rebiul-ahir

source: Rada
sl: Radāʿ

# Female pedigree
source: Rada
ne: रादा
sl: Radāʿ

# Pedigree
source: Rada
ne: रादा
sl: Radāʿ

# GENITIVE
source: Rajab
ne: राजब
sl: redžeb

# INSTRUMENTAL
source: Rajab
ne: राजब
sl: redžeb

# LOCATIVE
source: Rajab
ne: राजब
sl: redžeb

# NOMINATIVE
source: Rajab
ne: राजब
sl: redžeb

# GENITIVE
source: Ramadan
ne: रमादान
sl: ramazan

# INSTRUMENTAL
source: Ramadan
ne: रमादान
sl: ramazan

# LOCATIVE
source: Ramadan
ne: रमादान
sl: ramazan

# NOMINATIVE
source: Ramadan
ne: रमादान
sl: ramazan

source: Really delete all geographic data?
cy: Dileu'r holl ddata daearyddol?
sl: Res želite izbrisati vse geografske podatke?

source: Religious name
cy: Enw crefyddol
sl: Versko ime

source: Renumber
cy: Ail-rifo
sl: Preštevilči

source: Renumber family tree
cy: Ail-rifo'r achau teuluol
sl: Preštevilči družinsko drevo

source: Reset to initial map state
cy: Ailosod i gyflwr cychwynnol y map
sl: Ponastavi na začetno stanje zemljevida

source: Romanized title
cy: Teitl wedi'i Rufeineiddio
sl: Romanizirani naslov

# GENITIVE
source: Safar
ne: सफार
sl: safer

# INSTRUMENTAL
source: Safar
ne: सफार
sl: safer

# LOCATIVE
source: Safar
ne: सफार
sl: safer

# NOMINATIVE
source: Safar
ne: सफार
sl: safer

source: San Jose, Costa Rica
sl: San Jose, Kostarika

source: Sao Paulo, Brazil
cy: Sao Paulo, Brasil
sl: Sao Paulo, Brazilija

source: Sextidi
ne: सेक्सतिदी
sl: sekstidi

# Abbreviation for Persian month: Shahrivar
source: Shah
ne: शाह
sl: šar

# GENITIVE
source: Shahrivar
ne: शाह्रिभर
sl: šarivar

# INSTRUMENTAL
source: Shahrivar
ne: शाह्रिभर
sl: šarivar

# LOCATIVE
source: Shahrivar
ne: शाह्रिभर
sl: šarivar

# GENITIVE
source: Shawwal
ne: साववाल
sl: šewal

# INSTRUMENTAL
source: Shawwal
ne: साववाल
sl: šewal

# LOCATIVE
source: Shawwal
ne: साववाल
sl: šewal

# NOMINATIVE
source: Shawwal
ne: साववाल
sl: šewal

# GENITIVE
source: Sha’aban
ne: शाबान
sl: šaban

# INSTRUMENTAL
source: Sha’aban
ne: शाबान
sl: šaban

# LOCATIVE
source: Sha’aban
ne: शाबान
sl: šaban

# NOMINATIVE
source: Sha’aban
ne: शाबान
sl: šaban

# GENITIVE
source: Shevat
ne: शेवत
sl: šebat

# INSTRUMENTAL
source: Shevat
ne: शेवत
sl: šebat

# LOCATIVE
source: Shevat
ne: शेवत
sl: šebat

source: Short version
cy: Fersiwn byr
sl: Kratka različica

source: Show only individuals for whom the gender is not known.
cy: Dangos dim ond unigolion nad yw eu rhyw yn hysbys.
ko: 성별이 알려지지 않은 인물만 표시합니다.
sl: Pokaži samo osebe, katerih spol ni znan.

source: Show statistics charts
cy: Dangos siartiau ystadegau
sl: Pokaži statistične diagrame

source: Sitemaps are a way for webmasters to tell search engines about the pages on a website that are available for crawling. All major search engines support sitemaps. For more information, see <a href="http://www.sitemaps.org/">www.sitemaps.org</a>.
cy: Mae mapiau gwefan yn ffordd i wefeistri 1ddweud wrth beiriannau chwilio am y tu1dalennau ar wefan sydd ar gael i'w cropian. Mae pob prif beiriant chwilio yn cefnogi mapiau gwefan. Am ragor o wybodaeth, gweler <a href="http://www.sitemaps.org/">www.sitemaps.org</a> .1
sl: Zemljevidi spletišč so način, s katerim lahko skrbniki spletišč obvestijo iskalnike o straneh na spletišču, ki so na voljo za indeksiranje. Vsi večji iskalniki podpirajo zemljevide spletišč. Za več informacij si oglejte <a href="https://www.sitemaps.org/">www.sitemaps.org</a>.

source: Some genealogy applications store all names in a single name record, using custom tags such as _MARNM and _AKA. An alternative is to create a new name record for each name.
cy: Mae rhai rhaglenni achyddiaeth yn storio pob enw mewn cofnod un enw, gan ddefnyddio tagiau personol fel _MARNM a _AKA. Dewis arall yw creu cofnod enw newydd ar gyfer pob enw.
sl: Nekateri rodoslovni programi shranjujejo vsa imena v enem samem zapisu imen z uporabo oznak po meri, kot sta _MARNM in _AKA. Druga možnost je, da za vsako ime ustvarite nov zapis imen.

source: Source citations can include fields to record the quality of the data (primary, secondary, etc.) and the date the event was recorded in the source. If you don’t use these fields, you can disable them when creating new source citations.
cy: Gall dyfyniadau ffynhonnell gynnwys meysydd i gofnodi ansawdd y data (cynradd, eilaidd, ac ati) a'r dyddiad y cofnodwyd y digwyddiad yn y ffynhonnell. Os nad ydych yn ddefnyddio'r meysydd hyn, gallwch eu hanalluogi wrth greu dyfyniadau ffynhonnell newydd.
sl: Navedki virov lahko vključujejo polja za beleženje kakovosti podatkov (primarni, sekundarni itd.) in datuma, ko je bil dogodek zabeležen v viru. Če teh polj ne uporabljate, jih lahko onemogočite pri ustvarjanju novih navedkov virov.

source: Spouse note
cy: Nodyn priod
sl: Opomba o zakoncu

source: Stillborn
cy: Marw-anedig
sl: Mrtvorojen/a

source: Surnames are inflected to indicate an individual’s gender and marital status.
cy: Mae cyfenwau wedi'u ffurfdroi i nodi rhyw a statws priodasol unigolyn.
ko: 가문이름은 개인의 성별과 결혼 상태를 나타내기 위해 활용됩니다.
sl: Priimki se sklanjajo, da označujejo spol in zakonski stan osebe.

source: Surnames are inflected to indicate an individual’s gender.
cy: Mae cyfenwau wedi'u ffurfdroi i ddynodi rhyw unigolyn.
ko: 가문이름은 개인의 성별을 나타내기 위해 활용됩니다.
sl: Priimki se sklanjajo, da označujejo spol osebe.

source: The most common repository facts are listed separately, so that they can be added more easily.
cy: Mae'r ffeithiau storfannau mwyaf cyffredin yn cael eu cadw ar wahân, fel y mae modd eu hychwanegu'n haws.
sl: Najpogostejša dejstva o skladišču so navedena ločeno, da jih je lažje dodati.

source: The most common source facts are listed separately, so that they can be added more easily.
cy: Rhestrir y ffeithiau ffynhonnell mwyaf cyffredin ar wahân, fel y mae modd eu hychwanegu'n haws.
sl: Najpogostejša dejstva o virih so navedena ločeno, da jih je lažje dodati.

source: The problem
cy: Y broblem
sl: Problem

source: The record has been copied to the clipboard.
cy: Copïwyd y cofnod i'r clipfwrdd.
sl: Zapis je bil shranjen v odložišče.

source: The website www.geonames.org provides a large database of place names. This can be searched when entering new places. To use this feature, you must register for a free account at www.geonames.org and provide the username.
cy: Mae'r wefan www.geonames.org yn darparu cronfa ddata fawr o enwau lleoedd. Gellir chwilio hwn wrth fynd i mewn i leoedd newydd. I ddefnyddio'r nodwedd hon, rhaid i chi gofrestru am gyfrif rhad ac am ddim yn www.geonames.org a darparu'r enw defnyddiwr.
sl: Spletna stran www.geonames.org ponuja veliko podatkovno zbirko krajevnih imen. To lahko iščete pri vnosu novih krajev. Če želite uporabljati to funkcijo, se morate na www.geonames.org registrirati za brezplačen račun in vnesti uporabniško ime.

source: This could be caused by an error at %s
cy: Gallai hyn gael ei achosi gan wall yn %s
sl: To bi lahko povzročila napaka na %s

source: This is a comma separated list of GEDCOM fact tags that will be shown on the add/edit name form. If you use non-Latin alphabets such as Hebrew, Greek, Cyrillic, or Arabic, you may want to add tags such as _HEB, ROMN, FONE, etc. to allow you to store names in several different alphabets.
cy: Mae hon yn rhestr sydd wedi'i gwahanu gan goma o dagiau ffeithiau GEDCOM fydd yn cael eu dangos ar y ffurflen ychwanegu/golygu enw. Os ydych chi'n defnyddio wyddor nad yw'n Lladin fel Hebraeg, Groeg, Cyrillig, neu Arabeg, efallai y bydd angen i chi ychwanegu tagiau fel _HEB, ROMN, FONE, ac ati i'ch galluogi i storio enwau mewn sawl wyddor wahanol.
sl: To je seznam oznak dejstev GEDCOM, ločenih z vejicami, ki bodo prikazane na obrazcu za dodajanje/urejanje imena. Če uporabljate ne-latinske abecede, kot so hebrejščina, grščina, cirilica ali arabščina, boste morda želeli dodati oznake, kot so _HEB, ROMN, FONE itd., da boste lahko shranjevali imena v več različnih abecedah.

source: This is a comma separated list of GEDCOM fact tags that will be shown when adding a new family. For example, if MARR is in the list, then fields for marriage date and marriage place will be shown on the form.
cy: Mae hon yn rhestr sydd wedi'i gwahanu gan goma o dagiau ffeithiau GEDCOM a fydd yn cael eu dangos wrth ychwanegu teulu newydd. Er enghraifft, os yw MARR ar y rhestr, yna bydd meysydd ar gyfer dyddiad priodas a lle priodas yn cael eu dangos ar y ffurflen.
sl: To je seznam oznak dejstev GEDCOM, ločenih z vejicami, ki bodo prikazane pri dodajanju nove družine. Če je na primer MARR na seznamu, se bodo na obrazcu prikazala polja za datum in kraj poroke.

source: This is a comma separated list of GEDCOM fact tags that will be shown when adding a new individual. For example, if BIRT is in the list, fields for birth date and birth place will be shown on the form.
cy: Mae hon yn rhestr sydd wedi'i gwahanu gan goma o dagiau ffeithiau GEDCOM sy'n cael ei dangos wrth ychwanegu unigolyn newydd. Er enghraifft, os yw BIRT yn y rhestr, mae meysydd dyddiad geni a man geni yn cael eu dangos ar y ffurflen.
sl: To je seznam oznak dejstev GEDCOM, ločenih z vejicami, ki bodo prikazane pri dodajanju nove osebe. Če je na primer BIRT na seznamu, bodo na obrazcu prikazana polja za datum rojstva in kraj rojstva.

source: This is a comma separated list of GEDCOM fact tags that will be shown when you add or edit place names. If you use non-Latin alphabets such as Hebrew, Greek, Cyrillic, or Arabic, you may want to add tags such as _HEB, ROMN, FONE, etc. to allow you to store place names in several different alphabets.
cy: Mae hon yn rhestr sydd wedi'i gwahanu gan goma o dagiau ffeithiau GEDCOM fydd yn cael eu dangos pan fyddwch yn ychwanegu neu'n golygu enwau lleoedd. Os ydych chi'n defnyddio wyddor nad yw'n Lladin fel Hebraeg, Groeg, Cyrillig, neu Arabeg, efallai y bydd angen i chi ychwanegu tagiau fel _HEB, ROMN, FONE, ac ati i'ch galluogi i storio enwau lleoedd mewn sawl wyddor wahanol.
sl: To je seznam z vejicami ločenih oznak dejstev GEDCOM, ki bodo prikazane, ko boste dodajali ali urejali imena krajev. Če uporabljate ne-latinske abecede, kot so hebrejščina, grščina, cirilica ali arabščina, boste morda želeli dodati oznake, kot so _HEB, ROMN, FONE itd., da boste lahko shranjevali imena krajev v več različnih abecedah.

source: This is case sensitive.
cy: Mae hyn yn sensitif fait nodau.
sl: To razlikuje med velikimi in malimi črkami.

source: This is the list of GEDCOM facts that your users can add to families. You can modify this list by removing or adding fact names, even custom ones, as necessary. Fact names that appear in this list must not also appear in the “Unique family facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu at deuluoedd. Gallwch addasu'r rhestr hon trwy dynnu neu ychwanegu enwau ffeithiau, hyd yn oed rhai cyfaddas, yn ôl yr angen. Rhaid i enwau ffeithiau sy'n ymddangos ar y rhestr hon beidio hefyd ag ymddangos yn y rhestr “Ffeithiau teulu unigryw”.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki dodajo družinam. Ta seznam lahko po potrebi spremenite tako, da odstranite ali dodate imena dejstev, tudi po meri. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Edinstvena dejstva družine”.

source: This is the list of GEDCOM facts that your users can add to individuals. You can modify this list by removing or adding fact names, even custom ones, as necessary. Fact names that appear in this list must not also appear in the “Unique individual facts” list.
cy: Dyma'r rhestr o ffeithiau GEDCOM y gall eich defnyddwyr eu hychwanegu at unigolion. Gallwch addasu'r rhestr hon trwy dynnu neu ychwanegu enwau ffeithiau, hyd yn oed rhai cyfaddas, yn ôl yr angen. Rhaid i enwau ffeithiau sy'n ymddangos ar y rhestr hon beidio ag ymddangos yn y rhestr “Ffeithiau unigol unigryw” hefyd.
sl: To je seznam dejstev GEDCOM, ki jih lahko vaši uporabniki dodajo posameznikom. Ta seznam lahko po potrebi spremenite tako, da odstranite ali dodate imena dejstev, tudi po meri. Imena dejstev, ki se pojavijo na tem seznamu, se ne smejo pojaviti tudi na seznamu “Edinstvena dejstva posameznika”.
