Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: This account has not been verified. Please check your email for a verification message.
cy: Nid yw'r cyfrif hwn wedi'i wirio. Gwiriwch eich e-bost am neges ddilysu.
hy: Այս հաշիվը չի հաստատվել: Խնդրում ենք ստուգել ձեր էլ.փոստը հաստատման հաղորդագրության համար:
ko: 이 계정은 확인되지 않았습니다. 이메일에서 확인 메시지를 확인하십시오.
ne: यो खाता प्रमाणित गरिएको छैन। प्रमाणिकरण सन्देशको लागि कृपया आफ्नो इमेल जाँच गर्नुहोस्।
sl: Ta račun ni bil overjen. Preverite svojo e-pošto za potrditveno sporočilo.

source: This account has not been approved. Please wait for an administrator to approve it.
cy: Nid yw'r cyfrif hwn wedi'i gymeradwyo. Arhoswch i weinyddwr ei gymeradwyo.
hy: Այս հաշիվը չի հաստատվել: Խնդրում ենք սպասել, որ ադմինիստրատորը հաստատի այն:
ko: 이 계정은 승인되지 않았습니다. 관리자가 승인 할 때까지 기다리십시오.
ne: यो खाता स्वीकृत भएको छैन। कृपया यसलाई अनुमोदन गर्न प्रशासकको लागि पर्खनुहोस्।
sl: Ta račun ni bil odobren. Počakajte, da ga odobri skrbnik.

source: Sign in
cy: Mewngofnodi
hy: Մուտք գործեք
ko: 로그인
ne: लगईन
sl: Prijava

source: Anyone with a user account can access this website.
cy: Gall unrhyw un sydd â chyfrif defnyddiwr gael mynediad i'r wefan hon.
hy: Յուրաքանչյուր ոք, ով ունի օգտվողի հաշիվ, կարող է մուտք գործել այս կայք:
ko: 사용자 계정이 있는 사람은 누구나 이 웹사이트에 액세스할 수 있습니다.
ne: प्रयोगकर्ता खाता भएका जो कोहीले यो वेबसाइट पहुँच गर्न सक्छन्।
sl: Kdorkoli z uporabniškim računom lahko dostopa do spletišča.

source: You need to be an authorized user to access this website.
cy: Mae angen i chi fod yn ddefnyddiwr awdurdodedig i gael mynediad i'r wefan hon.
hy: Այս կայք մուտք գործելու համար դուք պետք է լիազորված օգտատեր լինեք:
ko: 이 웹 사이트에 액세스하려면 인증 된 사용자 여야합니다.
ne: तपाईं यो वेबसाइट पहुँच गर्न एक अधिकृत प्रयोगकर्ता हुन आवश्यक छ।
sl: Za dostop do tega spletišča morate biti pooblaščen uporabnik.

source: You need to be a family member to access this website.
cy: Mae angen i chi fod yn aelod o'r teulu i gael mynediad i'r wefan hon.
hy: Այս կայք մուտք գործելու համար դուք պետք է ընտանիքի անդամ լինեք:
ko: 이 웹 사이트에 접속하려면 가족 구성원이어야합니다.
ne: यो वेबसाइट पहुँच गर्नको लागि तपाइँ परिवारको सदस्य हुन आवश्यक छ।
sl: Za dostop do tega spletišča morate biti družinski član.

source: You can apply for an account using the link below.
cy: Gallwch wneud cais am gyfrif gan ddefnyddio'r ddolen isod.
hy: Դուք կարող եք դիմել ստորև նշված հղման միջոցով:
ko: 아래 링크를 사용하여 계정을 신청할 수 있습니다.
ne: तपाईले तलको लिङ्क प्रयोग गरेर खाताको लागि आवेदन दिन सक्नुहुन्छ।
sl: Na spodnji povezavi lahko zaprosite za uporabniški račun.

source: You have signed out.
cy: Rydych chi wedi allgofnodi.
hy: Դուք դուրս եք եկել:
ko: 로그아웃 했습니다.
ne: तपाईंले साइन आउट गर्नुभएको छ।
sl: Odjavili ste se.

source: Create
cy: Creu
hy: Ստեղծել
ko: 만들기
ne: सिर्जना गर्नुहोस्
sl: Ustvari

source: Are you sure you want to delete “%s”?
cy: Ydych chi'n siŵr eich bod eisiau dileu %s?
hy: Իսկապե՞ս ուզում եք ջնջել «%s»-ը?
ko: “%s”을 (를) 삭제 하시겠습니까?
ne: के तपाइँ “%s” मेटाउन निश्चित हुनुहुन्छ ?
sl: Ste prepričani, da želite izbrisati “%s”?

source: Delete
cy: Dileu
hy: Ջնջել
ko: 삭제
ne: मेट्नुहोस्
sl: Izbriši

source: There are no links to this media object.
cy: Nid oes unrhyw ddolenni â'r gwrthrych cyfryngau hwn.
hy: Այս մեդիա օբյեկտի հղումներ չկան:
ko: 이 미디어 객체에 대한 링크가 없습니다.
ne: यस मिडिया वस्तुमा कुनै लिङ्कहरू छैनन्।
sl: Do tega medijskega predmeta ni povezav.

source: %s KB
hy: %s ԿԲ
ne: %s केबी

source: Image dimensions
cy: Dimensiynau delwedd
hy: Պատկերի չափերը
ko: 이미지 크기
ne: छवि आयामहरू
sl: Dimenzije slike

source: %1$s × %2$s pixels
cy: %1$s × %2$s picsel
hy: %1$s × %2$s պիքսել
ko: %1$s × %2$s 픽셀
ne: %1$s × %2$s पिक्सेल
sl: %1$s × %2$s pikslov

source: Manage media
cy: Rheoli cyfryngau
hy: Կառավարեք լրատվամիջոցները
ko: 미디어 관리
ne: मिडिया प्रबन्ध गर्नुहोस्
sl: Upravljanje medijskih datotek

source: Manage family trees
cy: Rheoli achau teuluol
hy: Կառավարեք տոհմածառերը
ko: 가계도 관리
ne: पारिवारिक वृक्षहरू व्यवस्थापन गर्नुहोस्
sl: Upravljanje družinskih dreves

source: World
cy: Y Byd
hy: Աշխարհ
ko: 세계
ne: विश्व
sl: Svet

source: Add
cy: Ychwanegu
hy: Ավելացնել
ko: 추가
ne: थप्नुहोस्
sl: Dodaj

source: Geographic data
cy: Data daearyddol
hy: Աշխարհագրական տվյալներ
ko: 지리 데이터
ne: भौगोलिक आंकडा
sl: Geografski podatki

source: Edit
cy: Golygu
hy: Խմբագրել
ko: 편집
ne: सच्याउनुहोस्
sl: Uredi

source: No file was received.
hy: Ոչ մի ֆայլ չի ստացվել:
ne: कुनै फाइल प्राप्त भएको छैन।

source: locations updated: %s, locations added: %s
cy: lleoliadau wedi'u diweddaru: %s, lleoliadau wedi'u hychwanegu: %s
hy: տեղադրությունները թարմացվել են՝ %s, ավելացված վայրերը՝ %s
ko: 업데이트된 위치: %s, 추가된 위치: %s
sl: posodobljenih lokacij: %s, dodanih lokacij: %s

source: Import geographic data
cy: Mewnforio data daearyddol
hy: Ներմուծեք աշխարհագրական տվյալներ
ko: 지리데이터 가져오기
ne: भौगोलिक डाटा ल्याउनुहोस्
sl: Uvoz geografskih podatkov

source: The link from “%1$s” to “%2$s” has been updated.
cy: Mae'r ddolen o “%1$s” i “%2$s” wedi'i diweddaru.
hy: «%1$s»-ից «%2$s»-ի հղումը թարմացվել է:
ko: “%1$s”에서“%2$s”로의 링크가 업데이트되었습니다.
ne: "%1$s" देखि "%2$s" सम्मको लिङ्क अद्यावधिक गरिएको छ।
sl: Povezava med “%1$s” in “%2$s” je posodobljena.

source: The records “%1$s” and “%2$s” have been merged.
cy: Mae'r cofnodion “%1$s” ac “%2$s” wedi'u cyfuno.
hy: «%1$s» և «%2$s» գրառումները միավորվել են:
ko: “%1$s” 및 “%2$s” 레코드가 병합되었습니다.
ne: रेकर्डहरू "%1$s" र "%2$s" मर्ज गरिएका छन्।
sl: Zapisa “%1$s” in “%2$s” sta združena.

source: Merge records
cy: Cyfuno cofnodion
hy: Միավորել գրառումները
ko: 레코드 병합
ne: रेकर्डहरू मर्ज गर्नुहोस्
sl: Združi zapise

source: The family trees have been merged successfully.
cy: Mae'r achau teuluol wedi'u cyfuno'n llwyddiannus.
hy: Տոհմածառերը հաջողությամբ միավորվել են:
ko: 가계도가 성공적으로 병합되었습니다.
ne: पारिवारिक रूखहरू सफलतापूर्वक मर्ज गरिएको छ।
sl: Družinska drevesa so uspešno združena.

source: Merge family trees
cy: Cyfuno achau teuluol
hy: Միավորել տոհմածառերը
ko: 가계도 병합
ne: पारिवारिक रूखहरू मर्ज गर्नुहोस्
sl: Združi družinska drevesa

source: The preferences for the module “%s” have been deleted.
cy: Mae'r dewisiadau ar gyfer y modiwl “%s” wedi'u dileu.
hy: «%s» մոդուլի նախապատվությունները ջնջվել են:
ko: 모듈 “%s”의 기본 설정이 삭제되었습니다.
ne: मोड्युल "%s" को लागि प्राथमिकताहरू मेटाइएको छ।
sl: Nastavitve modula “%s” so izbrisane.

source: All modules
cy: Pob modiwl
hy: Բոլոր մոդուլները
ko: 모든 모듈
ne: सबै मोड्यूलहरू
sl: Vsi moduli

source: Tracking and analytics
cy: Tracio a dadansoddeg
hy: Հետևում և վերլուծություն
ko: 추적 및 분석
ne: ट्र्याकिङ र विश्लेषण
sl: Sledenje in analitika

source: If you use one of the following tracking and analytics services, webtrees can add the tracking codes automatically.
cy: Os ydych chi'n defnyddio un o'r gwasanaethau tracio a dadansoddeg canlynol, gall gwefannau ychwanegu'r codau tracio'n awtomatig.
hy: Եթե դուք օգտագործում եք հետևյալ հետևման և վերլուծական ծառայություններից մեկը, webtrees-ը կարող է ավտոմատ կերպով ավելացնել հետագծման կոդերը:
ko: 다음 추적 및 분석 서비스 중 하나를 사용하는 경우 웹트리에서 자동으로 추적 코드를 추가할 수 있습니다.
ne: यदि तपाइँ निम्न मध्ये कुनै एक ट्र्याकिङ र एनालिटिक्स सेवाहरू प्रयोग गर्नुहुन्छ भने, वेबट्रीहरूले स्वचालित रूपमा ट्र्याकिङ कोडहरू थप्न सक्छन्।
sl: Če uporabljate eno od naslednjih storitev sledenja in analitike, lahko webtrees samodejno doda kodo za sledenje.

source: Blocks
cy: Blociau
hy: Բլոկներ
ko: 블록
ne: खण्ड
sl: Bloki

source: Charts
cy: Siartiau
hy: Գծապատկերներ
ko: 차트
ne: चार्टहरू
sl: Diagrami

source: Footers
cy: Troedynnau
hy: Ֆուտերներ
ko: Footer
ne: फूटरहरू
sl: Noge

source: Historic events
cy: Digwyddiadau hanesyddol
hy: Պատմական իրադարձություններ
ko: 역사적 이벤트
ne: ऐतिहासिक घटनाहरू
sl: Zgodovinski dogodki

source: Languages
cy: Ieithoedd
hy: Լեզուներ
ko: 언어
ne: भाषाहरू
sl: Jeziki

source: Lists
cy: Rhestrau
hy: Ցուցակներ
ko: 목록
ne: सूची
sl: Seznami

source: Autocomplete
hy: Ավտոլրացում
ko: 자동완성
ne: स्वत: पूर्ण

source: Search for place names in an external database.
hy: Որոնեք տեղանունները արտաքին տվյալների բազայում:
ko: 외부 데이터베이스에서 장소 이름을 검색합니다.
ne: बाह्य डाटाबेसमा ठाउँको नाम खोज्नुहोस्।

source: Geolocation
hy: Երկրաբաշխություն
ko: 지리적 위치
ne: भौगोलिक स्थान

source: Search for locations in an external database.
hy: Որոնեք վայրեր արտաքին տվյալների բազայում:
ko: 외부 데이터베이스에서 위치를 검색합니다.
ne: बाह्य डाटाबेसमा स्थानहरू खोज्नुहोस्।

source: Map links
hy: Քարտեզի հղումներ
ko: 지도 링크
ne: नक्सा लिङ्कहरू

source: Show the location of an event on an external map.
hy: Ցույց տալ իրադարձության գտնվելու վայրը արտաքին քարտեզի վրա:
ko: 이벤트의 위치를 외부 지도에 표시합니다.
ne: बाह्य नक्सामा घटनाको स्थान देखाउनुहोस्।

source: Map providers
hy: Քարտեզների մատակարարներ
ko: 지도 제공자
ne: नक्सा प्रदायकहरू

source: Use maps in webtrees.
hy: Օգտագործեք քարտեզներ վեբ ծառերում:
ko: webtree에서 지도를 사용합니다.
ne: Webtrees मा नक्सा प्रयोग गर्नुहोस्।

source: Menus
cy: Dewislenni
hy: Մենյուներ
ko: 메뉴
ne: सुचिहरु
sl: Meniji

source: Reports
cy: Adroddiadau
hy: Հաշվետվություններ
ko: 보고서
ne: रिपोर्टहरू
sl: Poročila

source: Shares
hy: Բաժնետոմսեր
ko: 주식
ne: शेयरहरू

source: Sidebars
cy: Barau Ochr
hy: Կողային գոտիներ
ko: 사이드바
ne: साइडबारहरू
sl: Stranske vrstice

source: Tabs
cy: Tabiau
hy: Ներդիրներ
ko: 탭
ne: ट्याबहरु
sl: Zavihki

source: Themes
cy: Themâu
hy: Թեմաներ
ko: 테마
ne: थिमहरू
sl: Teme

source: Request a new password
cy: Gofyn am gyfrinair newydd
hy: Պահանջել նոր գաղտնաբառ
ko: 새 암호 요청
ne: नयाँ पासवर्डका लागि अनुरोध
sl: Zahtevaj novo geslo

source: A password reset link has been sent to “%s”.
cy: Mae dolen ailosod cyfrinair wedi'i hanfon at “%s”.
hy: Գաղտնաբառի վերակայման հղումն ուղարկվել է «%s»-ին:
ko: 암호 재설정 링크가 "%s"(으)로 전송되었습니다.
ne: पासवर्ड रिसेट गर्ने लिंक “%s” मा पठाइएको छ ।
sl: Povezava za ponastavitev gesla je poslana na “%s”.

source: This link is valid for one hour.
cy: Mae'r ddolen hon yn ddilys am awr.
hy: Այս հղումը գործում է մեկ ժամ:
ko: 이 링크는 1 시간 동안 유효합니다.
ne: यो लिंकले १ घन्टासम्म मात्रै काम गर्छ ।
sl: Ta povezava bo veljavna eno uro.

source: Your password has been updated.
cy: Mae eich cyfrinair wedi'i ddiweddaru.
hy: Ձեր գաղտնաբառը թարմացվել է:
ko: 비밀번호가 업데이트되었습니다.
ne: तपाईको पासवर्ड अपडेट भयो ।
sl: Vaše geslo je posodobljeno.

source: The password reset link has expired.
cy: Mae dolen ailosod cyfrinair wedi dod i ben.
hy: Գաղտնաբառի վերակայման հղման ժամկետը սպառվել է:
ko: 비밀번호 재설정 링크가 만료되었습니다.
ne: पासवर्ड रिसेट लिङ्कको म्याद सकिएको छ।
sl: Povezava za ponastavitev gesla je potekla.

source: Set a new password
cy: Gosod cyfrinair newydd
hy: Սահմանեք նոր գաղտնաբառ
ko: 새로운 비밀번호 설정
ne: नयाँ पासवर्ड सेट गर्नुहोस्
sl: Nastavi novo geslo

source: “%s” has been deleted.
cy: Mae “%s” wedi’i ddileu.
hy: «%s»-ը ջնջվել է:
ko: "%s"가 삭제되었습니다.
ne: "%s" मेटाइएको छ।
sl: “%s” je izbrisano.

source: The changes to “%s” have been accepted.
cy: Derbyniwyd y newidiadau i “%s”.
hy: «%s»-ի փոփոխություններն ընդունվել են:
ko: “%s”에 대한 변경이 승인되었습니다.
ne: "%s" मा परिवर्तनहरू स्वीकार गरिएको छ।
sl: Spremembe “%s” so sprejete.

source: Changes log
cy: Cofnod newidiadau
hy: Փոփոխությունների մատյան
ko: 변경 기록
ne: लग परिवर्तन
sl: Dnevnik sprememb

source: accepted
cy: derbyniwyd
hy: ընդունված
ko: 인정됨
ne: स्वीकार गरियो
sl: Sprejeto

source: rejected
cy: gwrthodwyd
hy: մերժվել է
ko: 거부
ne: अस्वीकार गरियो
sl: Zavrnjeno

source: pending
cy: arfaethedig
hy: սպասվում է
ko: 보류 중
ne: विचाराधीन
sl: Čakajoče

source: The changes to “%s” have been rejected.
cy: Gwrthodwyd y newidiadau i “%s”.
hy: «%s»-ի փոփոխությունները մերժվել են:
ko: “%s”에 대한 변경이 거부되었습니다.
ne: "%s" मा परिवर्तनहरू अस्वीकार गरिएको छ।
sl: Spremembe “%s” so zavrnjene.

source: Server information
cy: Manylion y gweinydd
hy: Սերվերի տեղեկատվություն
ko: 서버 정보
ne: सर्भर जानकारी
sl: Podatki o strežniku

source: Your registration at %s
cy: Eich cofrestriad yn %s
hy: Ձեր գրանցումը %s-ում
ko: %s에 등록
ne: %s मा तपाईंको दर्ता
sl: Registrirali ste se na strežniku %s

source: New registration at %s
cy: Cofrestriad newydd yn %s
hy: Նոր գրանցում %s-ում
ko: %s에서 신규 등록
ne: %s मा नयाँ दर्ता
sl: Nova registracija na strežniku %s

source: Request a new user account
cy: Cais am gyfrif defnyddiwr newydd
hy: Պահանջել նոր օգտվողի հաշիվ
ko: 새 사용자 계정 요청
ne: नयाँ प्रयोगकर्ताका लागि अनुरोध
sl: Zahtevaj nov uporabniški račun

source: All fields must be completed.
cy: Rhaid cwblhau pob maes.
hy: Բոլոր դաշտերը պետք է լրացվեն:
ko: 모든 필드를 작성해야 합니다.
ne: दिइएका सबै फिल्ड भर्नुपर्छ ।
sl: Izpolniti je treba vsa polja.

source: The server’s time limit has been reached.
cy: Mae terfyn amser y gweinydd wedi'i gyrraedd.
hy: Սերվերի ժամկետը լրացել է:
ko: 서버의 시간 제한에 도달했습니다.
ne: सर्भरको समय सीमा पुगेको छ।
sl: Časovna omejitev strežnika je dosežena.

source: Renumber XREFs
hy: Վերհամարակալել XREF-ները
ne: XREFs पुन: नम्बर

source: Re-order children
cy: Ail drefnu'r plant
hy: Նորից պատվիրեք երեխաներին
ko: 자녀 재정렬
ne: बच्चाहरुको क्रम मिलाऊ
sl: Razvrsti otroke

source: Re-order families
cy: Ail drefnu'r teuluoedd
hy: Վերադասավորեք ընտանիքները
ko: 가족 재정렬
ne: परिवारहरूलाई पुन: अर्डर गर्नुहोस्
sl: Razvrsti družine

source: Re-order names
cy: Ail drefnu'r enwau
hy: Վերահաստատեք անունները
ko: 이름 재정렬
ne: नामहरू पुन: अर्डर गर्नुहोस्
sl: Razvrsti imena

source: Report
cy: Adroddiad
hy: Հաշվետվություն
ko: 보고서
ne: रिपोर्ट
sl: Poročilo

source: Choose a report to run
cy: Dewis adroddiad i'w rhedeg
hy: Ընտրեք հաշվետվություն գործարկման համար
ko: 실행할 보고서 선택
ne: चलाउनको लागि रिपोर्ट छान्नुहोस्
sl: Izberi želeno poročilo

source: Advanced search
cy: Chwilio manwl
hy: Ընդլայնված որոնում
ko: 확장 검색
ne: उन्नत खोज
sl: Napredno iskanje

source: Exact date
cy: Union ddyddiad
hy: Ճշգրիտ ամսաթիվ
ko: 정확한 날짜
ne: ठ्याक्कै मिति
sl: Natančen datum

source: ±%s year
cy: ±%s blynyddoedd
hy: ±%s տարի
ko: ±%s 년
ne: ±%s वर्ष
sl: ±%s leto

source: Exact
cy: Union
hy: Ճշգրիտ
ko: 정확한
ne: ठ्याक्कै
sl: Natančno

source: Begins with
cy: Cychwyn gyda
hy: Սկսվում է
ko: 시작
ne: बाट सुरु हुन्छ
sl: Začetek vsebuje

source: Contains
cy: Yn cynnwys
hy: Պարունակում է
ko: 포함
ne: समावेश गर्दछ
sl: Vsebuje

source: Sounds like
cy: Yn swnio fel
hy: Հնչում է
ko: 처럼 들린다
ne: जस्तो लाग्छ
sl: Zveni kot

source: General search
cy: Chwilio cyffredinol
hy: Ընդհանուր որոնում
ko: 일반 검색
ne: साधारण खोजी
sl: Splošno iskanje

source: Phonetic search
cy: Chwilio ffonetig
hy: Հնչյունական որոնում
ko: 발음(소리 나는) 검색
ne: फोनेटिक खोजी
sl: Fonetično iskanje

source: %s individual has been updated.
cy: Mae %s unigolion wedi'u diweddaru.
hy: %s անհատը թարմացվել է:
ko: %s 인물의 정보가 업데이트 되었습니다.
ne: %s व्यक्ति अपडेट गरिएको छ ।
sl: %s oseba je posodobljena.

source: %s family has been updated.
cy: Mae %s teuluoedd wedi'u diweddaru.
hy: %s ընտանիքը թարմացվել է:
ko: %s 가족이 업데이트 되었습니다.
ne: %s परिवार अपडेट भयो ।
sl: %s družina je posodobljena.

source: %s repository has been updated.
cy: Mae %s storfannau wedi'u diweddaru.
hy: %s պահոցը թարմացվել է:
ko: %s 의 저장소가 업데이트 되었습니다.
ne: %s भण्डार अद्यावधिक गरिएको छ।
sl: %s skladišče je posodobljeno.

source: %s source has been updated.
cy: Mae %s ffynonnellau wedi'u diweddaru.
hy: %s աղբյուրը թարմացվել է:
ko: %s 출처가 업데이트 되었습니다.
ne: %s स्रोत अद्यावधिक गरिएको छ।
sl: %s vir je posodobljen.

source: %s note has been updated.
cy: Mae %s nodiadau wedi'u diweddaru.
hy: %s նշումը թարմացվել է:
ko: %s 의 노트가 업데이트 되었습니다.
ne: %s नोट अपडेट गरिएको छ ।
sl: %s opomba je posodobljena.

source: Search and replace
cy: Chwilio ac amnewid
hy: Որոնել և փոխարինել
ko: 검색 및 교체
ne: खोज्नुहोस र बदल्नुहोस्
sl: Najdi in zamenjaj

source: The family tree “%s” will be shown to visitors when they first arrive at this website.
cy: Bydd cart achau “%s” yn cael ei dangos i ymwelwyr pan fyddan nhw'n cyrraedd y wefan hon gyntaf.
hy: «%s» տոհմածառը կցուցադրվի այցելուներին, երբ նրանք առաջին անգամ գան այս կայք:
ko: 이 웹 사이트에 처음 방문하면 가계도 “%s”이(가) 방문자에게 표시됩니다.
ne: परिवार रूख "%s" आगन्तुकहरूलाई देखाइनेछ जब तिनीहरू पहिलो पटक यस वेबसाइटमा आइपुग्छन्।
sl: Družinsko drevo “%s” bo prikazano obiskovalcem, ko prvič obiščejo to spletišče.

source: Oops! webtrees was unable to create files in this folder.
cy: Wps! nid oedd webtrees yn gallu creu ffeiliau yn y ffolder hon.
hy: Վա՜յ webtrees-ը չկարողացավ ֆայլեր ստեղծել այս թղթապանակում:
ko: 앗! webtrees는 이 폴더에 파일을 생성할 수 없습니다.
ne: उफ्! webtrees यस फोल्डरमा फाइलहरू सिर्जना गर्न असमर्थ थियो।
sl: webtrees ne more ustvariti datotek v tej mapi.

source: This usually means that you need to change the folder permissions to 777.
cy: Mae hyn fel arfer yn golygu bod angen i chi newid y caniatâd y ffolder i 777.
hy: Սա սովորաբար նշանակում է, որ դուք պետք է փոխեք թղթապանակի թույլտվությունները 777-ի:
ko: 이것은 일반적으로 퍼미션을 777로 변경해야 함을 의미합니다.
ne: यसको मतलब सामान्यतया तपाईले फोल्डर अनुमतिहरू 777 मा परिवर्तन गर्न आवश्यक छ।
sl: To običajno pomeni, da morate spremeniti dovoljenja mape na 777.

source: You must enter all the administrator account fields.
cy: Rhaid i chi llanw'r holl feysydd cyfrif gweinyddwr.
hy: Դուք պետք է մուտքագրեք ադմինիստրատորի հաշվի բոլոր դաշտերը:
ko: 모든 관리자 계정 필드를 입력해야합니다.
ne: तपाईंले सबै प्रशासक खाता क्षेत्रहरू प्रविष्ट गर्नुपर्छ।
sl: Izpolniti morate vsa polja skrbniškega računa.

source: The password needs to be at least six characters long.
cy: Rhaid i'r cyfrinair fod o leiaf chwe nod o hyd.
hy: Գաղտնաբառը պետք է լինի առնվազն վեց նիշ:
ko: 비밀번호는 6자 이상이어야합니다.
ne: पासवर्ड कम्तिमा ६ अक्षर लामो हुनु आवश्यक छ।
sl: Geslo mora biti dolgo vsaj šest znakov.

source: Website logs
cy: Cofnodion gwefan
hy: Կայքի տեղեկամատյաններ
ko: 웹사이트 로그
ne: वेबसाइट लगहरू
sl: Dnevniki spletišča

source: Cannot write to the folder “%s”.
hy: Հնարավոր չէ գրել «%s» թղթապանակում:
ne: "%s" फोल्डरमा लेख्न सकिँदैन।

source: The folder “%s” does not exist.
cy: Nid yw'r ffolder “%s” yn bodoli.
hy: «%s» պանակը գոյություն չունի:
ko: “%s”폴더가 없습니다.
ne: फोल्डर "%s" अवस्थित छैन।
sl: Mapa “%s” ne obstaja.

source: Website preferences
cy: Dewisiadau gwefan
hy: Կայքի նախապատվությունները
ko: 웹사이트 환경설정
ne: वेबसाइट प्राथमिकताहरू
sl: Nastavitve spletišča

source: Sign-in and registration
cy: Mewngofnodi a chofrestru
hy: Մուտք և գրանցում
ko: 로그인 및 등록
ne: साइन इन र दर्ता
sl: Prijava in registracija

source: No predefined text
cy: Dim testun wedi'i ddiffinio ymlaen llaw
hy: Նախապես սահմանված տեքստ չկա
ko: 사전 정의된 텍스트 없음
ne: कुनै पूर्वनिर्धारित पाठ छैन
sl: Ni prednastavljenega besedila

source: Predefined text that states all users can request a user account
cy: Testun wedi'i ddiffinio ymlaen llaw sy'n nodi y gall pob defnyddiwr ofyn am gyfrif defnyddiwr
hy: Նախապես սահմանված տեքստ, որը նշում է, որ բոլոր օգտվողները կարող են պահանջել օգտվողի հաշիվ
ko: 모든 사용자가 사용자 계정을 요청할 수있는 사전 정의 된 텍스트
ne: पूर्वनिर्धारित पाठ जसले सबै प्रयोगकर्ताहरूले प्रयोगकर्ता खाता अनुरोध गर्न सक्छन् भनी बताउँछ
sl: Vnaprej določeno besedilo, da lahko vsi uporabniki zahtevajo uporabniški račun

source: Predefined text that states admin will decide on each request for a user account
cy: Bydd testun wedi'i ddiffinio ymlaen llaw sy'n datgan admin yn penderfynu ar bob cais am gyfrif defnyddiwr
hy: Նախապես սահմանված տեքստ, որը նշում է, որ ադմինիստրատորը կորոշի օգտվողի հաշվի յուրաքանչյուր հարցում
ko: 관리자가 사용자 계정에 대한 각 요청을 결정할 미리 정의 된 텍스트
ne: पूर्वनिर्धारित पाठ जसले प्रयोगकर्ता खाताको लागि प्रत्येक अनुरोधमा प्रशासकले निर्णय गर्नेछ भन्ने बताउँछ
sl: Vnaprej določeno besedilo, da bo skrbnik odločal o vsaki zahtevi za uporabniški račun

source: Predefined text that states only family members can request a user account
cy: Testun wedi'i ddiffinio ymlaen llaw sy'n datgan mai dim ond aelodau'r teulu all ofyn am gyfrif defnyddiwr
hy: Նախապես սահմանված տեքստ, որը նշում է, որ միայն ընտանիքի անդամները կարող են օգտատիրոջ հաշիվ պահանջել
ko: 가족구성원만 사용자 계정을 요청할 수 있는 사전 정의 된 텍스트
ne: परिवारका सदस्यहरूले मात्र प्रयोगकर्ता खाता अनुरोध गर्न सक्ने पूर्वनिर्धारित पाठ
sl: Vnaprej določeno besedilo, da lahko samo družinski člani zahtevajo uporabniški račun

source: Choose user defined welcome text typed below
cy: Dewiswch destun croeso wedi'i ddiffinio gan ddefnyddiwr wedi'i deipio isod
hy: Ընտրեք օգտվողի կողմից սահմանված ողջույնի տեքստը, որը մուտքագրված է ստորև
ko: 아래에 입력한 사용자 정의 환영 텍스트를 선택하십시오
ne: तल टाइप गरिएको प्रयोगकर्ता परिभाषित स्वागत पाठ चयन गर्नुहोस्
sl: Uporabniško določeno pozdravno besedilo po meri, vneseno spodaj

source: GEDCOM tags
hy: GEDCOM պիտակներ
ne: GEDCOM ट्यागहरू

source: The GEDCOM file “%s” has been imported.
cy: Mae'r ffeil GEDCOM “%s” wedi'i mewnforio.
hy: GEDCOM «%s» ֆայլը ներմուծվել է:
ko: GEDCOM 파일 “%s”을(를) 가져 왔습니다.
ne: GEDCOM फाइल "%s" आयात गरिएको छ।
sl: Datoteka GEDCOM “%s” je uvožena.

source: Preferences
cy: Dewisiadau
hy: Նախապատվություններ
ko: 환경설정
ne: प्राथमिकताहरू
sl: Nastavitve

source: Set the default blocks for new family trees
cy: Gosod y blociau rhagosodedig ar gyfer cart achau newydd
hy: Սահմանեք լռելյայն բլոկները նոր տոհմածառերի համար
ko: 새로운 가계도의 기본 블록을 설정하십시오
ne: नयाँ पारिवारिक रूखहरूको लागि पूर्वनिर्धारित ब्लकहरू सेट गर्नुहोस्
sl: Nastavitev privzetih blokov za nova družinska drevesa

source: Change the “Home page” blocks
cy: Newidiwch y blociau “Tudalen Cartref”
hy: Փոխեք «Գլխավոր էջի» բլոկները
ko: “Home page” 블록 변경
ne: गृह पृष्ठका ब्लकहरू परिवर्तन गर्नुहोस्
sl: Spremeni bloke na strani “Domača stran”

source: The preferences for the family tree “%s” have been updated.
cy: Mae'r dewisiadau ar gyfer y cart achau “%s” wedi'u diweddaru.
hy: «%s» տոհմածառի նախապատվությունները թարմացվել են:
ko: 가계도 “%s”의 환경 설정이 업데이트되었습니다.
ne: पारिवारिक रूख "%s" को लागि प्राथमिकताहरू अद्यावधिक गरिएको छ।
sl: Nastavitve družinskega drevesa “%s” so posodobljene.

source: The preferences for all family trees have been updated.
cy: Mae'r dewisiadau ar gyfer pob cart achau wedi'u diweddaru.
hy: Բոլոր տոհմածառերի նախապատվությունները թարմացվել են:
ko: 모든 가계도에 대한 환경 설정이 업데이트되었습니다.
ne: सबै पारिवारिक रूखहरूका लागि प्राथमिकताहरू अद्यावधिक गरिएका छन्।
sl: Nastavitve vseh družinskih dreves so posodobljene.

source: The preferences for new family trees have been updated.
cy: Mae'r dewisiadau ar gyfer cart achau newydd wedi'u diweddaru.
hy: Նոր տոհմածառերի նախապատվությունները թարմացվել են։
ko: 새로운 가계도에 대한 환경 설정이 업데이트되었습니다.
ne: नयाँ पारिवारिक रूखहरूको लागि प्राथमिकताहरू अद्यावधिक गरिएको छ।
sl: Nastavitve novega družinskega drevesa so posodobljene.

source: list
cy: rhestr
hy: ցուցակը
ko: 목록
ne: सूची
sl: Seznam

source: table
cy: tabl
hy: սեղան
ko: 테이블
ne: तालिका
sl: Tabela

source: tag cloud
cy: cwmwl tagiau
hy: պիտակի ամպ
sl: Oblak oznak

source: Portrait
cy: Darlun
hy: Դիմանկար
ko: 초상화
ne: पोर्ट्रेट
sl: Pokončno

source: Landscape
cy: Tirlun
hy: Լանդշաֆտ
ko: 풍경
ne: ल्यान्डस्केप
sl: Ležeče

source: plain text
hy: պարզ տեքստ
ne: प्लेन टेक्स्ट

source: markdown
hy: նշումներ
ko: 마크다운

source: none
cy: dim
hy: ոչ մեկը
ko: 없음
ne: कुनैपनि होइन
sl: Brez

source: facts
cy: ffeithiau
hy: փաստեր
ko: 정보
ne: तथ्यहरू
sl: dejstva

source: records
cy: cofnodion
hy: գրառումներ
ko: 레코드
ne: रेकर्डहरू
sl: zapisi

source: <default theme>
hy: <լռելյայն թեմա>
ko: <기본 테마>
sl: <privzeta tema>

source: Privacy
cy: Preifatrwydd
hy: Գաղտնիություն
ko: 개인정보
ne: गोपनीयता
sl: Zasebnost

source: All facts and events
cy: Pob ffaith a digwyddiad
hy: Բոլոր փաստերն ու իրադարձությունները
ko: 모든 정보와 이벤트
ne: सबै तथ्य र घटनाहरू
sl: Vsa dejstva in dogodki

source: Find unrelated individuals
cy: Canfod unigolion digyswllt
hy: Գտեք անկապ անհատներ
ko: 관련 없는 인물 찾기
ne: असम्बन्धित व्यक्तिहरू खोज्नुहोस्
sl: Najdi nepovezane osebe

source: Upgrade wizard
cy: Dewin uwchraddio
hy: Թարմացման հրաշագործ
ne: अपग्रेड wizard
sl: Čarovnik za posodobitev

source: Export all the family trees to GEDCOM files…
cy: Allforio'r cart achau cyfan i ffeiliau GEDCOM…
hy: Արտահանել բոլոր տոհմածառերը GEDCOM ֆայլեր…
ko: 모든 가계도를 GEDCOM 파일로 내보내기…
ne: सबै पारिवारिक रूखहरू GEDCOM फाइलहरूमा निर्यात गर्नुहोस्…
sl: Izvozi vsa družinska drevesa v datoteke GEDCOM …

source: Create a temporary folder…
cy: Creu ffolder dros dro…
hy: Ստեղծեք ժամանակավոր թղթապանակ…
ko: 임시 폴더 생성…
ne: एउटा अस्थायी फोल्डर सिर्जना गर्नुहोस्…
sl: Ustvari začasno mapo …

source: Check for pending changes…
cy: Gwirio am gynigion newydd…
hy: Ստուգեք սպասվող փոփոխությունները…
ko: 보류 중인 변경 사항 확인…
ne: विचाराधीन परिवर्तनहरूको लागि जाँच गर्नुहोस्…
sl: Preveri čakajoče spremembe …

source: Download %s…
cy: Llwytho %s i Lawr…
hy: Ներբեռնել %s…
ko: %s 다운로드…
ne: %s डाउनलोड गर्नुहोस्…
sl: Prenos %s …
