Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: Dates are only converted if they are valid for the calendar. For example, only dates between %1$s and %2$s will be converted to the French calendar and only dates after %3$s will be converted to the Gregorian calendar.
cy: Dim ond os ydynt yn ddilys ar gyfer y calendr y caiff dyddiadau eu trosi. Er enghraifft, dim ond dyddiadau rhwng %1$s a %2$s fydd yn cael eu trosi i galendr Ffrainc a dim ond dyddiadau ar ôl %3$s fydd yn cael eu trosi i galendr Gregoraidd.
hy: Ամսաթվերը փոխարկվում են միայն այն դեպքում, եթե դրանք վավեր են օրացույցի համար: Օրինակ, միայն %1$s-ից և %2$s-ի միջև ընկած ամսաթվերը կվերածվեն ֆրանսիական օրացույցին, և միայն %3$s-ից հետո ամսաթվերը կվերածվեն Գրիգորյան օրացույցի:
ko: 날짜는 달력에 유효한 경우에만 변환됩니다. 예를 들어, %1$s에서 %2$s 사이의 날짜만 프랑스 달력으로 변환되고 %3$s 이후의 날짜만 그레고리력으로 변환됩니다.
ne: मितिहरू क्यालेन्डरको लागि मान्य भएमा मात्र रूपान्तरण हुन्छन् । उदाहरणका लागि, %1$s र %2$s बीचका मितिहरूलाई मात्र फ्रान्सेली पात्रोमा रूपान्तरण गरिनेछ र %3$s पछिका मितिहरूलाई मात्र ग्रेगोरियन पात्रोमा रूपान्तरण गरिनेछ ।
sl: Datumi se pretvorijo le, če so veljavni za določen koledar. Na primer, v francoski koledar se bodo pretvorili le datumi med %1$s in %2$s, v gregorijanski koledar pa le datumi po %3$s.

source: In some calendars, days start at midnight. In other calendars, days start at sunset. The conversion process does not take account of the time, so for any event that occurs between sunset and midnight, the conversion between these types of calendar will be one day out.
cy: Mewn rhai calendrau, mae diwrnodau'n dechrau am hanner nos. Mewn calendrau eraill, mae dyddiau'n dechrau ar fachlud haul. Nid yw'r broses drawsnewid yn ystyried yr amser, felly ar gyfer unrhyw ddigwyddiad sy'n digwydd rhwng machlud haul a hanner nos, bydd y trawsnewid rhwng y mathau hyn o galendr allan ohoni o un diwrnod.
hy: Որոշ օրացույցներում օրերը սկսվում են կեսգիշերին։ Այլ օրացույցներում օրերը սկսվում են մայրամուտից։ Փոխակերպման գործընթացը հաշվի չի առնում ժամանակը, ուստի ցանկացած իրադարձության համար, որը տեղի է ունենում մայրամուտից մինչև կեսգիշեր ընկած ժամանակահատվածում, այս տեսակի օրացույցների միջև փոխարկումը կլինի մեկ օր:
ko: 일부 달력에서는 요일이 자정에 시작됩니다. 다른 달력에서는 일이 일몰에 시작됩니다. 변환 프로세스는 시간을 고려하지 않으므로 일몰과 자정 사이에 발생하는 이벤트의 경우 이러한 유형의 달력 간의 변환은 하루가 걸립니다.
ne: केही क्यालेन्डरहरूमा, दिनहरू मध्यरातबाट सुरु हुन्छन्। अन्य क्यालेन्डरहरूमा, दिनहरू सूर्यास्तबाट सुरु हुन्छ। रूपान्तरण प्रक्रियाले समयको हिसाब गर्दैन, त्यसैले सूर्यास्त र मध्यरातको बीचमा हुने कुनै पनि घटनाको लागि, यी प्रकारका पात्रोहरू बीचको रूपान्तरण एक दिन बाहिर हुनेछ।
sl: V nekaterih koledarjih se dnevi začnejo ob polnoči. V drugih koledarjih se dnevi začnejo ob sončnem zahodu. Postopek pretvorbe ne upošteva časa, zato bo za vsak dogodek, ki se zgodi med sončnim zahodom in polnočjo, pretvorba med tema vrstama koledarjev zaostajala za en dan.

source: Add unique identifiers
cy: Ychwanegu ddynodwyr unigryw
hy: Ավելացրեք եզակի նույնացուցիչներ
ko: 고유 식별자 추가
ne: यूनिक पहिचानकर्ताहरू थप्नुहोस्
sl: Dodaj enolične identifikatorje

source: Unique identifiers allow the same record to be found in different family trees and in different systems. They will be added whenever records are created or updated. If you do not want unique identifiers to be displayed, you can hide them using the privacy rules.
cy: Mae dynodwyr unigryw yn caniatáu i'r un cofnod gael ei ganfod mewn gwahanol cartiau achau ac mewn gwahanol systemau. Mae nhw'n cael eu hychwanegu pryd bynnag y bydd cofnodion yn cael eu creu neu eu diweddaru. Os nad ydych am i ddynodwyr unigryw gael eu dangos, gallwch eu cuddio gan ddefnyddio'r rheolau preifatrwydd.
hy: Եզակի նույնացուցիչները թույլ են տալիս նույն գրառումը գտնել տարբեր տոհմածառերում և տարբեր համակարգերում: Դրանք կավելացվեն, երբ գրառումները ստեղծվեն կամ թարմացվեն: Եթե դուք չեք ցանկանում, որ եզակի նույնացուցիչները ցուցադրվեն, կարող եք թաքցնել դրանք՝ օգտագործելով գաղտնիության կանոնները:
ko: 고유 식별자를 사용하면 다른 가계도 및 다른 시스템에서 동일한 레코드를 찾을 수 있습니다. 레코드가 작성되거나 업데이트 될 때마다 추가됩니다. 고유 식별자를 표시하지 않으려면 개인 정보 보호 규칙을 사용하여 숨길 수 있습니다.
ne: अद्वितीय पहिचानकर्ताहरूले एउटै रेकर्डलाई विभिन्न पारिवारिक रूखहरूमा र विभिन्न प्रणालीहरूमा फेला पार्न अनुमति दिन्छ। रेकर्डहरू सिर्जना वा अद्यावधिक हुँदा तिनीहरू थपिनेछन्। यदि तपाइँ अद्वितीय पहिचानकर्ताहरू प्रदर्शन गर्न चाहनुहुन्न भने, तपाइँ गोपनीयता नियमहरू प्रयोग गरेर तिनीहरूलाई लुकाउन सक्नुहुन्छ।
sl: Enolični identifikatorji omogočajo, da isti zapis lahko najdete v različnih družinskih drevesih in različnih sistemih. Dodani bodo vsakič, ko bodo zapisi ustvarjeni ali posodobljeni. Če ne želite, da se enolični identifikatorji prikazujejo, jih lahko skrijete z uporabo pravil zasebnosti.

source: Genealogy contact
cy: Cyswllt hel achau
hy: Ծագումնաբանության կոնտակտ
ko: 계보 연락처
ne: वंशावली सम्पर्क
sl: Rodoslovni kontakt

source: The individual to contact about the genealogy data on this website.
cy: Y person cyswllt am y data achau ar y wefan hon.
hy: Անհատը, ում հետ կապվելու է այս կայքի ծագումնաբանական տվյալների հետ:
ko: 이 웹 사이트에서 계보 데이터에 대해 문의 할 인물입니다.
ne: यस वेबसाइटमा वंशावली डेटाको बारेमा सम्पर्क गर्न व्यक्ति।
sl: Oseba, na katero se lahko obrnete glede rodoslovnih podatkov na tem spletišču.

source: Technical help contact
cy: Cyswllt cymorth technegol
hy: Տեխնիկական օգնության կապ
ko: 기술 지원 문의
ne: प्राविधिक मद्दत सम्पर्क
sl: Kontaktna oseba za tehnično pomoč

source: The individual to be contacted about technical questions or errors encountered on your website.
cy: Y person cyswllt ynghylch cwestiynau technegol neu wallau rydych yn eu gweld ar eich gwefan.
hy: Անհատը, որին պետք է կապ հաստատել ձեր կայքում հանդիպող տեխնիկական հարցերի կամ սխալների մասին:
ko: 웹 사이트에서 발생한 기술적 질문 또는 오류에 대해 연락을 받을 인물입니다.
ne: प्राविधिक प्रश्नहरू वा तपाईंको वेबसाइटमा त्रुटिहरूको सामना गर्ने व्यक्तिलाई सम्पर्क गर्न सकिन्छ।
sl: Oseba, na katero se lahko obrnete glede tehničnih vprašanj ali napak na vašem spletišču.

source: Add to TITLE header tag
cy: Ychwanegu at dag pennyn TITLE
hy: Ավելացնել TITLE վերնագրի պիտակին
ko: TITLE 헤더 태그에 추가
ne: प्रत्येक पृष्ठमा स्टाइल रक्रिप्टहरू थप्नुहोस्
sl: Dodaj k oznaki TITLE

source: This text will be appended to each page title. It will be shown in the browser’s title bar, bookmarks, etc.
cy: Bydd y testun hwn wedi'i atodi i deitl pob tudalen. Bydd yn cael ei ddangos ym mar teitl y porwr, nodau tudalen, ac ati.
hy: Այս տեքստը կկցվի յուրաքանչյուր էջի վերնագրին: Այն կցուցադրվի բրաուզերի վերնագրի տողում, էջանիշերում և այլն:
ko: 이 텍스트는 각 페이지 제목에 추가됩니다. 브라우저의 제목 표시 줄, 책갈피 등에 표시됩니다.
ne: यो पाठ प्रत्येक पृष्ठ शीर्षकमा जोडिनेछ। यो ब्राउजरको शीर्षक पट्टी, बुकमार्क, आदि मा देखाइनेछ।
sl: To besedilo bo dodano vsakemu naslovu strani. Prikazano bo v naslovni vrstici brskalnika, med zaznamki itd.

source: Description META tag
cy: Tag disgrifiad META
hy: Նկարագրություն META պիտակ
ko: META 태그 설명
ne: META ट्याग विवरण
sl: Oznaka META z opisom

source: Search engines may use this description of your site in their search results.
cy: Gall peiriannau chwilio ddefnyddio'r disgrifiad hwn o'ch gwefan yn eu canlyniadau chwilio.
hy: Որոնման համակարգերը կարող են օգտագործել ձեր կայքի այս նկարագրությունը իրենց որոնման արդյունքներում:
ko: 검색엔진은 검색결과에서 이 사이트에 대한 설명을 사용할 수 있습니다.
ne: खोज इन्जिनहरूले आफ्नो खोज परिणामहरूमा तपाईंको साइटको यो विवरण प्रयोग गर्न सक्छन्।
sl: Iskalniki lahko ta opis vašega spletišča uporabijo v svojih rezultatih iskanja.

source: This folder will be used to store the media files for this family tree.
cy: Bydd y ffolder hon yn cael ei ddefnyddio i storio'r ffeiliau cyfryngau ar gyfer y cart achau hwn.
hy: Այս թղթապանակը կօգտագործվի այս տոհմածառի մեդիա ֆայլերը պահելու համար:
ko: 이 폴더는이 가계도의 미디어 파일을 저장하는 데 사용됩니다.
ne: यो फोल्डर यस पारिवारिक रूखका लागि मिडिया फाइलहरू भण्डारण गर्न प्रयोग गरिनेछ।
sl: Ta mapa bo uporabljena za shranjevanje medijskih datotek za to družinsko drevo.

source: If you select a different folder, you must also move any media files from the existing folder to the new one.
cy: Os fyddwch yn dewis ffolder gwahanol, rhaid i chi hefyd symud unrhyw ffeiliau cyfryngau o'r ffolder bresennol i'r un newydd.
hy: Եթե ընտրեք այլ պանակ, դուք պետք է նաև տեղափոխեք ցանկացած մեդիա ֆայլ գոյություն ունեցող պանակից նորը:
ko: 다른 폴더를 선택하는 경우 기존 폴더에서 새 폴더로 미디어 파일도 이동해야 합니다.
ne: यदि तपाइँ फरक फोल्डर चयन गर्नुहुन्छ भने, तपाइँले अवस्थित फोल्डरबाट नयाँ फोल्डरमा कुनै पनि मिडिया फाइलहरू सार्नु पर्छ।
sl: Če izberete drugo mapo, morate premakniti tudi vse medijske datoteke iz obstoječe mape v novo.

source: If two family trees use the same media folder, then they will be able to share media files. If they use different media folders, then their media files will be kept separate.
cy: Os yw dau gart achau'n defnyddio'r un ffolder cyfryngau, yna byddan nhw'n gallu rhannu ffeiliau cyfryngau. Os ydyn nhw'n defnyddio ffolderi cyfryngau gwahanol, yna bydd eu ffeiliau cyfryngau yn cael eu cadw ar wahân.
hy: Եթե երկու տոհմածառ օգտագործում են նույն մեդիա թղթապանակը, ապա նրանք կկարողանան կիսվել մեդիա ֆայլերով: Եթե նրանք օգտագործում են տարբեր մեդիա թղթապանակներ, ապա նրանց մեդիա ֆայլերը կպահվեն առանձին:
ko: 두 가계도가 동일한 미디어 폴더를 사용하는 경우 미디어 파일을 공유할 수 있습니다. 다른 미디어 폴더를 사용하는 경우 해당 미디어 파일은 별도로 보관됩니다.
ne: यदि दुई पारिवारिक रूखहरूले एउटै मिडिया फोल्डर प्रयोग गर्छन् भने, त्यसपछि तिनीहरू मिडिया फाइलहरू साझेदारी गर्न सक्षम हुनेछन्। यदि तिनीहरूले विभिन्न मिडिया फोल्डरहरू प्रयोग गर्छन् भने, तिनीहरूको मिडिया फाइलहरू अलग राखिनेछन्।
sl: Če dve družinski drevesi uporabljata isto mapo za medije, bosta lahko delili medijske datoteke. Če uporabljata različni mapi za medije, bodo njune medijske datoteke shranjene ločeno.

source: Who can upload new media files
cy: Pwy all lwytho ffeiliau cyfryngau newydd
hy: Ով կարող է վերբեռնել նոր մեդիա ֆայլեր
ko: 새 미디어 파일을 업로드 할 수있는 사람
ne: कसले नयाँ मिडिया फाइलहरू अपलोड गर्न सक्छ
sl: Kdo lahko naloži nove medijske datoteke

source: If you are concerned that users might upload inappropriate images, you can restrict media uploads to managers only.
cy: Os ydych chi'n poeni y gallai defnyddwyr lwytho delweddau amhriodol, gallwch gyfyngu lwytho cyfryngau i reolwyr yn unig.
hy: Եթե մտավախություն ունեք, որ օգտատերերը կարող են վերբեռնել ոչ պատշաճ պատկերներ, կարող եք սահմանափակել մեդիա վերբեռնումները միայն մենեջերների համար:
ko: 사용자가 부적절한 이미지를 업로드할 수 있다는 우려가 있는 경우 미디어 업로드를 관리자로만 제한할 수 있습니다.
ne: यदि तपाइँ चिन्तित हुनुहुन्छ कि प्रयोगकर्ताहरूले अनुपयुक्त छविहरू अपलोड गर्न सक्छन्, तपाइँ प्रबन्धकहरूमा मात्र मिडिया अपलोडहरू प्रतिबन्ध गर्न सक्नुहुन्छ।
sl: Če vas skrbi, da bi uporabniki lahko naložili neprimerne slike, lahko nalaganje medijev omejite samo na upravitelje.

source: Show a download link in the media viewer
cy: Dangos dolen llwytho i lawr yn y darllenydd cyfryngau
hy: Ցույց տալ ներբեռնման հղումը մեդիա դիտիչում
ko: 미디어 뷰어에 다운로드 링크를 표시합니다
ne: मिडिया दर्शकमा डाउनलोड लिङ्क देखाउनुहोस्
sl: Prikaži povezavo za prenos v pregledovalniku medijev

source: This option will make it easier for users to download images.
cy: Bydd yr opsiwn hwn yn ei gwneud hi'n haws i ddefnyddwyr lwytho delweddau i lawr.
hy: Այս տարբերակը օգտվողների համար կհեշտացնի նկարներ ներբեռնելը:
ko: 이 옵션을 사용하면 사용자가 이미지를보다 쉽게 다운로드 할 수 있습니다.
ne: यो विकल्पले प्रयोगकर्ताहरूलाई छविहरू डाउनलोड गर्न सजिलो बनाउनेछ।
sl: Ta možnost bo uporabnikom poenostavila prenos slik.

source: Thumbnail images
cy: Delweddau bach
hy: Մանրապատկերների պատկերներ
ko: 썸네일 이미지
ne: थम्बनेल छविहरू
sl: Sličice

source: Show thumbnail images in charts and family groups.
cy: Dangos delweddau bach mewn siartiau a grwpiau teulu.
hy: Ցույց տալ մանրապատկերների պատկերները գծապատկերներում և ընտանեկան խմբերում:
ko: 썸네일 이미지를 차트와 가족 그룹으로 표시하십시오.
ne: चार्ट र पारिवारिक समूहहरूमा थम्बनेल छविहरू देखाउनुहोस्।
sl: Prikaži sličice v diagramih in družinskih skupinah.

source: Use silhouettes
cy: Defnyddiwch silwetau
hy: Օգտագործեք ուրվանկարներ
ko: 실루엣 사용
ne: सिल्हूट प्रयोग गर्नुहोस्
sl: Uporabite silhuete

source: Use silhouette images when no highlighted image for that individual has been specified. The images used are specific to the sex of the individual in question.
hy: Օգտագործեք ուրվագիծ պատկերներ, երբ նշված անհատի համար ընդգծված պատկեր չի նշվել: Օգտագործված պատկերները հատուկ են տվյալ անհատի սեռին:
ne: सिल्हूट छविहरू प्रयोग गर्नुहोस् जब त्यो व्यक्तिको लागि कुनै हाइलाइट गरिएको छवि निर्दिष्ट गरिएको छैन। प्रयोग गरिएका तस्बिरहरू प्रश्नमा व्यक्तिको लिंगको लागि विशिष्ट छन्।

source: Watermarks
cy: Dyfrnodau
hy: Ջրի նշիչներ
ko: 워터마크
ne: वाटरमार्कहरू
sl: Vodni žigi

source: Images without watermarks
cy: Delweddau heb ddyfrnodau
hy: Պատկերներ՝ առանց ջրանիշի
ko: 워터마크가 없는 이미지
ne: वाटरमार्क नभएका तस्बिरहरू
sl: Slike brez vodnih žigov

source: Watermarks are optional and normally shown just to visitors.
cy: Mae dyfrnodau yn ddewisol ac fel arfer yn cael eu dangos i ymwelwyr yn unig.
hy: Ջրի նիշերը կամընտիր են և սովորաբար ցուցադրվում են միայն այցելուներին:
ko: 워터 마크는 선택사항이며 일반적으로 방문자에게만 표시됩니다.
ne: वाटरमार्कहरू वैकल्पिक छन् र सामान्यतया आगन्तुकहरूलाई मात्र देखाइन्छ।
sl: Vodni žigi so neobvezni in se običajno prikazujejo le obiskovalcem.

source: Surname list style
cy: Arddull rhestr cyfenwau
hy: Ազգանունների ցանկի ոճը
ko: 가문이름 목록 스타일
ne: उपनाम सूची शैली
sl: Slog seznama priimkov

source: Maximum number of surnames on individual list
cy: Uchafswm y cyfenwau ar y rhestr unigol
hy: Անհատական ցուցակում ազգանունների առավելագույն քանակը
ko: 인물 목록의 최대 가문이름 수
ne: व्यक्तिगत सूचीमा थरहरूको अधिकतम संख्या
sl: Največje število priimkov na posameznem seznamu

source: Long lists of individuals with the same surname can be broken into smaller sub-lists according to the first letter of the individual’s given name.<br><br>This option determines when sub-listing of surnames will occur. To disable sub-listing completely, set this option to zero.
cy: Mae modd rhannu rhestrau hir o unigolion sydd â'r un cyfenw yn is-restrau llai yn ôl llythyren gyntaf enw penodol yr unigolyn.<br><br> Mae'r opsiwn hwn yn pennu pryd y bydd is-restru cyfenwau yn digwydd. I analluogi creu is-restrau yn llwyr, gosodwch yr opsiwn hwn i 0.
hy: Նույն ազգանունով անհատների երկար ցուցակները կարելի է բաժանել ավելի փոքր ենթացուցակների՝ ըստ տվյալ անհատի անվան առաջին տառի:<br><br>Այս տարբերակը որոշում է, թե երբ տեղի կունենա ազգանունների ենթացանկը: Ենթացուցակը ամբողջությամբ անջատելու համար այս տարբերակը սահմանեք զրոյի:
ko: 동일한 가문이름을 가진 인물의 긴 목록은 인물 이름의 첫 글자에 따라 더 작은 하위 목록으로 나눌 수 있습니다.<br><br>이 옵션은 가문이름의 하위 목록이 발생할 시기를 결정합니다. 하위 목록을 완전히 비활성화하려면 이 옵션을 0으로 설정하십시오.
ne: एउटै थर भएका व्यक्तिहरूको लामो सूचीहरूलाई व्यक्तिको दिइएको नामको पहिलो अक्षरको आधारमा साना उप-सूचीहरूमा विभाजन गर्न सकिन्छ।<br><br>यो विकल्पले उपनामहरूको उप-सूचीबद्धता कहिले हुनेछ भनेर निर्धारण गर्दछ। उप-सूचीलाई पूर्ण रूपमा अक्षम गर्न, यो विकल्पलाई शून्यमा सेट गर्नुहोस्।
sl: Dolge sezname oseb z istim priimkom je mogoče razdeliti na manjše podsezname glede na prvo črko imena osebe.<br><br>Ta možnost določa, kdaj se bodo pojavili podseznami priimkov. Če želite podsezname popolnoma onemogočiti, to možnost nastavite na nič.

source: Estimated dates for birth and death
cy: Amcangyfrif dyddiadau genedigaeth a marwolaeth
hy: Ծննդյան և մահվան գնահատված ամսաթվերը
ko: 출생 및 사망 예상 날짜
ne: जन्म र मृत्युको लागि अनुमानित मितिहरू
sl: Ocenjeni datumi rojstva in smrti

source: This option controls whether or not to show estimated dates for birth and death instead of leaving blanks on individual lists and charts for individuals whose dates are not known.
cy: Mae'r opsiwn hwn yn rheoli p'un ai i ddangos amcanu dyddiadau genedigaeth a marwolaeth ai peidio yn lle gadael bylchau ar restrau a siartiau unigol ar gyfer unigolion nad yw eu dyddiadau yn hysbys.
hy: Այս ընտրանքը վերահսկում է՝ ցույց տալ ծննդյան և մահվան մոտավոր ամսաթվերը, թե ոչ՝ առանձին ցուցակներում և գծապատկերներում դատարկ թողնելու փոխարեն այն անհատների համար, որոնց ամսաթվերը հայտնի չեն:
ko: 이 옵션은 날짜를 모르는 개인의 인물 목록 및 차트에 공백을 남기지 않고 출생 및 사망 예상 날짜를 표시할지 여부를 제어합니다.
ne: यो विकल्पले मिति थाहा नभएका व्यक्तिहरूको लागि व्यक्तिगत सूची र चार्टहरूमा खाली ठाउँ छोड्नुको सट्टा जन्म र मृत्युको अनुमानित मितिहरू देखाउने वा नगर्ने नियन्त्रण गर्दछ।
sl: Ta možnost nadzoruje, ali naj se prikažejo ocenjeni datumi rojstva in smrti, namesto praznih polj na posameznih seznamih in diagramih pri osebah, katerih datumi niso znani.

source: The date and time of the last update
cy: Dyddiad ac amser y diweddariad diwethaf
hy: Վերջին թարմացման ամսաթիվը և ժամը
ko: 마지막 업데이트 날짜 및 시간
ne: पछिल्लो अपडेटको मिति र समय
sl: Datum in čas zadnje posodobitve

source: Age of parents next to child’s birthdate
cy: Oed y rhieni gerllaw dyddiad geni'r plentyn
hy: Ծնողների տարիքը երեխայի ծննդյան ամսաթվի կողքին
ko: 자녀의 생일 옆에 있는 부모의 나이
ne: बच्चाको जन्ममितिको छेउमा आमाबाबुको उमेर
sl: Starost staršev ob rojstnem datumu otroka

source: This option controls whether or not to show age of father and mother next to child’s birthdate on charts.
cy: Mae'r opsiwn hwn yn rheoli p'un ai i ddangos oed y tad a'r fam gerllaw dyddiad geni'r plentyn ar siartiau.
hy: Այս ընտրանքը վերահսկում է՝ գծապատկերներում երեխայի ծննդյան ամսաթվի կողքին ցույց տալ հոր և մոր տարիքը, թե ոչ:
ko: 이 옵션은 자녀의 생년월일 옆에 아버지와 어머니의 연령을 차트에 표시할지 여부를 제어합니다.
ne: यो विकल्पले चार्टमा बच्चाको जन्ममितिको छेउमा बुबा र आमाको उमेर देखाउने वा नगर्ने नियन्त्रण गर्छ।
sl: Ta možnost nadzoruje, ali naj se na diagramih poleg otrokovega rojstnega datuma prikaže tudi starost očeta in matere.

source: Other facts to show in charts
cy: Ffeithiau eraill i'w dangos mewn siartiau
hy: Այլ փաստեր՝ ցույց տալու գծապատկերներում
ko: 차트에 표시할 기타 정보
ne: चार्टमा देखाउनका लागि अन्य तथ्यहरू
sl: Druga dejstva za prikaz na diagramih

source: Individual pages
cy: Tudalennau unigol
hy: Անհատական էջեր
ko: 인물 페이지
ne: व्यक्तिगत पृष्ठहरू
sl: Osebne strani

source: Show the events of close relatives on the individual page
cy: Dangos digwyddiadau perthnasau agos ar y dudalen unigol
hy: Ցույց տալ մերձավոր ազգականների իրադարձությունները անհատական էջում
ko: 인물 페이지에 가까운 친척의 이벤트을 보여주십시오
ne: व्यक्तिगत पृष्ठमा नजिकका नातेदारहरूको घटनाहरू देखाउनुहोस्
sl: Prikaži dogodke bližnjih sorodnikov na samostojni strani

source: Fact icons
cy: Eiconau ffeithiau
hy: Փաստերի պատկերակներ
ko: 정보 아이콘
ne: तथ्य आइकनहरू
sl: Ikone dejstva

source: Some themes can display icons on the “Facts and events” tab.
cy: Gall rhai themâu ddangos eiconau ar y tab “Ffeithiau a digwyddiadau”.
hy: Որոշ թեմաներ կարող են պատկերակներ ցուցադրել «Փաստեր և իրադարձություններ» ներդիրում:
ko: 일부 테마는 “정보 및 이벤트” 탭에 아이콘을 표시 할 수 있습니다.
ne: केही विषयवस्तुहरूले "तथ्य र घटनाहरू" ट्याबमा आइकनहरू प्रदर्शन गर्न सक्छन्।
sl: Nekatere teme lahko prikažejo ikone na zavihku “Dejstva in dogodki”.

source: Automatically expand notes
cy: Ehangu nodiadau'n awtomatig
hy: Ավտոմատ ընդլայնել նշումները
ko: 노트 자동 확장
ne: स्वचालित रूपमा नोटहरू विस्तार गर्नुहोस्
sl: Samodejno razširi opombe

source: This option controls whether or not to automatically display content of a <i>Note</i> record on the Individual page.
cy: Mae'r opsiwn hwn yn rheoli p'un ai i ddangos cynnwys cofnod <i>Nodyn</i> yn awtomatig ar y dudalen Unigolyn ai peidio.
hy: Այս ընտրանքը վերահսկում է անհատական էջում <i>Նշում</i> գրառման բովանդակությունը ինքնաբերաբար ցուցադրել, թե ոչ:
ko: 이 옵션은 인물 페이지에 <i>Note</i> 레코드의 컨텐츠를 자동으로 표시할지 여부를 제어합니다.
ne: यो विकल्पले व्यक्तिगत पृष्ठमा <i>नोट</i> रेकर्डको सामग्री स्वत: प्रदर्शन गर्ने कि नगर्ने नियन्त्रण गर्छ।
sl: Ta možnost nadzoruje, ali se vsebina zapisa <i>Opomba</i> samodejno prikaže na strani osebe.

source: Automatically expand sources
cy: Ehangu ffynonellau yn awtomatig
hy: Ավտոմատ ընդլայնել աղբյուրները
ko: 출처 자동 확장
ne: स्वचालित रूपमा स्रोतहरू विस्तार गर्नुहोस्
sl: Samodejno razširi vire

source: This option controls whether or not to automatically display content of a <i>Source</i> record on the Individual page.
cy: Mae'r opsiwn hwn yn rheoli p'un ai i ddangos cynnwys cofnod <i>Ffynhonnell</i> yn awtomatig ar y dudalen Unigolyn ai peidio.
hy: Այս ընտրանքը կարգավորում է անհատական էջում <i>Աղբյուր</i> գրառման բովանդակությունը ինքնաբերաբար ցուցադրել, թե ոչ:
ko: 이 옵션은 인물 페이지에 <i>출처</i> 레코드의 컨텐츠를 자동으로 표시할지 여부를 제어합니다.
ne: यो विकल्पले व्यक्तिगत पृष्ठमा <i>स्रोत</i> रेकर्डको सामग्री स्वत: प्रदर्शन गर्ने कि नगर्ने नियन्त्रण गर्छ।
sl: Ta možnost nadzoruje, ali se vsebina zapisa <i>Vir</i> samodejno prikaže na strani osebe.

source: Abbreviate place names
cy: Talfyrru enwau lleoedd
hy: Համառոտ տեղանուններ
ko: 장소 이름을 축약
ne: संक्षिप्त स्थान नामहरू
sl: Okrajšaj imena krajev

source: first
cy: cyntaf
hy: առաջին
ko: 첫번째
ne: पहिलो
sl: Začetek

source: last
cy: olaf
hy: վերջին
ko: 마지막
ne: अन्तिम
sl: Konec

# Show the [first/last] [N] parts of a place name.
source: first
cy: cyntaf
hy: առաջին
ko: 첫번째
ne: पहिलो
sl: prvih

# Show the [first/last] [N] parts of a place name.
source: last
cy: olaf
hy: վերջին
ko: 마지막
ne: अन्तिम
sl: zadnjih

source: Show the %1$s %2$s parts of a place name.
cy: Dangos y rhannau %1$s %2$s o enw lle.
hy: Ցույց տալ տեղանունի %1$s %2$s մասերը:
ko: 장소 이름의 %1$s %2$s 부분을 표시하십시오.
ne: ठाउँको नामको %1$s %2$s भागहरू देखाउनुहोस्।
sl: Prikaži %1$s %2$s delov imena kraja.

source: Place names are frequently too long to fit on charts, lists, etc. They can be abbreviated by showing just the first few parts of the name, such as <i>village, county</i>, or the last few part of it, such as <i>region, country</i>.
cy: Mae enwau lleoedd yn aml yn rhy hir i ffitio ar siartiau, rhestrau, ac ati. Mae modd eu talfyrru trwy ddangos dim ond ychydig rannau cyntaf yr enw, fel <i>pentref, sir</i> , neu'r ychydig ran olaf ohono, fel <i>rhanbarth, gwlad</i> .
hy: Տեղանունները հաճախ չափազանց երկար են, որպեսզի տեղավորվեն գծապատկերներում, ցուցակներում և այլն: Դրանք կարող են կրճատվել՝ ցույց տալով անվան միայն առաջին մի քանի մասերը, օրինակ՝ <i>գյուղ, շրջան</i> կամ վերջին մի մասը, օրինակ՝ <i>տարածաշրջան, երկիր</i>:
ko: 장소 이름은 종종 너무 길어 차트, 목록 등에 표시되지 않습니다. <i>마을, 카운티</i>와 같이 이름의 처음 몇 부분만 표시하거나 이름의 마지막 몇 부분만 표시하여 축약할 수 있습니다. (예: <i>지역, 국가</i>).
ne: स्थानका नामहरू चार्ट, सूचीहरू, इत्यादिमा फिट हुनको लागि प्रायः धेरै लामो हुन्छन्। तिनीहरूलाई नामको सुरुका केही भागहरू जस्तै <i>गाउँ, काउन्टी</i>, वा यसको अन्तिम केही भागहरू देखाएर संक्षिप्त गर्न सकिन्छ। , जस्तै <i>क्षेत्र, देश</i>।
sl: Imena krajev so pogosto predolga za prikaz na diagramih, seznamih itd. Skrajšamo jih lahko tako, da prikažemo le prvih nekaj delov imena, kot so <i>vas, okrožje</i>, ali zadnjih nekaj delov imena, kot so <i>regija, država</i>.

source: Format text and notes
cy: Fformatio testun a nodiadau
hy: Ձևաչափեք տեքստը և նշումները
ko: 텍스트 및 노트 서식 지정
ne: ढाँचा पाठ र नोटहरू
sl: Oblika besedila in opomb

source: To ensure compatibility with other genealogy applications, notes, text, and transcripts should be recorded in simple, unformatted text. However, formatting is often desirable to aid presentation, comprehension, etc.
cy: Er mwyn sicrhau cydnawsedd â rhaglenni achau eraill, dylid cofnodi nodiadau, testun a thrawsgrifiadau mewn testun syml, heb fformat. Fodd bynnag, mae fformatio yn aml yn ddymunol i gynorthwyo cyflwyniadau, dealltwriaeth ac ati.
hy: Տոհմաբանական այլ հավելվածների հետ համատեղելիություն ապահովելու համար նշումները, տեքստը և տառադարձումները պետք է գրանցվեն պարզ, չձևաչափված տեքստով: Այնուամենայնիվ, ձևաչափումը հաճախ ցանկալի է, որպեսզի օգնի ներկայացմանը, ըմբռնմանը և այլն:
ko: 다른 계보 응용 프로그램과의 호환성을 보장하려면 노트, 텍스트 및 대화내용을 형식이 지정되지 않은 간단한 텍스트로 기록해야합니다. 그러나 프리젠테이션, 이해력 등을 돕기 위해 형식을 지정하는 것이 바람직합니다.
ne: अन्य वंशावली अनुप्रयोगहरूसँग अनुकूलता सुनिश्चित गर्न, नोटहरू, पाठ, र ट्रान्सक्रिप्टहरू सरल, अनफर्म्याट गरिएको पाठमा रेकर्ड गरिनु पर्छ। यद्यपि, प्रस्तुतीकरण, बुझाइ, इत्यादिलाई मद्दत गर्नको लागि ढाँचा अक्सर वांछनीय हुन्छ।
sl: Za zagotovitev združljivosti z drugimi rodoslovnimi programi morate opombe, besedilo in prepise zapisati v preprostem, neoblikovanem besedilu. Vendar pa je oblikovanje pogosto zaželeno za lažjo predstavitev, razumevanje itd.
