Repository: fisharebest/webtrees
Catalog: resources/lang/*/messages.po
Languages: cy, hy, ko, ne, sl

source: A private area to record notes or keep a journal.
cy: Ardal breifat i recordio nodiadau neu gadw dyddiadur.
hy: Անձնական տարածք՝ գրառումներ գրանցելու կամ ամսագիր պահելու համար:
ko: 노트를 기록하거나 저널을 보관하는 개인 구역.
ne: नोटहरू रेकर्ड गर्न वा जर्नल राख्नको लागि निजी क्षेत्र।
sl: Zasebni prostor za zapisovanje opomb ali vodenje dnevnika.

source: Journal
cy: Dyddlyfr
hy: Ամսագիր
ko: 저널
ne: जर्नल
sl: Dnevnik

source: Messages
cy: Negeseuon
hy: Հաղորդագրություններ
ko: 메세지
ne: सन्देशहरू
sl: Sporočila

source: Communicate directly with other users, using private messages.
cy: Cyfathrebu'n uniongyrchol â defnyddwyr eraill, gan ddefnyddio negeseuon preifat.
hy: Անմիջապես շփվեք այլ օգտատերերի հետ՝ օգտագործելով անձնական հաղորդագրություններ:
ko: 개인 메시지를 사용하여 다른 사용자와 직접 연락하십시오.
ne: व्याक्तिगत खबर पठाएर सोझै अरु प्रयोगकर्ताहरू सँग सम्पर्क गर्नुहोस्।
sl: Komunicirajte neposredno z drugimi uporabniki preko zasebnih sporočil.

source: %s message
cy: %s negeseuon
hy: %s հաղորդագրություն
ko: %s 메시지들
ne: %s सन्देश
sl: %s sporočilo

source: A greeting message and useful links for a user.
cy: Neges gyfarch a dolenni defnyddiol i ddefnyddiwr.
hy: Ողջույնի հաղորդագրություն և օգտակար հղումներ օգտագործողի համար:
ko: 인사말 메시지와 사용자를 위한 유용한 링크.
ne: एक अभिवादन सन्देश र प्रयोगकर्ताका लागि उपयोगी लिङ्कहरू।
sl: Pozdravno sporočilo in uporabne povezave za uporabnika.

source: Default chart
cy: Siart rhagosodedig
hy: Կանխադրված գծապատկեր
ko: 기본 차트
ne: पूर्वनिर्धारित चार्ट
sl: Privzeti diagram

source: Welcome %s
cy: Croeso %s
hy: Բարի գալուստ %s
ko: 환영합니다 %s
ne: स्वागत छ %s
sl: Dobrodošli %s

source: webtrees
hy: վեբ ծառեր
ne: वेबट्रिज

source: Home page
cy: Tudalen gartref
hy: Գլխավոր էջ
ko: 홈페이지
ne: गृह पृष्ठ
sl: Domača stran

source: A greeting message for site visitors.
cy: Neges gyfarch i ymwelwyr a'r wefan.
hy: Ողջույնի հաղորդագրություն կայքի այցելուների համար:
ko: 사이트 방문자를 위한 인사 메시지.
ne: साइटमा आगन्तुकहरूका लागि अभिवादन सन्देश।
sl: Pozdravno sporočilo za obiskovalca spletišča.

source: Default individual
cy: Unigolyn rhagosodedig
hy: Կանխադրված անհատ
ko: 기본 인물
ne: पूर्वनिर्धारित व्यक्ति
sl: Privzeta oseba

source: xenea
hy: քսենեա
ne: जेनिया थिम

source: Yahrzeiten
hy: Յահրզեյթեն
ne: यारजेइतेन

source: A list of the Hebrew death anniversaries that will occur in the near future.
cy: Rhestr o'r dathliadau marwolaeth Hebraeg a fydd yn digwydd yn y dyfodol agos.
hy: Եբրայերեն մահվան տարելիցների ցանկը, որը տեղի կունենա մոտ ապագայում:
ko: 가까운 미래에 일어날 히브리 사망의 기념일 목록.
ne: आउने हिब्रू मृत्यु वार्षिकोत्सवहरूको सूची ।
sl: Seznam hebrejskih obletnic smrti, ki se bodo zgodile v bližnji prihodnosti.

source: unknown
cy: anhysbys
hy: անհայտ
ko: 알수없음
ne: अज्ञात
sl: neznano

source: Generated by %s
cy: Cynhyrchwyd gan %s
hy: Ստեղծված է %s-ի կողմից
ko: %s에 의해 생성됨
ne: %s द्वारा उत्पन्न
sl: Ustvarjeno z %s

source: Use sendmail to send messages
cy: Defnyddio sendmail i anfon negeseuon
hy: Օգտագործեք sendmail հաղորդագրություններ ուղարկելու համար
ko: sendmail을 사용하여 메시지 보내기
ne: सन्देशहरू पठाउन sendmail प्रयोग गर्नुहोस्
sl: Za pošiljanje sporočil uporabi sendmail

source: Use SMTP to send messages
cy: Defnyddio SMTP i anfon negeseuon
hy: Օգտագործեք SMTP հաղորդագրություններ ուղարկելու համար
ko: SMTP를 사용하여 메시지 보내기
ne: सन्देशहरू पठाउन SMTP प्रयोग गर्नुहोस्
sl: Za pošiljanje sporočil uporabi SMTP

source: Birth of a son
cy: Geni mab
hy: Որդու ծնունդ
ko: 아들의 출생
ne: छोराको जन्म
sl: Rojstvo sina

source: Birth of a daughter
cy: Genedigaeth merch
hy: Դստեր ծնունդ
ko: 딸의 출생
ne: छोरीको जन्म
sl: Rojstvo hčerke

source: Christening of a son
cy: Bedyddio mab
hy: Որդու մկրտություն
ko: 아들의 세례식
ne: छोराको नामकरण
sl: Krst sina

source: Christening of a daughter
cy: Bedyddio merch
hy: Դստեր մկրտություն
ko: 딸의 세례식
ne: छोरीको नामकरण
sl: Krst hčerke

source: Christening of a child
cy: Bedyddio plentyn
hy: Երեխայի մկրտություն
ko: 자녀의 세례식
ne: बच्चाको नामकरण
sl: Krst otroka

source: Baptism of a son
cy: Bedydd mab
hy: Որդու մկրտություն
ko: 아들의 침례
ne: छोराको बप्तिस्मा
sl: Krst sina

source: Baptism of a daughter
cy: Bedydd merch
hy: Դստեր մկրտություն
ko: 딸의 침례
ne: छोरीको बप्तिस्मा
sl: Krst hčerke

source: Baptism of a child
cy: Bedydd plentyn
hy: Երեխայի մկրտություն
ko: 자녀의 침례
ne: बच्चाको बप्तिस्मा
sl: Krst otroka

source: Adoption of a son
cy: Mabwysiadu mab
hy: Որդու որդեգրում
ko: 양자의 아들
ne: छोरा ग्रहण
sl: Posvojitev sina

source: Adoption of a daughter
cy: Mabwysiadu merch
hy: Դստեր որդեգրում
ko: 양자의 딸
ne: छोरी ग्रहण
sl: Posvojitev hčerke

source: Adoption of a child
cy: Mabwysiadu plentyn
hy: Երեխայի որդեգրում
ko: 양자의 자녀
ne: बच्चा ग्रहण
sl: Posvojitev otroka

source: Birth of a brother
cy: Geni brawd
hy: Եղբոր ծնունդ
ko: 남자형제의 출생
ne: दाजुभाइको जन्म
sl: Rojstvo brata

source: Birth of a sister
cy: Geni chwaer
hy: Քրոջ ծնունդ
ko: 자매의 출생
ne: दिदी/बहिनीको जन्म
sl: Rojstvo sestre

source: Birth of a sibling
cy: Genedigaeth brawd neu chwaer
hy: Եղբոր կամ եղբոր ծնունդ
ko: 형제자매의 출생
ne: दाजुभाइको जन्म
sl: Rojstvo brata/sestre

source: Christening of a brother
cy: Bedyddio brawd
hy: Եղբոր մկրտություն
ko: 남자형제의 세례식
ne: भाइको नामकरण
sl: Krst brata

source: Christening of a sister
cy: Bedyddio chwaer
hy: Քրոջ մկրտություն
ko: 자매의 세례식
ne: बहिनीको नामकरण
sl: Krst sestre

source: Christening of a sibling
cy: Bedyddio brawd neu chwaer
hy: Եղբոր կամ եղբոր մկրտություն
ko: 형제자매의 세례식
ne: दाजुभाइको नामकरण
sl: Krst brata/sestre

source: Baptism of a brother
cy: Bedydd brawd
hy: Եղբոր մկրտություն
ko: 형제의 침례
ne: भाइको बप्तिस्मा
sl: Krst brata

source: Baptism of a sister
cy: Bedydd chwaer
hy: Քրոջ մկրտություն
ko: 자매의 침례
ne: बहिनीको बप्तिस्मा
sl: Krst sestre

source: Baptism of a sibling
cy: Bedydd brawd neu chwaer
hy: Եղբոր կամ եղբոր մկրտություն
ko: 형제자매의 침례
ne: भाइबहिनीको बप्तिस्मा
sl: Krst brata/sestre

source: Adoption of a brother
cy: Mabwysiadu brawd
hy: Եղբոր որդեգրում
ko: 양자의 형제
ne: भाइले ग्रहण गरेको
sl: Posvojitev brata

source: Adoption of a sister
cy: Mabwysiadu chwaer
hy: Քրոջ որդեգրում
ko: 양자의 자매
ne: दिदीबहिनी ग्रहण
sl: Posvojitev sestre

source: Adoption of a sibling
cy: Mabwysiadu brawd neu chwaer
hy: Եղբոր կամ եղբոր որդեգրում
ko: 양자의 형제자매
ne: दाजुभाइ ग्रहण
sl: Posvojitev brata/sestre

source: Birth of a half-brother
cy: Genedigaeth hanner brawd
hy: Խորթ եղբոր ծնունդ
ko: 이복형제의 출생
ne: सौतेनी भाइको जन्म
sl: Rojstvo polbrata

source: Birth of a half-sister
cy: Genedigaeth hanner chwaer
hy: Խորթ քրոջ ծնունդ
ko: 이복자매의 출생
ne: सौतेनी बहिनीको जन्म
sl: Rojstvo polsestre

source: Birth of a half-sibling
cy: Genedigaeth hanner brawd neu chwaer
hy: Կիս եղբոր ծնունդ
ko: 이복형제자매의 출생
ne: सौतेनी दाजुभाइको जन्म
sl: Rojstvo polbrata/polsestre

source: Christening of a half-brother
cy: Bedyddio hanner brawd
hy: Խորթ եղբոր մկրտություն
ko: 이복형제의 세례식
ne: सौतेनी भाइको नामकरण
sl: Krst polbrata

source: Christening of a half-sister
cy: Bedyddio hanner chwaer
hy: Խորթ քրոջ մկրտություն
ko: 이복자매의 세례식
ne: सौतेनी बहिनीको नामकरण
sl: Krst polsestre

source: Christening of a half-sibling
cy: Bedyddio hanner brawd neu chwaer
hy: Կիս եղբոր մկրտություն
ko: 이복형제자매의 세례식
ne: सौतेनी दाजुभाइको नामकरण
sl: Krst polbrata/polsestre

source: Baptism of a half-brother
cy: Bedydd hanner brawd
hy: Խորթ եղբոր մկրտություն
ko: 이복형제의 침례
ne: सौतेनी दाजुभाइको बप्तिस्मा
sl: Krst polbrata

source: Baptism of a half-sister
cy: Bedydd hanner chwaer
hy: Խորթ քրոջ մկրտություն
ko: 이복자매의 침례
ne: सौतेनी बहिनीको बप्तिस्मा
sl: Krst polsestre

source: Baptism of a half-sibling
cy: Bedydd hanner brawd neu chwaer
hy: Խորթ եղբոր մկրտություն
ko: 이복형제자매의 침례
ne: सौतेनी भाइको बप्तिस्मा
sl: Krst polbrata/polsestre

source: Adoption of a half-brother
cy: Mabwysiadu hanner brawd
hy: Խորթ եղբոր որդեգրում
ko: 양자의 이복형제
ne: सौतेनी दाइभाइ ग्रहण
sl: Posvojitev polbrata

source: Adoption of a half-sister
cy: Mabwysiadu hanner chwaer
hy: Խորթ քրոջ որդեգրում
ko: 양자의 이복자매
ne: सौतेनी दिदीबहिनी ग्रहण
sl: Posvojitev polsestre

source: Adoption of a half-sibling
cy: Mabwysiadu hanner brawd neu chwaer
hy: Կիս եղբոր որդեգրում
ko: 양자의 이복형제자매
ne: सौतेनी दाजुभाइ ग्रहण
sl: Posvojitev polbrata/polsestre

source: Birth of a grandson
cy: Geni ŵyr
hy: Թոռնիկի ծնունդ
ko: 손자의 출생
ne: नातिको जन्म
sl: Rojstvo vnuka

source: Birth of a granddaughter
cy: Geni wyres
hy: Թոռնուհու ծնունդ
ko: 손녀의 출생
ne: नातिनीको जन्म
sl: Rojstvo vnukinje

source: Birth of a grandchild
cy: Genedigaeth wyres
hy: Թոռնիկի ծնունդ
ko: 손주의 출생
ne: नातिनातिनी को जन्म
sl: Rojstvo vnuka/vnukinje

source: Christening of a grandson
cy: Bedyddio ŵyr
hy: Թոռնիկի մկրտություն
ko: 손자의 세례식
ne: नातिको नामकरण
sl: Krst vnuka

source: Christening of a granddaughter
cy: Bedyddio wyres
hy: Թոռնուհու մկրտություն
ko: 손녀의 세례식
ne: नातिनीको नामकरण
sl: Krst vnukinje

source: Christening of a grandchild
cy: Bedyddio wyres
hy: Թոռնիկի մկրտություն
ko: 손주의 세례식
ne: नातिनातिनाको नामकरण
sl: Krst vnuka/vnukinje

source: Baptism of a grandson
cy: Bedydd ŵyr
hy: Թոռանի մկրտություն
ko: 손자의 침례
ne: नातिको बप्तिस्मा
sl: Krst vnuka

source: Baptism of a granddaughter
cy: Bedydd wyres
hy: Թոռնուհու մկրտություն
ko: 손녀의 침례
ne: नातिनीको बप्तिस्मा
sl: Krst vnukinje

source: Baptism of a grandchild
cy: Bedydd wyres
hy: Թոռնիկի մկրտություն
ko: 손주의 침례
ne: नातिनातिनीको बप्तिस्मा
sl: Krst vnuka/vnukinje

source: Adoption of a grandson
cy: Mabwysiadu ŵyr
hy: Թոռնիկի որդեգրում
ko: 양자의 손자
ne: नाति ग्रहण
sl: Posvojitev vnuka

source: Adoption of a granddaughter
cy: Mabwysiadu wyres
hy: Թոռնուհու որդեգրում
ko: 양자의 손녀
ne: नातिनी ग्रहण
sl: Posvojitev vnukinje

source: Adoption of a grandchild
cy: Mabwysiadu wyres
hy: Թոռնիկի որդեգրում
ko: 양자의 손주
ne: नातिनातिना ग्रहण
sl: Posvojitev vnuka/vnukinje

# daughter’s son
source: Birth of a grandson
cy: Geni ŵyr
hy: Թոռնիկի ծնունդ
ko: 외손자의 출생
ne: नातिको जन्म
sl: Rojstvo vnuka

# daughter’s daughter
source: Birth of a granddaughter
cy: Geni wyres
hy: Թոռնուհու ծնունդ
ko: 외손녀의 출생
ne: नातिनीको जन्म
sl: Rojstvo vnukinje

# daughter’s son
source: Christening of a grandson
cy: Bedyddio ŵyr
hy: Թոռնիկի մկրտություն
ko: 외손자의 세례식
ne: नातिको नामकरण
sl: Krst vnuka

# daughter’s daughter
source: Christening of a granddaughter
cy: Bedyddio wyres
hy: Թոռնուհու մկրտություն
ko: 외손녀의 세례식
ne: नातिनीको नामकरण
sl: Krst vnukinje

# daughter’s son
source: Baptism of a grandson
cy: Bedydd ŵyr
hy: Թոռանի մկրտություն
ko: 외손자의 침례
ne: नातिको बप्तिस्मा
sl: Krst vnuka

# daughter’s daughter
source: Baptism of a granddaughter
cy: Bedydd wyres
hy: Թոռնուհու մկրտություն
ko: 외손녀의 침례
ne: नातिनीको बप्तिस्मा
sl: Krst vnukinje

# daughter’s son
source: Adoption of a grandson
cy: Mabwysiadu ŵyr
hy: Թոռնիկի որդեգրում
ko: 양자의 외손자
ne: नाति ग्रहण
sl: Posvojitev vnuka

# daughter’s daughter
source: Adoption of a granddaughter
cy: Mabwysiadu wyres
hy: Թոռնուհու որդեգրում
ko: 양자의 외손녀
ne: नातिनी ग्रहण
sl: Posvojitev vnukinje

# son’s son
source: Birth of a grandson
cy: Genedigaeth ŵyr
hy: Թոռնիկի ծնունդ
ko: 손자의 출생
ne: नातिको जन्म
sl: Rojstvo vnuka

# son’s daughter
source: Birth of a granddaughter
cy: Genedigaeth wyres
hy: Թոռնուհու ծնունդ
ko: 손녀의 출생
ne: नातिनीको जन्म
sl: Rojstvo vnukinje

# son’s son
source: Christening of a grandson
cy: Bedyddio ŵyr
hy: Թոռնիկի մկրտություն
ko: 손자의 세례식
ne: नातिको नामकरण
sl: Krst vnuka

# son’s daughter
source: Christening of a granddaughter
cy: Bedyddio wyres
hy: Թոռնուհու մկրտություն
ko: 손녀의 세례식
ne: नातिनीको नामकरण
sl: Krst vnukinje

# son’s son
source: Baptism of a grandson
cy: Bedydd ŵyr
hy: Թոռանի մկրտություն
ko: 손자의 침례
ne: नातिको बप्तिस्मा
sl: Krst vnuka

# son’s daughter
source: Baptism of a granddaughter
cy: Bedydd wyres
hy: Թոռնուհու մկրտություն
ko: 손녀의 침례
ne: नातिनीको बप्तिस्मा
sl: Krst vnukinje

# son’s son
source: Adoption of a grandson
cy: Mabwysiadu ŵyr
hy: Թոռնիկի որդեգրում
ko: 양자의 손자
ne: नाति ग्रहण
sl: Posvojitev vnuka

# son’s daughter
source: Adoption of a granddaughter
cy: Mabwysiadu wyres
hy: Թոռնուհու որդեգրում
ko: 양자의 손녀
ne: नातिनी ग्रहण
sl: Posvojitev vnukinje

source: Death of a son
cy: Marwolaeth mab
hy: Որդու մահ
ko: 아들의 사망
ne: छोराको मृत्यु
sl: Smrt sina

source: Death of a daughter
cy: Marwolaeth merch
hy: Դստեր մահը
ko: 딸의 사망
ne: छोरीको मृत्यु
sl: Smrt hčerke

source: Death of a child
cy: Marwolaeth plentyn
hy: Երեխայի մահ
ko: 자녀의 사망
ne: बालकको मृत्यु
sl: Smrt otroka

source: Burial of a son
cy: Claddu mab
hy: Որդու թաղում
ko: 아들의 매장
ne: छोराको अन्त्येष्टि
sl: Pokop sina

source: Burial of a daughter
cy: Claddu merch
hy: Դստեր հուղարկավորությունը
ko: 딸의 매장
ne: छोरीको दाहसंस्कार
sl: Pokop hčerke

source: Burial of a child
cy: Claddu plentyn
hy: Երեխայի թաղումը
ko: 자녀의 매장
ne: बच्चाको दाहसंस्कार
sl: Pokop otroka

source: Cremation of a son
cy: Amlosgiad mab
hy: Որդու դիակիզումը
ko: 아들의 화장
ne: छोराको दाहसंस्कार
sl: Upepelitev sina

source: Cremation of a daughter
cy: Amlosgiad merch
hy: Դստեր դիակիզում
ko: 딸의 화장
ne: छोरीको दाहसंस्कार
sl: Upepelitev hčerke

source: Cremation of a child
cy: Amlosgi plentyn
hy: Երեխայի դիակիզումը
ko: 자녀의 화장
ne: बच्चाको दाहसंस्कार
sl: Upepelitev otroka

source: Death of a brother
cy: Marwolaeth brawd
hy: Եղբոր մահ
ko: 남자형제의 사망
ne: भाइको मृत्यु
sl: Smrt brata

source: Death of a sister
cy: Marwolaeth chwaer
hy: Քրոջ մահը
ko: 자매의 사망
ne: दिदीबहिनीको मृत्यु
sl: Smrt sestre

source: Death of a sibling
cy: Marwolaeth brawd neu chwaer
hy: Եղբոր կամ եղբոր մահ
ko: 형제자매의 사망
ne: दाजुभाइको मृत्यु
sl: Smrt brata/sestre

source: Burial of a brother
cy: Claddu brawd
hy: Եղբոր թաղում
ko: 남자형제의 매장
ne: भाइको दाहसंस्कार
sl: Pokop brata

source: Burial of a sister
cy: Claddu chwaer
hy: Քրոջ հուղարկավորությունը
ko: 자매의 매장
ne: दिदीबहिनीको अन्त्येष्टि
sl: Pokop sestre

source: Burial of a sibling
cy: Claddu brawd neu chwaer
hy: Եղբոր կամ եղբոր հուղարկավորությունը
ko: 형제자매의 매장
ne: दाजुभाइको अन्त्येष्टि
sl: Pokop brata/sestre

source: Cremation of a brother
cy: Amlosgiad brawd
hy: Եղբոր դիակիզում
ko: 남자형제의 화장
ne: भाइको दाहसंस्कार
sl: Upepelitev brata

source: Cremation of a sister
cy: Amlosgi chwaer
hy: Քրոջ դիակիզումը
ko: 자매의 화장
ne: बहिनीको दाहसंस्कार
sl: Upepelitev sestre

source: Cremation of a sibling
cy: Amlosgi brawd neu chwaer
hy: Եղբոր կամ եղբոր դիակիզում
ko: 형제자매의 화장
ne: दाजुभाइको दाहसंस्कार
sl: Upepelitev brata/sestre

source: Death of a half-brother
cy: Marwolaeth hanner brawd
hy: Խորթ եղբոր մահ
ko: 이복형제의 사망
ne: सौतेनी भाइको मृत्यु
sl: Smrt polbrata

source: Death of a half-sister
cy: Marwolaeth hanner chwaer
hy: Խորթ քրոջ մահը
ko: 이복자매의 사망
ne: सौतेनी दिदीबहिनीको मृत्यु
sl: Smrt polsestre

source: Death of a half-sibling
cy: Marwolaeth hanner brawd neu chwaer
hy: Կիս եղբոր մահը
ko: 이복형제자매의 사망
ne: सौतेनी दाजुभाइको मृत्यु
sl: Smrt polbrata/polsestre

source: Burial of a half-brother
cy: Claddu hanner brawd
hy: Խորթ եղբոր թաղում
ko: 이복형제의 매장
ne: सौतेनी भाइको अन्त्येष्टि
sl: Pokop polbrata

source: Burial of a half-sister
cy: Claddu hanner chwaer
hy: Խորթ քրոջ հուղարկավորությունը
ko: 이복자매의 매장
ne: सौतेनी बहिनीको अन्त्येष्टि
sl: Pokop polsestre

source: Burial of a half-sibling
cy: Claddu hanner brawd neu chwaer
hy: Կիս եղբոր հուղարկավորությունը
ko: 이복형제자매의 매장
ne: सौतेनी दाजुभाइको अन्त्येष्टि
sl: Pokop polbrata/polsestre

source: Cremation of a half-brother
cy: Amlosgi hanner brawd
hy: Խորթ եղբոր դիակիզում
ko: 이복형제의 화장
ne: सौतेनी भाइको दाहसंस्कार
sl: Upepelitev polbrata

source: Cremation of a half-sister
cy: Amlosgi hanner chwaer
hy: Խորթ քրոջ դիակիզումը
ko: 이복자매의 화장
ne: सौतेनी बहिनीको दाहसंस्कार
sl: Upepelitev polsestre

source: Cremation of a half-sibling
cy: Amlosgi hanner brawd neu chwaer
hy: Կիս եղբոր դիակիզումը
ko: 이복형제자매의 화장
ne: सौतेनी दाजुभाइको दाहसंस्कार
sl: Upepelitev polbrata/polsestre

source: Death of a grandson
cy: Marwolaeth ŵyr
hy: Թոռնիկի մահ
ko: 손자의 사망
ne: नातिको मृत्यु
sl: Smrt vnuka

source: Death of a granddaughter
cy: Marwolaeth wyres
hy: Թոռնուհու մահը
ko: 손녀의 사망
ne: नातिनीको मृत्यु
sl: Smrt vnukinje

source: Death of a grandchild
cy: Marwolaeth wyres
hy: Թոռնիկի մահ
ko: 손주의 사망
ne: नातिनातिनीको मृत्यु
sl: Smrt vnuka/vnukinje

source: Burial of a grandson
cy: Claddu ŵyr
hy: Թոռնիկի թաղումը
ko: 손자의 매장
ne: नातिको अन्त्येष्टि
sl: Pokop vnuka

source: Burial of a granddaughter
cy: Claddu wyres
hy: Թոռնուհու հուղարկավորությունը
ko: 손녀의 매장
ne: नातिनीको दाहसंस्कार
sl: Pokop vnukinje

source: Burial of a grandchild
cy: Claddu wyres
hy: Թոռնիկի թաղումը
ko: 손주의 매장
ne: नातिनातिनाको अन्त्येष्टि
sl: Pokop vnuka/vnukinje

source: Cremation of a grandson
cy: Amlosgiad ŵyr
hy: Թոռանի դիակիզումը
ko: 손자의 화장
ne: नातिको दाहसंस्कार
sl: Upepelitev vnuka

source: Cremation of a granddaughter
cy: Amlosgiad wyres
hy: Թոռնուհու դիակիզումը
ko: 손녀의 화장
ne: नातिनीको दाहसंस्कार
sl: Upepelitev vnukinje

# daughter’s son
source: Death of a grandson
cy: Marwolaeth ŵyr
hy: Թոռնիկի մահ
ko: 외손자의 사망
ne: नातिको मृत्यु
sl: Smrt vnuka

# daughter’s daughter
source: Death of a granddaughter
cy: Marwolaeth wyres
hy: Թոռնուհու մահը
ko: 외손녀의 사망
ne: नातिनीको मृत्यु
sl: Smrt vnukinje

# daughter’s son
source: Burial of a grandson
cy: Claddu ŵyr
hy: Թոռնիկի թաղումը
ko: 외손자의 매장
ne: नातिको अन्त्येष्टि
sl: Pokop vnuka

# daughter’s daughter
source: Burial of a granddaughter
cy: Claddu wyres
hy: Թոռնուհու հուղարկավորությունը
ko: 외손녀의 매장
ne: नातिनीको दाहसंस्कार
sl: Pokop vnukinje

# daughter’s son
source: Cremation of a grandson
cy: Amlosgiad ŵyr
hy: Թոռանի դիակիզումը
ko: 외손자의 화장
ne: नातिको दाहसंस्कार
sl: Upepelitev vnuka

# daughter’s daughter
source: Cremation of a granddaughter
cy: Amlosgiad wyres
hy: Թոռնուհու դիակիզումը
ko: 외손녀의 화장
ne: नातिनीको दाहसंस्कार
sl: Upepelitev vnukinje

# son’s son
source: Death of a grandson
cy: Marwolaeth ŵyr
hy: Թոռնիկի մահ
ko: 손자의 사망
ne: नातिको मृत्यु
sl: Smrt vnuka

# son’s daughter
source: Death of a granddaughter
cy: Marwolaeth wyres
hy: Թոռնուհու մահը
ko: 손녀의 사망
ne: नातिनीको मृत्यु
sl: Smrt vnukinje

# son’s son
source: Burial of a grandson
cy: Claddu ŵyr
hy: Թոռնիկի թաղումը
ko: 손자의 매장
ne: नातिको अन्त्येष्टि
sl: Pokop vnuka

# son’s daughter
source: Burial of a granddaughter
cy: Claddu wyres
hy: Թոռնուհու հուղարկավորությունը
ko: 손녀의 매장
ne: नातिनी को दाहसंस्कार
sl: Pokop vnukinje

# son’s son
source: Cremation of a grandson
cy: Amlosgiad ŵyr
hy: Թոռանի դիակիզումը
ko: 손자의 화장
ne: नातिको दाहसंस्कार
sl: Upepelitev vnuka

# son’s daughter
source: Cremation of a granddaughter
cy: Amlosgiad wyres
hy: Թոռնուհու դիակիզումը
ko: 손녀의 화장
ne: नातिनीको दाहसंस्कार
sl: Upepelitev vnukinje

source: Cremation of a grandchild
cy: Amlosgiad wyres
hy: Թոռնիկի դիակիզումը
ko: 손주의 화장
ne: नातिनातिनाको दाहसंस्कार
sl: Upepelitev vnuka/vnukinje

source: Marriage of a son
cy: Priodas mab
hy: Որդու ամուսնություն
ko: 아들의 결혼
ne: छोराको विवाह
sl: Poroka sina

source: Marriage of a daughter
cy: Priodas merch
hy: Դստեր ամուսնություն
ko: 딸의 결혼
ne: छोरीको विवाह
sl: Poroka hčerke

source: Marriage of a child
cy: Priodas plentyn
hy: Երեխայի ամուսնությունը
ko: 자녀의 결혼
ne: बच्चाको विवाह
sl: Poroka otroka

source: Marriage of a grandson
cy: Priodas ŵyr
hy: Թոռնիկի ամուսնությունը
ko: 손자의 결혼
ne: नातिको विवाह
sl: Poroka vnuka

source: Marriage of a granddaughter
cy: Priodas wyres
hy: Թոռնուհու ամուսնությունը
ko: 손녀의 결혼
ne: नातिनातिनीको विवाह
sl: Poroka vnukinje

source: Marriage of a grandchild
cy: Priodas wyrion
hy: Թոռնիկի ամուսնությունը
ko: 손주의 결혼
ne: नातिनातिनीको विवाह
sl: Poroka vnuka/vnukinje

# daughter’s son
source: Marriage of a grandson
cy: Priodas ŵyr
hy: Թոռնիկի ամուսնությունը
ko: 외손자의 결혼
ne: नातिको विवाह
sl: Poroka vnuka

# daughter’s daughter
source: Marriage of a granddaughter
cy: Priodas wyres
hy: Թոռնուհու ամուսնությունը
ko: 외손녀의 결혼
ne: नातिनातिनीको विवाह
sl: Poroka vnukinje

# son’s son
source: Marriage of a grandson
cy: Priodas ŵyr
hy: Թոռնիկի ամուսնությունը
ko: 손자의 결혼
ne: नातिको विवाह
sl: Poroka vnuka

# son’s daughter
source: Marriage of a granddaughter
cy: Priodas wyres
hy: Թոռնուհու ամուսնությունը
ko: 손녀의 결혼
ne: नातिनातिनीको विवाह
sl: Poroka vnukinje

source: Marriage of a brother
cy: Priodas brawd
hy: Եղբոր ամուսնությունը
ko: 남자형제의 결혼
ne: भाइको विवाह
sl: Poroka brata

source: Marriage of a sister
cy: Priodas chwaer
hy: Քրոջ ամուսնությունը
ko: 자매의 결혼
ne: बहिनीको विवाह
sl: Poroka sestre

source: Marriage of a sibling
cy: Priodas brawd neu chwaer
hy: Եղբոր կամ եղբոր ամուսնությունը
ko: 형제자매의 결혼
ne: दाजुभाइको विवाह
sl: Poroka brata/sestre

source: Marriage of a half-brother
cy: Priodas hanner brawd
hy: Խորթ եղբոր ամուսնություն
ko: 이복형제의 결혼
ne: सौतेनी भाइको विवाह
sl: Poroka polbrata

source: Marriage of a half-sister
cy: Priodas hanner chwaer
hy: Խորթ քրոջ ամուսնությունը
ko: 이복자매의 결혼
ne: सौतेनी बहिनीको विवाह
sl: Poroka polsestre

source: Marriage of a half-sibling
cy: Priodas hanner brawd neu chwaer
hy: Խորթ եղբոր ամուսնությունը
ko: 이복형제자매의 결혼
ne: सौतेनी दाजुभाइको विवाह
sl: Poroka polbrata/polsestre

source: Death of a father
cy: Marwolaeth tad
hy: Հոր մահ
ko: 아버지의 사망
ne: बुवाको मृत्यु
sl: Smrt očeta

source: Death of a mother
cy: Marwolaeth mam
hy: Մոր մահ
ko: 어머니의 사망
ne: आमाको मृत्यु
sl: Smrt matere

source: Death of a parent
cy: Marwolaeth rhiant
hy: Ծնողի մահ
ko: 부모님의 사망
ne: आमाबुवाको मृत्यु
sl: Smrt starša

source: Burial of a father
cy: Claddu tad
hy: Հոր թաղումը
ko: 아버지의 매장
ne: बुवाको दाहसंस्कार
sl: Pokop očeta

source: Burial of a mother
cy: Claddu mam
hy: Մոր թաղումը
ko: 어머니의 매장
ne: आमाको अन्त्येष्टि
sl: Pokop matere

source: Burial of a parent
cy: Claddu rhiant
hy: Ծնողի թաղումը
ko: 부모님의 매장
ne: आमाबुवाको अन्त्येष्टि
sl: Pokop starša

source: Cremation of a father
cy: Amlosgi tad
hy: Հոր դիակիզում
ko: 아버지의 화장
ne: पिताको दाहसंस्कार
sl: Upepelitev očeta

source: Cremation of a mother
cy: Amlosgi mam
hy: Մոր դիակիզում
ko: 어머니의 화장
ne: आमाको दाहसंस्कार
sl: Upepelitev matere

source: Cremation of a parent
cy: Amlosgi rhiant
hy: Ծնողի դիակիզումը
ko: 부모님의 화장
ne: अभिभावकको दाहसंस्कार
sl: Upepelitev starša

source: Death of a grandfather
cy: Marwolaeth taid
hy: Պապիկի մահը
ko: 조부의 사망
ne: हजुरबुवाको मृत्यु
sl: Smrt dedka

source: Death of a grandmother
cy: Marwolaeth nain
hy: Տատիկի մահ
ko: 조모의 사망
ne: हजुरआमाको मृत्यु
sl: Smrt babice

source: Death of a grandparent
cy: Marwolaeth taid a nain
hy: Տատիկի ու պապիկի մահը
ko: 조부모의 사망
ne: हजुरबुबा हजुआमाको मृत्यु
sl: Smrt starega starša

source: Burial of a grandfather
cy: Claddu tad-cu/taid
hy: Պապիկի թաղում
ko: 조부의 매장
ne: हजुरबुवाको अन्त्येष्टि
sl: Pokop dedka

source: Burial of a grandmother
cy: Claddu mam-gu/nain
hy: Տատիկի թաղումը
ko: 조모의 매장
ne: हजुरआमाको अन्त्येष्टि
sl: Pokop babice

source: Burial of a grandparent
cy: Claddu taid a nain
hy: Տատիկի ու պապիկի հուղարկավորությունը
ko: 조부모의 매장
ne: हजुरबुवा/हजुरआमाको अन्त्येष्टि
sl: Pokop starega starša

source: Cremation of a grandfather
cy: Amlosgiad taid
hy: Պապիկի դիակիզումը
ko: 조부의 화장
ne: हजुरबुवाको दाहसंस्कार
sl: Upepelitev dedka

source: Cremation of a grandmother
cy: Amlosgiad mam-gu/nain
hy: Տատիկի դիակիզումը
ko: 조모의 화장
ne: हजुरआमाको दाहसंस्कार
sl: Upepelitev babice

source: Cremation of a grandparent
cy: Amlosgiad tad-cu/taid a mam-gu/nain
hy: Տատիկի ու պապիկի դիակիզումը
ko: 조부모의 화장
ne: हजुरबुवा हजुरआमाको दाहसंस्कार
sl: Upepelitev starega starša

source: Death of a maternal grandfather
cy: Marwolaeth tad-cu/taid mamol
hy: Մայրական պապի մահը
ko: 외조부의 사망
ne: मावलका हजुरबुवाको मृत्यु
sl: Smrt materinega očeta

source: Death of a maternal grandmother
cy: Marwolaeth mam-gu/nain mamol
hy: Մայրական տատիկի մահը
ko: 외조모의 사망
ne: मावलका हजुरआमाको मृत्यु
sl: Smrt materine matere

source: Burial of a maternal grandfather
cy: Claddu tad-cu/taid mamol
hy: Մորական պապի հուղարկավորությունը
ko: 외조부의 매장
ne: मावलका हजुरबुवाको अन्त्येष्टि
sl: Pokop materinega očeta

source: Burial of a maternal grandmother
cy: Claddu mam-gu/nain mamol
hy: Մայրական տատի հուղարկավորությունը
ko: 외조모의 매장
ne: मावलको हजुरआमाको अन्त्येष्टि
sl: Pokop materine matere

source: Cremation of a maternal grandfather
cy: Amlosgiad tad-cu/taid mamol
hy: Մայրական պապի դիակիզումը
ko: 외조부의 화장
ne: हजुरबुवाको दाहसंस्कार
sl: Upepelitev materinega očeta

source: Cremation of a maternal grandmother
cy: Amlosgiad mam-gu/nain mamol
hy: Մայրական տատի դիակիզումը
ko: 외조모의 화장
ne: हजुरआमाको दाहसंस्कार
sl: Upepelitev materine matere
